
1 Dr. Sarvapalli Radhakrishnan BR TN Public Affairs	1954
2 Shri Chakravarti Rajagopalachari BR TN Public Affairs	1954
3 Shri Chandrasekhara Raman Venkata BR TN Science &	1954
4 Dr. Satyendra Nath Bose PV WB Litt. & Edu.	1954
5 Shri Nandlal Bose PV WB Art	1954
6 Dr. Zakir Husain PV AP Public Affairs	1954
7 Shri Bal Gangadhar Kher PV MAH Public Affairs	1954
8 Shri V.K. Krishna Menon PV KER Public Affairs	1954
9 Shri Jigme Dorji Wangchuk PV BHU Public Affairs	1954
10 Dr. Homi Jehangir Bhabha PB MAH Science &	1954
11 Dr. Shanti Swarup Bhatnagar PB UP Science &	1954
12 Shri Mahadeva Iyer Ganapati PB OR Civil Service	1954
13 Dr. Jnan Chandra Ghosh PB WB Science &	1954
14 Shri Radha Krishna Gupta PB DEL Civil Service	1954
15 Shri Maithilisharan Gupta PB UP Litt. & Edu.	1954
16 Shri R.R. Handa PB PUN Civil Service	1954
17 Shri Amarnath Jha PB UP Litt. & Edu.	1954
18 Shri Ajudhia Nath Khosla PB DEL Science &	1954
19 Dr. K.S. Krishnan PB TN Science &	1954
20 Shri Moulana Hussain Ahmad Madni PB PUN Litt. & Edu.	1954
21 Shri Josh Malihabadi PB DEL Litt. & Edu.	1954
22 Shri V.L. Mehta PB GUJ Public Affairs	1954
23 Shri Vallathol Narayan Menon PB KER Litt. & Edu.	1954
24 Dr. Arcot Lakshamanaswami Mudaliar PB TN Litt. & Edu.	1954
25 Lt. (Col) Maharaj Kr. Palden T Namgyal PB PUN Public Affairs	1954
26 Shri V. Narahari Raooo PB KAR Civil Service	1954
27 Shri Pandyala Satyanarayana Rau PB AP Civil Service	1954
28 Shri Jamini Roy PB WB Art	1954
29 Shri Sukumar Sen PB WB Civil Service	1954
30 Shri Satya Narayana Shastri PB UP Medicine	1954
31 Late Smt. M.S. Subbalakshmi PB TN Art	1954
32 Lt. Gen. K.S. Thimayya PB KAR Civil Service	1954
33 Smt. Asha Devi Aryanayakam PS MAH Public Affairs	1954
34 Dr. Bir Bhan Bhatia PS DEL Medicine	1954
35 Smt. Perina Captian PS MAH Public Affairs	1954
36 Shri K.R. Chakravarty PS WB Science &	1954
37 Dr. Mathra Das PS ASM Medicine	1954
38 Kum. Amalprava Das PS ASM Public Affairs	1954
39 Shri Surinder Kumar Dey PS WB Civil Service	1954
40 Dr. Vasant Ramji Khanolkar PS MAH Medicine	1954
41 Smt. Achamma Mathai PS MAH Public Affairs	1954
42 Smt. Bhag Mehta PS GUJ Civil Service	1954
43 Shri Akhil Chandra Mitra PS UP Science &	1954
44 Shri Apa Saheb Bala Saheb Pant PS MAH Civil Service	1954
45 Shri Shankar Pillai PS DEL Litt. & Edu.	1954
46 Smt. Mrinmayi Ray PS AP Public Affairs	1954
47 Shri Tarlok Singh PS PUN Civil Service	1954
48 Shri Machani Somappa PS AP Public Affairs	1954
49 Major S.P.Patil Thorat PS MAH Civil Service	1954

1 Dr. Bhagwan Das BR UP Litt. & Edu.	1955
2 Pt. Jawaharlal Nehru BR UP Public Affairs	1955
3 Dr. M. Visvesvaraya BR KAR Civil Service	1955
4 Dr. Dhondo Keshav Karve PV MAH Litt. & Edu.	1955
5 Shri J.R.D. Tata PV MAH Trade & Ind.	1955
6 Shri Fateh Chand Badhwar PB PUN Civil Service	1955
7 Dr. Lalit Mohan Banerjee PB WB Medicine	1955
8 Dr. Suniti Kumar Chatterji PB WB Litt. & Edu.	1955
9 Smt. Kamaladevi Chattopadhyaya PB WB Social Work	1955
10 Shri Surender Kumar Dey PB USA Civil Service	1955
11 Dr. Vasant Ramji Khanolkar PB MAH Medicine	1955
12 Shri Sunder Das Khungar PB PUN Civil Service	1955
13 Smt. Rameshwari Nehru PB UP Social Work	1955
14 Dr. Pran Krushna Parija PB OR Litt. & Edu.	1955
15 Shri Madapati Rao PB AP Social Work	1955
16 Prof. Maneklal Sankalchand Thacker PB DEL Litt. & Edu.	1955
17 Shri Attur Rangaswami Venkatachari PB TN Civil Service	1955
18 Dr. Parakath Verghese Benjamin PS KER Medicine	1955
19 Shri Kewal Singh Choudhary PS PUN Civil Service	1955
20 Smt. Zarina Currimbhoy PS MAH Social Work	1955
21 Shri Krishna Kant Handiqui PS ASM Litt. & Edu.	1955
22 Smt. Mary Clubwalla Jadhav PS TN Social Work	1955
23 Shri Digambar Vasudev Joglekar PS MAH Civil Service	1955
24 Dr. Siddha Nath Kaul PS DEL Medicine	1955
25 Shri Maneck Jehangir Bhickaji Maneckji PS MAH Civil Service	1955
26 Dr. Mahesh Prasad Mehray PS UP Medicine	1955
27 Shri Humayun Mirza PS KAR Civil Service	1955
28 Shri Habib-ur Rahman PS DEL Science &	1955
29 Shri Laxmi Narayan Sahu PS OR Litt. & Edu.	1955
30 Smt. Rattan Shastri PS RAJ Litt. & Edu.	1955
31 Pt. Onkar Nath Thakore PS GUJ Art	1955

1 Shri Saiyid Fazl Ali PV BIH Public Affairs	1956
2 Smt. Jankibai Bajaj PV MP Social Work	1956
3 Shri Chandulal Madhavlal Trivedi PV MP Public Affairs	1956
4 Smt. Rukmini Devi Arundale PB TN Art	1956
5 Shri Rajshekhar Bose PB WB Litt. & Edu.	1956
6 Shri Dhyan Chand PB PUN Sports	1956
7 Shri Malur Srinivasa Thirumale Iyengar PB TN Civil Service	1956
8 Shri Nawab Zain Yar Jung PB AP Public Affairs	1956
9 Smt. Pushpavati Mehta PB MAH Public Affairs	1956
10 Shri Cottari Kanakaiyah Nayudu PB TN Sports	1956
11 Dr. Muthulakshmi Reddi PB TN Medicine	1956
12 Shri Kanwar Sain PB RAJ Civil Service	1956
13 Bhai Vir Singh PB PUN Litt. & Edu.	1956
14 Shri Kasturi Srinivasan PB TN Litt. & Edu.	1956
15 Smt. Mahadevi Varma PB UP Litt. & Edu.	1956
16 Dr. Tiruvadi Sambasiva Venkatraman PB TN Science &	1956
17 Dr. Suryya Kumar Bhuyan PS RAJ Litt. & Edu.	1956
18 Dr. Mohan Lal PS UP Medicine	1956
19 Shri Satish Chandra Majumdar PS WB Science &	1956
20 Dr. M.C. Modi PS KAR Medicine	1956
21 Shri Sukhdev Pande PS UTTR Litt. & Edu.	1956
22 Dr. Chintaman Govind Pandit PS GUJ Medicine	1956
23 Shri Sthanam Narasimha Rao PS AP Art	1956
24 Dr. Isaac Santra PS WB Medicine	1956
25 Dr. Sohan Singh PS PUN Medicine	1956

1 Shri Govind Ballabh Pant BR UP Public Affairs	1957
2 Shri Ghanshyamdas Birla PV RAJ Trade & Ind.	1957
3 Shri Sri Prakasa PV AP Public Affairs	1957
4 Shri Motilal Chimanlal Setalvad PV MAH Public Affairs	1957
5 Dr. Bhikham Lal Atreya PB UP Litt. & Edu.	1957
6 Smt. T. Balasaraswathy PB TN Art	1957
7 Dr. Rm. Alagappa Chettiar PB TN Social Work	1957
8 Dr. Hazari Prasad Dwivedi PB UP Litt. & Edu.	1957
9 Dr. Abid Husain PB UP Litt. & Edu.	1957
10 Ustad Mushtaq Husain Khan PB MP Art	1957
11 Smt. Lakshmi Menon PB KER Public Affairs	1957
12 Dr. Radha Kumud Mookerji PB WB Public Affairs	1957
13 Dr. K. Covilagam Kutti Ettan Raja PB KER Civil Service	1957
14 Smt. Andal Venkatasubba Rao PB AP Social Work	1957
15 Pt. Shrikrishna N. Ratanjankar PB UP Art	1957
16 Shri Syamnandan Sahaya PB BIH Litt. & Edu.	1957
17 Shri Govind Sakharam Sardesai PB MAH Litt. & Edu.	1957
18 Shri K.A. Nilakanta Sastri PB TN Litt. & Edu.	1957
19 Shri Boshi Sen PB WB Science &	1957
20 Dr. Siddheshwar Varma PB CHA Litt. & Edu.	1957
21 Shri Jashwantrai Jayantilal Anjaria PS MAH Civil Service	1957
22 Shri Atmaram Ramchand Chellani PS AP Civil Service	1957
23 Shri L. M. Chitale PS MAH Science &	1957
24 Smt. Nalini Bala Devi PS ASM Litt. & Edu.	1957
25 Shri Narayana swami Dharmrajan PS TN Civil Service	1957
26 Shri Ram Parkash Gehlote PS DEL Science &	1957
27 Shri Thakkadu Natesasastrigal Jagadisan PS TN Social Work	1957
28 Shri Sudhir Ranjan Khastgir PS UP Art	1957
29 Major Ralengnao Khathing PS MAN Public Affairs	1957
30 Shri Dwaram Venkataswami Naidu PS AP Art	1957
31 Shri Krishnaswami Ramiah PS AP Science &	1957
32 Dr. Shiyali Ramamritha Ranganathan PS KAR Litt. & Edu.	1957
33 Shri Samarendranath Sen PS WB Civil Service	1957
34 Maj. Gen. Gurbaksh Singh PS TN Civil Service	1957
35 Shri Balbir Singh PS CHA Sports	1957
36 Dr. Khushdeva Singh PS PUN Medicine	1957
1958
1 Dr. Dhondo Keshav Karve BR MAH Social Work	1958
2 Shri Salim Ali PB MAH Science &	1958
3 Maharaj Vijaya Ananda PB UP Sports	1958
4 Kumar D.P. Roy Choudhry PB WB Art	1958
5 Shri Jehangir Ghandy PB MAH Trade & Ind.	1958
6 Dr. Narayan Subrao Hardikar PB KAR Social Work	1958
7 Shri Ariyakudi Ramanuja Iyengar PB TN Art	1958
8 Ustad Allauddin Khan PB UP Art	1958
9 Shri Kumar Padma Sivasankara Menon PB KER Civil Service	1958
10 Shri Arathil C. Narayanan Nambiar PB KER Civil Service	1958
11 Dr. Kuppali V. Gowda Puttappa PB KAR Litt. & Edu.	1958
12 Prof. Poola Tirupati Raju PB RAJ Litt. & Edu.	1958
13 Smt. Kamalendumati Shah PB DEL Social Work	1958
14 Shri Rao Raja Hanunt Singh PB RAJ Public Affairs	1958
15 Dr. Rustom Jal Vakil PB MAH Medicine	1958
16 Shri Surya Narayan Vyas PB MP Litt. & Edu.	1958
17 Dr. Darashaw Nosherwan Wadia PB MAH Science &	1958
18 Shri Debaki Kumar Bose PS WB Art	1958
19 Shri Punamalai Ekambaranathan PS TN Social Work	1958
20 Smt. Fatima Ismail PS MAH Social Work	1958
21 Shri Shambhoo Maharaj PS UP Art	1958
22 Kum. Fatima A Rasheed Nargis PS MAH Art	1958
23 Dr. Bal Raj Nijhawan PS AUS Science &	1958
24 Dr. Benjamin Peary Pal PS DEL Science &	1958
25 Dr. Navalpakkam Parthasarathy PS THAI Science &	1958
26 Sardar Balwant Singh Puri PS PUN Social Work	1958
27 Shri Lakshminarayana Puram Ananthakrishnan Ramdas PS DEL Science &	1958
28 Smt. Devika Rani PS KAR Art	1958
29 Dr. Aragula Nagaraja Rao PS AP Trade & Ind.	1958
30 Shri Satyajit Ray PS WB Art	1958
31 Shri Moturi Satyanarayana PS TN Public Affairs	1958
32 Kanwar Digvijai Singh PS UP Sports	1958
33 Brig. Ram Singh PS PUN Civil Service	1958
34 Smt. R.S. Subbalakshmi PS TN Social Work	1958
35 Shri Ram Chandra Varma PS UP Litt. & Edu.	1958
36 Shri Maganlal Tribhuvandas Vyas PS GUJ Litt. & Edu.	1958
1959
1 Dr. John Matthai PV KER Litt. & Edu.	1959
2 Shri Gaganvihari Lallubhai Mehta PV MAH Social Work	1959
3 Dr. Radha Binode Pal PV WB Public Affairs	1959
4 Shri Sisir Kumar Bhaduri PB WB Art	1959
5 Shri Ramdhari Singh Dinkar PB UP Litt. & Edu.	1959
6 Shri Ali Yavar Jung PB MAH Civil Service	1959
7 Smt. Hansa Manubhai Mehta PB MAH Social Work	1959
8 Shri Pammal S. Mudaliar PB TN Art	1959
9 Shri Tiruppattur R. Venkatachala Murthi PB TN Litt. & Edu.	1959
10 Shri Tenzing Norgay PB WB Sports	1959
11 Shri Bhaurao Payagounda Patil PB MAH Social Work	1959
12 Dr. Jal Cawasha Paymaster PB MAH Medicine	1959
13 Smt. Dhanvanthi Rama Rau PB MAH Social Work	1959
14 Shri Nirmal Kumar Sidhanta PB WB Litt. & Edu.	1959
15 Shri Kankanhalli Vasudevacharya PB KAR Art	1959
16 Shri Barhgavram Vithal Warerkar PB MAH Public Affairs	1959
17 Shri Ghulam Yazdani PB AP Science &	1959
18 Shri Komaravolu Chandrasekharan PS TN Litt. & Edu.	1959
19 Smt. Shailabala Das PS OR Social Work	1959
20 Shri Manohar Balwant Diwan PS MAH Social Work	1959
21 Smt. Ratnamma Issac PS KAR Social Work	1959
22 Shri Lakshman Singh Jangpangi PS OR Social Work	1959
23 Shri Surendra Nath Kar PS WB Science &	1959
24 Shri Ganesh Govind Karkhanis PS KAR Social Work	1959
25 Shri Parixitlal Majumdar PS GUJ Social Work	1959
26 Shri Mathew Kandathil Mathulla PS KAR Civil Service	1959
27 Shri Om Prakash Mathur PS WB Science &	1959
28 Shri Prataprai Girdharilal Mehta PS MAH Public Affairs	1959
29 Shri Onkar Srinivasa Murthy PS TN Civil Service	1959
30 Shri Balwant Singh Nag PS PUN Civil Service	1959
31 Shri Parameshwaran Kuttappa Panikkar PS KER Civil Service	1959
32 Dr. Shivaji Rao Patwardhan PS MAH Medicine	1959
33 Dr. Atma Ram PS WB Trade & Ind.	1959
34 Shri Mihir Sen PS WB Sports	1959
35 Shri Homi Nusserwanji Sethna PS MAH Science &	1959
36 Shri Jemadar Milkha Singh PS CHA Sports	1959
37 Dr. Badri Nath Uppal PS CHA Science &	1959
1960
1 Shri Narayana Raghavan Pillai PV TN Public Affairs	1960
2 Dr. Rabindra Nath Chaudhuri PB WB Medicine	1960
3 Dr. Nilakantha Das PB OR Public Affairs	1960
4 Pt. Raj Rajeshwardatt Shastri Dravid PB UP Litt. & Edu.	1960
5 Kazi Nazrul Islam PB WB Litt. & Edu.	1960
6 Ustad Hafiz Ali Khan PB MP Art	1960
7 Pt. Balkrishna Sharma Navin PB DEL Litt. & Edu.	1960
8 Shri Ayyadevara Kaleswara Rao PB AP Public Affairs	1960
9 Shri Shiv Pujan Sahai PB BIH Litt. & Edu.	1960
10 Dr. Vithal Nagesh Shirodkar PB MAH Medicine	1960
11 Shri Haridas Siddhanta Vagish PB WB Litt. & Edu.	1960
12 Shri Rustom Merwanji Alpaiwala PS MAH Public Affairs	1960
13 Shri Nanabhai Bhatt PS MAH Social Work	1960
14 Shri Anil Kumar Das PS WB Science &	1960
15 Smt. Bina Das PS WB Social Work	1960
16 Dr. Kalpathy Rama Iyer Doraiswami PS TN Medicine	1960
17 Shri Vijay Hazare PS GUJ Sports	1960
18 Shri Bellary Shamanna Kesavan PS KAR Litt. & Edu.	1960
19 Dr. Adinath Lahiri PS WB Trade & Ind.	1960
20 Dr. Artaballav Mohanti PS OR Litt. & Edu.	1960
21 Shri Dahyabhai Jivanji Naik PS GUJ Social Work	1960
22 Shri Jasu Patel PS GUJ Sports	1960
23 Shri Nuthakki Bhanu Prasad PS AP Civil Service	1960
24 Shri Ayyagiri S. Rao PS AP Science &	1960
25 Kum. Arati Saha PS WB Sports	1960
26 Smt. Kulsum Sayani PS MAH Social Work	1960
27 Shri Harkrishan Lal Sethi PS DEL Civil Service	1960
28 Shri Harmandar Singh PS PUN Civil Service	1960
29 Dr. Vaidyanatha Subrahmanyan PS KAR Civil Service	1960
30 Smt. Vir Vati PS DEL Art	1960
31 Smt. Sofia Wadia PS MAH Social Work	1960
1961
1 Shri Bidhan Chandra Roy BR WB Public Affairs	1961
2 Shri Purushottam Das Tandon BR UP Public Affairs	1961
3 Dr. Tridib Nath Banerjee PB WB Medicine	1961
4 Dr. Rustomji Bomanji Billimoria PB MAH Medicine	1961
5 Seth Govind Das PB MP Litt. & Edu.	1961
6 Dr. Verrier Elwin PB UK Science &	1961
7 Shri Niranjan Das Gulhati PB DEL Civil Service	1961
8 Shri L. Aiyar Venkatakrishna Iyer PB TN Civil Service	1961
9 Shri Rai Krishnadas PB UP Litt. & Edu.	1961
10 Shri Sumitra Nandan Pant PB UP Litt. & Edu.	1961
11 Shri Svetoslav Roerich PB RUS Art	1961
12 Shri Bhagwan Sahay PB UP Civil Service	1961
13 Shri Vindhyeshwari Prasad Varma PB BIH Public Affairs	1961
14 Dr. Krishnaswamy Venkataraman PB MAH Trade & Ind.	1961
15 Shri Ardeshir Ruttonji Wadia PB MAH Litt. & Edu.	1961
16 Shri Kartar Singh Dewana PS PUN Science &	1961
17 Shri Vinayak Krishna Gokak PS KAR Litt. & Edu.	1961
18 Shri Kattingeri Krishna Hebbar PS MAH Art	1961
19 Smt. Kamalabai Hospet PS MAH Social Work	1961
20 Shri Martand Ramachandra Jamdar PS GUJ Social Work	1961
21 Shri Vishnukant Jha PS BIH Litt. & Edu.	1961
22 Bibi Harparkash Kaur PS PUN Social Work	1961
23 Shri Bismillah Khan PS UP Art	1961
24 Shri Agaram Krishnamachar PS KAR Civil Service	1961
25 Miss Evangeline Lazarus PS KAR Litt. & Edu.	1961
26 Dr. Hilda Mary Lazarus PS AP Medicine	1961
27 Shri Bhagwat Sinha Mehta PS RAJ Civil Service	1961
28 Prof. M.G.K. Menon PS DEL Science &	1961
29 Dr. Parsuram Misra PS OR Litt. & Edu.	1961
30 Shri Premendra Mitra PS WB Litt. & Edu.	1961
31 Shri Soman Narboo PS J&K Civil Service	1961
32 Shri Veerangowda V Patil PS KAR Social Work	1961
33 Shri Vithalrao Eknathrao Vikhe Patil PS MAH Trade & Ind.	1961
34 Smt. Mithuben Petit PS GUJ Social Work	1961
35 Shri Raghunath Krishna Phadke PS MP Art	1961
36 Dr. Brahm Prakash PS PUN Science &	1961
37 Shri Amal Kumar Shah PS BIH Social Work	1961
38 Brig. Gyan Singh PS UP Sports	1961
39 Shri Neyyadupakkam Duraiswami Sundaravadivelu PS TN Litt. & Edu.	1961
40 Shri Man Mohan Suri PS PUN Science &	1961
41 Muni Jin Vijayji PS RAJ Litt. & Edu.	1961
1962
1 Dr. Rajendra Prasad BR BIH Public Affairs	1962
2 Shri H. V. Varada Raja Iengar PV TN Civil Service	1962
3 Smt. Padmaja Naidu PV AP Public Affairs	1962
4 Smt. Vijaya Lakshmi Pandit PV UP Civil Service	1962
5 Col. Ramaswamy Duraiswamy Ayyar PB DEL Medicine	1962
6 Shri Gyanesh Chandra Chatterji PB DEL Litt. & Edu.	1962
7 Dr. Ramchandra Narayan Dandekar PB MAH Litt. & Edu.	1962
8 Dr. Prem Chandra Dhanda PB PUN Medicine	1962
9 Shri Asaf Ali Asghar Fyzee PB J&K Litt. & Edu.	1962
10 Shri Bade Ghulam Ali Khan PB MAH Art	1962
11 Shri Jafar Ali Khan PB UP Litt. & Edu.	1962
12 Dr. Daulat Singh Kothari PB DEL Civil Service	1962
13 Smt. Mithan J. Lam PB MAH Public Affairs	1962
14 Col. Sudhansu Sobhan Maitra PB WB Medicine	1962
15 Dr. Sisir Kumar Mitra PB WB Litt. & Edu.	1962
16 Smt. Tarabai Modak PB MAH Social Work	1962
17 Dr. Radha Kamal Mukerjee PB UP Science &	1962
18 Shri Sudhindra Nath Mukerjee PB WB Public Affairs	1962
19 Shri Mohd. Khan Niaz Fatehpuri PB UP Litt. & Edu.	1962
20 Dr. Jal R. Patel PB MAH Medicine	1962
21 Shri Narayan Sitaram Phadke PB MAH Litt. & Edu.	1962
22 Dr. Venkatarama Raghavan PB TN Litt. & Edu.	1962
23 Dr. Dukhan Ram PB BIH Medicine	1962
24 Smt. Saundaram Ramachandran PB TN Social Work	1962
25 Col. Mahankali Rao PB AP Medicine	1962
26 Dr. Raghunath Saran PB BIH Medicine	1962
27 Shri Moturi Satyanarayana PB TN Public Affairs	1962
28 Shri Sitaram Seksaria PB ASM Social Work	1962
29 Dr. Santosh Kumar Sen PB WB Medicine	1962
30 Shri Tarlok Singh PB PUN Civil Service	1962
31 Shri Radhika Raman Sinha PB BIH Litt. & Edu.	1962
32 Shri Vellore Ponnurangam Appadurai PS TN Civil Service	1962
33 Shri Tarashankar Bandyopadhyay PS WB Litt. & Edu.	1962
34 Shri Nari J. Contractor PS MAH Sports	1962
35 Shri Ashok Kumar Ganguly PS MAH Art	1962
36 Shri Amalananda Ghosh PS WB Civil Service	1962
37 Shri Sonam Gyatso PS SIK Sports	1962
38 Shri N. G. Ramaswami Iyer PS TN Social Work	1962
39 Shri Dula Bhaya Kag PS GUJ Litt. & Edu.	1962
40 Shri Ramanathan Krishnan PS TN Sports	1962
41 Dr. Krishnarao Shripat Mhaskar PS MAH Medicine	1962
42 Dr. Bishnupada Mukerji PS WB Civil Service	1962
43 Dr. Santosh Kumar Mukherji PS WB Medicine	1962
44 Shri Challagalla Narasimham PS AP Civil Service	1962
45 Shri Gostha Behari Paul PS WB Sports	1962
46 Shri Joseph Durai Raj PS DEL Civil Service	1962
47 Shri Shanti Kumar Tribhuvandas Raja PS OR Civil Service	1962
48 Shri Sochi Raut Roy PS OR Litt. & Edu.	1962
49 Shri Santu Jouharmal Shahaney PS WB Civil Service	1962
50 Shri Shridher Sharma PS RAJ Medicine	1962
51 Maj. Gen. Sarda Nand Singh PS PUN Civil Service	1962
52 Shri Natthi Singh PS UP Science &	1962
53 Mother Bojaxhiu Mary Teresa PS WB Social Work	1962
54 Shri P.R. Umrigar PS MAH Sports	1962
55 Shri V. Ramchandra Vajramushti PS AP Civil Service	1962
56 Shri Channapatna Krishnappa Venkataramayya PS KAR Litt. & Edu.	1962
1963
1 Dr. Zakir Husain BR AP Public Affairs
2 Dr. Pandurang Vaman Kane BR MAH Social Work
3 Dr. Suniti Kumar Chatterjee PV WB Litt. & Edu.
4 Dr. Arcot Lakshmanaswami Mudaliar PV TN Medicine
5 Shri Hari Vinayak Pataskar PV MAH Public Affairs
6 Dr. N. N. Bery PB PUN Medicine
7 Pandit Makhanlal Chaturvedi PB MP Litt. & Edu.
8 Shri Omeo Kumar Das PB ASM Social Work
9 Shri Nitish Chandra Laharry PB WB Social Work
10 Dr. Badri Nath Prasad PB UP Litt. & Edu.
11 Dr. Kanuri Lakshmana Rao PB DEL Civil Service
12 Shri Rahul Sankritayan PB UP Litt. & Edu.
13 Shri Ramanlal Gokaldas Saraiya PB MAH Public Affairs
14 Shri Trivenkata Rajendra Seshadri PB TN Litt. & Edu.
15 Maj. Gen. Sardar Harnarain Singh PB PUN Civil Service
16 Dr. M. L. Soni PB DEL Medicine
17 Dr. Ram Kumar Verma PB UP Litt. & Edu.
18 Shri Mushtaq Ali PS MP Sports
19 Shri Purnendu Kumar Banerjee PS WB Civil Service
20 Lt. Col. George William Gregory Bird PS UK Medicine
21 Dr. Nani Chandra Bordoloi PS ASM Medicine
22 Shri Brij Krishan Chandiwala PS DEL Social Work
23 Shri Ahindra Chowdhury PS WB Litt. & Edu.
24 Shri Melville Demellow PS RAJ Art
25 Shri Sumat Kishore Jain PS UP Civil Service
26 Shri K. C. Johorey PS HRY Civil Service
27 Shri Mehboob Khan PS MAH Art
28 Shri Sisir Kumar Lahiri PS UK Civil Service
29 Rev Joel Lakra PS BIH Social Work
30 Smt. Piloo M. Maneckji PS MAH Social Work
31 Smt. Leela Sumant Mulgaonkar PS MAH Social Work
32 Shri N. G.K. Murti PS TN Civil Service
33 Dr. Sohrabji Pestonji Shroff PS DEL Medicine
34 Prof. Rashid Ahmed Siddiqi PS DEL Litt. & Edu.
35 Shri Rana Krishnadev Narain Singh PS ASM Civil Service
36 Shri Bishan Man Singh PS UP Science &
37 Shri Noshir Framroze Suntook PS MAH Civil Service
38 Shri S. S. Yadav PS DEL Civil Service
1964
1 Shri Acharya Kakasaheb Kalelkar (Dattatreya Balkrishna) PV MAH Litt. & Edu.
2 Pt. Gopinath Kaviraj PV UP Litt. & Edu.
3 Dr. Sheikh Abdullah PB UP Litt. & Edu.
4 Shri Nur-ud-din Ahmed PB DEL Public Affairs
5 Dr. Rafiuddin Ahmed PB WB Medicine
6 Dr. Jacob Chandy PB KER Medicine
7 Pandit Kunji Lal Dubey PB MP Public Affairs
8 Shri Tushar Kanti Ghosh PB WB Litt. & Edu.
9 Shri Anil Bandhu Guha PB WB Civil Service
10 Prof. Mohd. Abdul Hai PB BIH Medicine
11 Shri Dara Nussarwanji Khurody PB BRT Trade & Ind.
12 Prof. Anukul Chandra Mukerji PB UP Litt. & Edu.
13 Dr. Jnanendra Nath Mukherjee PB WB Science &
14 Shri Bhola Nath Mullik PB DEL Civil Service
15 Shri R.Krishnaswami Narayan PB KAR Litt. & Edu.
16 Dr. Chintaman Govind Pandit PB MAH Medicine
17 Shri Tribhovandas Kishibhai Patel PB GUJ Social Work
18 Shri Narayanrao Shripad Gandharva Rajhans alias Bal PB MAH Art
19 Shri T. Narayanayajwa Ramachandran PB TN Science &
20 Dr. Kushwant Lal Wig PB PUN Medicine
21 Shri Paramananda Acharya PS OR Science &
22 Smt. S. Ambujammal PS TN Social Work
23 Shri Nawang Gombu PS WB Sports
24 Shri Morapakam Josiam Gopalan PS TN Sports
25 Shri Thepfoorya Haralu PS AP Civil Service
26 Shri Vinayak Pandurang Karmarkar PS MAH Art
27 Shri Adi Marzban PS MAH Art
28 Lt. Col Santosh Kumar Mazumdar PS DEL Medicine
29 Dr. Gadde Ramakoteswar Rao PS AP Science &
30 Shri Krishna Chandra Shukla PS RAJ Litt. & Edu.
31 Shri Charanjit Singh PS HRY Sports
32 Shri Pratul Chandra Sorcar PS WB Art
33 Lt. Col Rameshchandra Bhaskar Sule PS MAH Civil Service
1965
1 Gen. Jayanto Nath Chaudhuri PV WB Civil Service
2 Shri Mehdi Nawaz Jung PV AP Public Affairs
3 Air Arjan Singh PV DEL Civil Service
4 Shri Krishnaswami Balasubramania Ayyar PB TN Public Affairs
5 Dr. Joges Chandra Banerjea PB WB Medicine
6 Lt. General Joginder Singh Dhillon PB PUN Civil Service
7 Capt. Raja Shrimant Chintamanrao PB MAH Public Affairs
8 Dr. Bhalchandra Babaji Dikshit PB MAH Medicine
9 Lt. General P.O. Dunn PB MAH Civil Service
10 Shri Narasinh Narayan Godbole PB MAH Litt. & Edu.
11 Shri Nawang Gombu PB WB Sports
12 Shri Sonam Gyatso PB SIK Sports
13 Lt. General Kashmir Singh Katoch PB PUN Civil Service
14 Mir Akbar Ali Khan PB AP Public Affairs
15 Shri Shantanu Lakshman Kirloskar PB MAH Trade & Ind.
16 Lt. Cmdr. Mohan Singh Kohli PB DEL Sports
17 Air Vice P.Chandra Lal PB PUN Civil Service
18 Prof. Mohd Mujeeb PB DEL Litt. & Edu.
19 Dr. Jayant Vishnu Narlikar PB MAH Science &
20 Air Vice Ramaswamy Rajaram PB TN Civil Service
21 Dr. Kalpathi Ramakrishna Ramanathan PB TN Science &
22 Shri Satyajit Ray PB WB Art
23 Dr. Triguna Sen PB WB Litt. & Edu.
24 Shri Santu Jouharmal Shahaney PB WB Civil Service
25 Pandit Shiv Sharma PB UP Medicine
26 Lt. (Gen.) Harbakhsh Singh PB DEL Civil Service
27 Shri Brindaban Lal Verma PB UP Litt. & Edu.
28 Shri Manikya Lal Verma PB RAJ Social Work
29 Shri Krutartha Acharya PS OR Trade & Ind.
30 Prof. Vishnu Namdeo Adarkar PS MAH Litt. & Edu.
31 Capt. Hari Pal Singh Ahluwalia PS PUN Sports
32 Rev Panavelil Thomas Chandi PS UP Litt. & Edu.
33 Capt. Avtar Singh Vohra Cheema PS PUN Sports
34 Shri Kandathil Mammen Cherian PS KER Litt. & Edu.
35 Prof. Dinkar Balwant Deodhar PS MAH Sports
36 Shri Phu Dorji PS WB Sports
37 Dr. Vishnu Madava Ghatage PS KAR Science &
38 Shri John Travere Mends Gibson PS RAJ Litt. & Edu.
39 Smt. Mona Chandravati Gupta PS UP Social Work
40 Hakim Abdul Hameed PS DEL Medicine
41 Shri Wilson Jones PS MAH Sports
42 Shri Ang Kami PS ASM Sports
43 Prof. Anant Atmaram Kanekar PS MAH Litt. & Edu.
44 Shri Hanumanbax Kanoi PS RAJ Trade & Ind.
45 Major Narendra Kumar PS PUN Sports
46 Shri Varghese Kurien PS GUJ Trade & Ind.
47 Guru Kunju Kurup PS KER Art
48 Smt. Lakshmi Mazumdar PS DEL Social Work
49 Dr. Dwijendra Nath Mukerjee PS WB Medicine
50 Shri Vuppalathadiyam Nagayya PS TN Art
51 Shri Gordhandas Bhagwandas Narottamdas PS MAH Social Work
52 Dr. Tonse Madhava Pai PS KAR Litt. & Edu.
Anantha
53 Shri Jashbhai Shankarbhai Patel PS GUJ Science &
54 Shri Ravishanker Mahashanker Raval PS GUJ Art
55 Shri Harish Chander Singh Rawat PS DEL Sports
56 Rt. (Rev.) John Richardson PS A&N Social Work
57 Smt. Mrinalini Sarabhai PS GUJ Art
58 Smt. Thrity H. Taleyarkhan PS MAH Social Work
59 Prof. Mrityanjaya Vaidyanathan PS TN Science &
60 Shri Chandra Prakash Vohra PS WB Sports
61 Shri Gopal Prasad Vyas PS DEL Litt. & Edu.
62 Shri Sonam Wangyal PS SIK Sports
1966
1 Shri Lal Bahadur Shastri BR UP Public Affairs
2 Dr. Valerian Cardinal Gracias PV MAH Social Work
3 Shri T.S. Ramaswami Aiyar PB TN Public Affairs
4 Shri Babubhai Maneklal Chinai PB MAH Trade & Ind.
5 Dr. Puliyur Krishnaswamy Duraiswami PB DEL Medicine
6 Shri Varghese Kurien PB GUJ Trade & Ind.
7 Shri Zubin Mehta PB CAN Art
8 Shri K.P. Kesava Menon PB KER Public Affairs
9 Shri Bhabani Charan Mukharji PB WB Civil Service
10 Shri Mannathu Padmanabhan PB KER Social Work
11 Shri Shankar Pillai PB DEL Art
12 Dr. Vikram Ambalal Sarabhai PB GUJ Science &
13 Shri Vinayak Sitaram Sarwate PB MP Litt. & Edu.
14 Shri Homi Nusserwanji Sethna PB MAH Civil Service
15 Dr. Bhai Jodh Singh PB PUN Litt. & Edu.
16 Shri Haribhau Upadhyaya PB UP Litt. & Edu.
17 Shri Ebrahim Alkazi PS DEL Trade & Ind.
18 Shri Poddar Ramavtar Arun PS MAH Litt. & Edu.
19 Shri Surinder Singh Bedi PS DEL Civil Service
20 Shri Kundan Lal Bery PS PUN Civil Service
21 Dr. Ernest Joachim Borges PS MAH Medicine
22 Prof. Nirmal Kumar Bose PS WB Litt. & Edu.
23 Shri Stanislaus Joseph Coelho PS MAH Civil Service
24 Swami Bichitrananda Das PS OR Social Work
25 Dr. Robert Breocklesby Davis PS BIH Medicine
26 Shri Purushottam Laxman Deshpande PS MAH Litt. & Edu.
27 Dr. Dharmendra PS DEL Medicine
28 Dr. Satish Dhawan PS KAR Science &
29 Shri Villupuram Chinnaiya Ganesan PS TN Art
30 Shri Maqbool Fida Husain PS DEL Art
31 Shri Eswara Iyer Krishna Iyer PS TN Art
32 Shri Mohammad Din Jagir PS J&K Social Work
33 Dr. (Miss) Jerusha Jhirad PS MAH Medicine
34 Shri Ramprasad Ramchand Khandelwal PS UP Trade & Ind.
35 Shri Kishan Lal PS UP Sports
36 Shri Sanganvasappa Mallangouda Patil PS KAR Civil Service
37 Shri Jagdish Prasad PS UP Civil Service
38 Shri Sayyid Ahmadullah Qadri PS AP Litt. & Edu.
39 Smt. Sumitra Charat Ram PS DEL Art
40 Smt. Bhanumati Ramakrishna PS TN Art
41 Shri B. Sivamurthy Sastry PS KAR Litt. & Edu.
42 Shri Harishankar Sharma PS UP Litt. & Edu.
43 Sardar Mohan Singh PS DEL Civil Service
44 Shri Inderjit Singh Tulsi PS DEL Litt. & Edu.
45 Shri Kuldip Singh Virk PS PUN Civil Service
46 Shri Rajeshwar Nath Zutshi PS MP Litt. & Edu.
1967
1 Shri Chandra Kisan Daphtary PV MAH Public Affairs
2 Shri Hafiz Mohammad Ibrahim PV AP Civil Service
3 Shri Bhola Nath Jha PV UP Civil Service
4 Shri Pattadakal Venkanna Rao PV AP Civil Service
5 Shri Mulk Raj Anand PB MAH Litt. & Edu.
6 Smt. Tara Cherian PB TN Social Work
7 Shri Mulk Raj Chopra PB UTTR Civil Service
8 Dr. Tulsi Das PB PUN Medicine
9 Shri Krishna Kanta Handique PB ASM Litt. & Edu.
10 Shri Akshay Kumar Jain PB DEL Litt. & Edu.
11 Smt. Pupul Jayakar PB DEL Social Work
12 Shri Ali Akbar Khan PB WB Art
13 Shri Dharamnath Prasad Kohli PB PUN Civil Service
14 Shri Ramanathan Krishnan PB TN Sports
15 Maj. Gen. C.Kottieth Lakshmanan PB TN Medicine
16 Dr. T.M.Ponnambalam Mahadevan PB TN Litt. & Edu.
17 Shri Kalyanji Vithalbhai Mehta PB GUJ Litt. & Edu.
18 Dr. (Smt.) Sivaramakrishna Padmavati PB DEL Medicine
19 Shri Vasantrao Bandoji Patil PB MAH Trade & Ind.
20 Dr. Dadasaheb Pavate PB KAR Litt. & Edu.
21 Shri Datto Vaman Potdar PB MAH Litt. & Edu.
22 Shri Benegal Shiva Rao PB DEL Litt. & Edu.
23 Dr. Khwaja Ghulam Saiyidain PB UP Litt. & Edu.
24 Shri Asoke Kumar Sarkar PB WB Litt. & Edu.
25 Shri Mihir Kumar Sen PB WB Sports
26 Shri Ravi Shankar PB UP Art
27 Shri Kaikhushru Ruttonji Shroff PB MAH Public Affairs
28 Smt. M.L. Vasanthakumari PB AP Art
29 Dr. A. Ramaswami Gopal Ayengar PS MAH Science &
30 Shri Kiron Chandra Banerjee PS WB Civil Service
31 Shri Krishnachandra Moreshwar Bhatawadekar PS MAH Art
32 Shri Balkrishna Bhagwant Borkar PS GOA Litt. & Edu.
33 Dr. Guduru Venkata Chalam PS TN Science &
34 Shri Nagappa Chettiar PS TN Trade & Ind.
35 Shri Chandi Dan PS RAJ Science &
36 Shri Vasant Desai PS MAH Art
37 Smt. Siddheshwari Devi PS DEL Art
38 Shri Frank Sathyarajan Dewars PS BUR Civil Service
39 Shri Syed Fareeduddin PS AP Science &
40 Shri Ali Sardar Jafri PS MAH Litt. & Edu.
41 Dr. Puthenpurayil Joseph PS KER Litt. & Edu.
42 Smt. Prabhjot Kaur PS DEL Litt. & Edu.
43 Shri Shankar Laxman PS KAR Sports
44 Shri Mayadhar Mansinha PS OR Litt. & Edu.
45 Shri Chandravadan Chimanlal Mehta PS GUJ Litt. & Edu.
46 Shri Ved Rattan Mohan PS UP Trade & Ind.
47 Shri Sasadhar Mukerji PS MAH Art
48 Shri Kashi Prasad Pande PS MP Public Affairs
49 Nawab Mohd. Mansur Ali Khan Pataudi PS DEL Sports
50 Shri Maganbhai Ranchhodbhai Patel PS GUJ Science &
51 Shri Harischandra Gopal Patil PS MAH Science &
52 Miss Edith Helen Paull PS MAH Medicine
53 Shri Shanti Prasad PS UP Civil Service
54 Syed Abdul Qadir PS UP Social Work
55 Shri Mohammad Rafi PS PUN Art
56 Shri Kalluri Subba Rao PS AP Social Work
57 Shri Vinjamuri Venkata Lakshmi Narasimha Rao PS TN Art
58 Dr. Amar Prasad Ray PS DEL Medicine
59 Shri Balbir Singh Saigal PS DEL Civil Service
60 Dr. Hermenogild Santapau PS SPAN Science &
61 Shri Priya Ranjan Sen PS WB Social Work
62 Shri Vithaldas Shah PS MAH Trade & Ind.
63 Shri Prithipal Singh PS PUN Sports
64 Lt. Col. Lal Singh PS UTTR Science &
65 Shri Gurdial Singh PS CHA Sports
66 Shri Ajit Singh PS PUN Science &
67 Dr. Monkombu Sambasivan Swaminathan PS TN Science &
68 Dr. Natteri Veeraraghavan PS TN Medicine
69 Shri Lal Chand Verman PS DEL Public Affairs
1968
1 Dr. Madhav Shrihari Aney PV MP Public Affairs
2 Dr. Subrahmanyan Chandrasekhar PV USA Science &
3 Prof. Prasanta Chandra Mahalanobis PV DEL Litt. & Edu.
4 Shri Kirpal Singh PV DEL Civil Service
5 Shri K. Vaidyanatha Sundaram PV DEL Public Affairs
Kalyana
6 Acharya Vishva Bandhu PB UP Litt. & Edu.
7 Dr. Prabhu Lal Bhatnagar PB KAR Science &
8 Dr. Sudhir Ranjan Sen Gupta PB WB Litt. & Edu.
9 Smt. Mary Clubwala Jadhav PB MAH Social Work
10 Dr. K.S. Karanth PB KAR Litt. & Edu.
11 Shri Bismillah Khan PB UP Art
12 Shri Vishnu Sakharam Khandekar PB MAH Litt. & Edu.
13 Lt. Gen. S.H.F. Jamshedji Manekshaw PB MAH Civil Service
14 Shri Mansukhlal Atmaram Master PB MAH Public Affairs
15 Dr. M Govinda Kumar Menon PB DEL Medicine
16 Shri Waman Bapuji Metre PB MAH Science &
17 Shri Gujar Mal Modi PB UP Trade & Ind.
18 Dr. Murugappa Channaveerappa Modi PB KAR Medicine
19 Shri Gopalan Narasimhan PB TN Litt. & Edu.
20 Dr. Benjamin Peary Pal PB PUN Science &
21 Dr. Brahm Prakash PB PUN Science &
22 Shri Manukonda Rao PB AP Litt. & Edu.
23 Dr. Calyampudi Radhakrishna Rao PB DEL Science &
24 Shri Radhanath Rath PB OR Litt. & Edu.
25 Dr. Jyotish Chandra Ray PB WB Medicine
26 Dr. Mariadas Ruthnaswamy PB TN Litt. & Edu.
27 Shri Raghupati Sahai Firaq PB UP Litt. & Edu.
28 Shri Shripad Damodar Satwalekar PB MAH Litt. & Edu.
29 Shri Govind Kurup Shankara PB KER Litt. & Edu.
30 Shri Manchakkattuvalasu Palanivelappa Gounder Periaswamy Thooran PB TN Litt. & Edu.
31 Shri Sarda Prasad Varma PB UP Civil Service
32 Shri Shamprasad Rupshankar Vasavada PB GUJ Social Work
33 Shri Mamidipudi Venkatarangayya PB AP Litt. & Edu.
34 Shri M.Ramchandra Achrekar PS MAH Art
35 Smt. Sharan Rani Backliwal PS DEL Art
36 Shri S.Ramaswamy Iyer Balasubrahmanyam PS KER Science &
37 Shri Nikhil Banerjee PS WB Art
38 Smt. Akhtari Bai Faizabadi alias Begum Akhtar PS UP Art
39 Shri Dattetrreya Ramachandra Bendre PS KAR Litt. & Edu.
40 Shri Jehangir Shapurji Bhownagary PS FRA Civil Service
41 Shri Manibhai Bhimbhai Desai PS MAH Social Work
42 Shri Narendra Singh Dev PS MP Social Work
43 Shri Lakshman Dev PS UP Science &
44 Rajkumari Sumitra Devi PS HRY Social Work
45 Shri Sunil Dutt PS MAH Art
46 Shri Bhaurao Krishnarao Gaikwad PS MAH Social Work
47 Shri Kedar Ghosh PS WB Litt. & Edu.
48 Shri Amar Nath Gupta PS DEL Social Work
49 Shri Joseph Harold PS DEL Art
50 Shri Shamrao Sakharamrao Kadam PS MAH Litt. & Edu.
51 Dr. Govind Pandurang Kane PS MAH Science &
52 Smt. Durga Khote PS MAH Art
53 Kum. Yamini Krishnamurti PS DEL Art
54 Smt. Shalini Moghe PS MP Social Work
55 Shri Narinder Nath Mohan PS HRY Social Work
56 Shri Akhtar Mohiuddin PS J&K Litt. & Edu.
57 Shri Sambhu Nath Mukheerjee PS WB Social Work
58 Shri Krishna Swarup Mullick PS DEL Civil Service
59 Dr. G. Narasimhan PS TN Social Work
60 Shri Sis Ram Ola PS RAJ Social Work
61 Shri Jaikishan Dahyabhai Panchal PS MAH Art
62 Shri Balasaheb Amgonda Patil PS MAH Litt. & Edu.
63 Pt. Ayodhya Prasad PS UP Art
64 Shri Shankar Singh Ram Raghuvanshi PS MAH Art
65 Dr. Raja Ramanna PS TN Science &
66 Shri Man Sinh Mahobat Rana PS DEL Science &
67 Dr. Abhin Chandra Rao PS OR Medicine
68 Shri Akkineni Nageswara Rao PS AP Art
69 Shri Nandamuri Taraka Rama Rao PS AP Art
70 Smt. Sudha Venkatasiva Reddy PS KAR Social Work
71 Shri Devi Lal Samar PS RAJ Art
72 Shri Donthy Naranappa Krishnaiah Setty PS KAR Social Work
73 Shri Devachand Shah PS MAH Litt. & Edu.
74 Shri Calambur Sivaramamurti PS DEL Litt. & Edu.
75 Shri Sudheer Sojwal PS HRY Science &
76 Shri Mantosh Sondhi PS HRY Civil Service
77 Smt. Vaijayantimala PS TN Art
1969
1 Shri Rajeshwar Dayal PV DEL Civil Service
2 Shri Dattatraya Shridhar Joshi PV MAH Civil Service
3 Dr. Hargobind Khorana PV USA Science &
4 Dr. Mohan Sinha Mehta PV RAJ Civil Service
5 Shri Ghananand Pande PV UP Civil Service
6 Dr. Tarasankar Bandopadhyaya PB WB Litt. & Edu.
7 Shri Krishna Chander PB MAH Litt. & Edu.
8 Shri Rahim-ud-din Khan Dagar PB DEL Art
9 Prof. Mohanlal Lalloobhai Dantwala PB MAH Science &
10 Dr. Keshavrao Krishnarao Datey PB MAH Medicine
11 Shri Keshav Prasad Goenka PB WB Trade & Ind.
12 Shri Semmangudi Srinivasa Iyer PB TN Art
13 Shri Vithalbhai Jhaveri PB MAH Litt. & Edu.
14 Shri Prithvi Raj Kapoor PB PUN Art
15 Smt. Kesarbai Kerkar PB MAH Art
16 Shri Krishna Ramchand Kriplani PB DEL Litt. & Edu.
17 Dr. Adinath Lahiri PB WB Science &
18 Shri Gobind Behari Lal PB USA Litt. & Edu.
19 Shri Kasturbhai Lalbhai PB GUJ Trade & Ind.
20 Kum. Lata Dinanath Mangeshkar PB MAH Art
21 Dr. Vatakke Kurupath Narayana Menon PB KER Science &
22 Shri Raman Madhavan Nair PB CHA Litt. & Edu.
23 Shri Samad Yar Khan Saghar Nizami PB UP Litt. & Edu.
24 Dr. Narayan Bhikaji Parulekar PB MAH Litt. & Edu.
25 Shri Yeshwant Dinkar Pendharkar PB MAH Litt. & Edu.
26 Shri Vitthal Laxman @Mamasaheb Phadke PB GUJ Social Work
27 Shri Raja Rao PB USA Litt. & Edu.
28 Dr. Niharranjan Ray PB WB Litt. & Edu.
29 Dr. Prafulla Kumar Sen PB MAH Medicine
30 Dr. Vallabhadas Vithaldas Shah PB MAH Medicine
31 Prof. Haroon Khan Sherwani PB AP Litt. & Edu.
32 Shri Kasturiswami Sreenivasan PB TN Trade & Ind.
33 Shri Naval Hormusji Tata PB MAH Social Work
34 Shri Subramaniam Sreenivasan Vasan PB TN Art
35 Shri Khwaja Ahmad Abbas PS MAH Art
36 Shri David Abraham PS MAH Art
37 Dr. Bal Krishan Anand PS DEL Medicine
38 Dr. Ramakrishna Iyer Ananthakrishnan PS MAH Science &
39 Dr. Tarapada Basu PS UK Litt. & Edu.
40 Prof. Narayan Sridhar Bendre PS MAH Art
41 Dr. Nautam Bhagwanlal Bhatt PS DEL Science &
42 Shri Chandrakant Gulabrao Borde PS MAH Sports
43 Shri Sachin Dev Burman PS WB Art
44 Dr. Ram Kumar Caroli PS UP Medicine
45 Dr. Amrik Singh Cheema PS PUN Science &
46 Shri Shri Chand Chhabra PS DEL Civil Service
47 Shri Gopaldas Neogi Chowdhury PS WB Social Work
48 Shri Brahm Nath 'Qasir' Datta PS WB Litt. & Edu.
49 Shri Yogeshwar Dayal PS DEL Science &
50 Shri Subodh Chandra Dev PS ASM Civil Service
51 Smt. Byrappa Saroja Devi PS KAR Art
52 Shri Pandurang Vasudeo Gadgil PS MAH Litt. & Edu.
53 Dr. Pandurang Rajaram Ghogrey PS MAH Social Work
54 Shri Surendra Nath Ghosh PS UP Litt. & Edu.
55 Shri Kalyan Singh Gupta PS DEL Social Work
56 Shri Shyam Lal Gupta PS DEL Litt. & Edu.
57 Smt. Lila Indrasen PS PUD Social Work
58 Shri Harkishandas Bhagwandas Kapadia PS MAH Social Work
59 Shri Mahendra Nath Kapur PS PUN Litt. & Edu.
60 Shri Gajanan Digambar Madgulkar PS MAH Litt. & Edu.
61 Dr. T. Venkatarama Mahalingam PS TN Science &
62 Shri Upendra Maharathi PS BIH Trade & Ind.
63 Shri Kaviraj Ashutosh Majumdar PS UP Medicine
64 Shri K.S.A. Khader Ghulam Mohideen PS TN Trade & Ind.
65 Shri Sudhir Krishna Mukherji PS DEL Civil Service
66 Shri H. Govindrao Murthy PS USA Science &
67 Shri Thiagarajan Muthian PS TN Litt. & Edu.
68 Shri Srinivasa Natarajan PS TN Litt. & Edu.
69 Dr. R. Basappagouda Patil PS KAR Social Work
70 Smt. Roshan Phooken PS ASM Social Work
71 Shri Vairamuthu Pillai Subbiah Pillai PS TN Litt. & Edu.
72 Shri Kumar Nandan Prasad PS UP Civil Service
73 Smt. Amrita Pritam PS DEL Litt. & Edu.
74 Col Bishen Lal Raina PS DEL Medicine
75 Shri Ram Lal Rajgarhia PS DEL Trade & Ind.
76 Shri Vulimiri Ramalingaswami PS AP Medicine
77 Prof. T.Vardachari Ramanujam PS MAH Social Work
78 Smt. Rajam Ramaswami PS TN Social Work
79 Shri N. Balakrishna Reddi PS AP Social Work
80 Smt. Indrani Rehman PS DEL Art
81 Smt. Savitri Sahni PS UP Science &
82 Shri Balraj Sahni PS PUN Art
83 Dr. Krishna Gopal Saxena PS DEL Medicine
84 Shri Sadashiva Rath Sharma PS OR Art
85 Shri Dhyan Pal Singh PS UTTR Civil Service
86 Shri Sukhdev PS MAH Art
87 Shri Singannachar Narasimha Swamy PS AP Art
88 Shri Mangru Ganu Uikey PS MP Social Work
89 Dr. Nand Kishore Verma PS HRY Medicine
1970
1 Dr. Tara Chand PV UP Litt. & Edu.
2 Grp.Capt. Suranjan Das PV WB Civil Service
3 Shri Anthony Lancelot Dias PV MAH Public Affairs
4 Gen. P.Prabhakar Kumaramangalam PV TN Civil Service
5 Shri A. Ramaswami Mudaliar PV AP Civil Service
6 Dr. Binay Ranjan Sen PV WB Civil Service
7 Lt. Gen. Harbakhsh Singh PV PUN Civil Service
8 Shri Ramkinkar Baiz PB WB Art
9 Smt. Hirabai Barodekar PB MAH Art
10 Shri Buddhadeva Bose PB WB Litt. & Edu.
11 Shri M.R. Brahmam PB AP Civil Service
12 Dr. Amiya Chakravarty PB WB Litt. & Edu.
13 Shri T.S. Avinashillingam Chettiar PB TN Litt. & Edu.
14 Dr. Birendra Nath Ganguli PB DEL Litt. & Edu.
15 Shri Hans Raj Gupta PB HRY Public Affairs
16 Shri Ratan Lal Joshi PB DEL Litt. & Edu.
17 Shri Gurram Joshuva PB AP Litt. & Edu.
18 Shri Narayan Sadoba Kajrolkar PB MAH Social Work
19 Smt. Kamala PB TN Art
20 Dr. Purushottam Kashinath Kelkar PB MAH Litt. & Edu.
21 Dr. Maharajapuram Sitaram Krishnan PB TN Science &
22 Dr. Syed Abdul Latif PB AP Litt. & Edu.
23 Shri Bhagwant Rao Annabhau Mandloi PB MP Public Affairs
24 Dr. Mahesh Prasad Mehray PB UP Medicine
25 Shri Sombhu Mitra PB WB Art
26 Shri Vivekananda Mukhopadhyaya PB WB Litt. & Edu.
27 Dr. Krishnaswami Ramiah PB TN Science &
28 Shri Gainedi A. Narasimha Rao PB AP Civil Service
29 Shri Anant alias Annasaheb Sahasrabuddhe PB MAH Social Work
30 Kum. Surrendar Saini PB DEL Social Work
31 Dr. Viswanatha Satyanarayana PB AP Litt. & Edu.
32 Shri Ahmad Jan Thirkawa PB UP Art
33 Shri N.M. Wagle PB MAH Civil Service
34 Dr. Prem Nath Wahi PB DEL Civil Service
35 Shri Yashpal PB PUN Litt. & Edu.
36 Dr. Ghulam Ahmed Bandey PS J&K Science &
37 Shri Ananda Chandra Barua PS ASM Litt. & Edu.
38 Dr. Ajit Kumar Basu PS WB Medicine
39 Shri Bishen Singh Bedi PS DEL Sports
40 Dr. Sunil Kumar Bhattacharya PS WB Civil Service
41 Shri Sukumar Bose PS DEL Art
42 Shri Phul Chand PS WB Trade & Ind.
43 Shri Siddheshwar Shastri Chitrao PS MAH Litt. & Edu.
44 Shri Dattatraya Mahadeo Dahanukar PS MAH Trade & Ind.
45 Shri Laxman Swarup Darbari PS DEL Civil Service
46 Shri Din Dayal PS PUN Litt. & Edu.
47 Dr. Chandran David S. Devanasan PS TN Litt. & Edu.
48 Shri Prem Dhawan PS MAH Art
49 Dr. Ramesh Tribhuwandas Doshi PS MAH Science &
50 Shri Sohan Lal Dwivedi PS UP Litt. & Edu.
51 Smt. Ratna Fabri PS RAJ Art
52 Shri Ramaswamy Ganesan PS TN Art
53 Shri Ritwik Ghatak PS WB Art
54 Shri Purushottam Pandurang @ Baburao Gokhale PS MAH Social Work
55 Dr. Colathur Gopalan PS DEL Medicine
56 Shri Ghanshyam Das Goyal PS KAR Social Work
57 Shri Govind Ram Hada PS DEL Trade & Ind.
58 Shri Syed Mohd. Moinul Haq PS BIH Sports
59 Shri Kunnenkeril K. Jacob PS MAH Litt. & Edu.
60 Shri Jiwan Ram Jairamdas PS DEL Social Work
61 Smt. Damayanti Joshi PS MAH Art
62 Smt. Maniben Kara PS MAH Social Work
63 Shri Abdul Halim Jaffer Khan PS MAH Art
64 Smt. Alice Wilma Khan PS SWTZ Social Work
65 Shri Karl Jamshed Khandalavala PS MAH Art
66 Shri M. Krishnan PS TN Art
67 Shri Rajendra Kumar PS MAH Art
68 Shri P. Lal PS WB Litt. & Edu.
69 Miss Lilian G. Lutter PS MP Litt. & Edu.
70 Shri T.R. Mahalingam PS TN Art
71 Shri Gurdas Mal PS DEL Civil Service
72 Shri Kumud Ranjan Mallick PS WB Litt. & Edu.
73 Shri Ram Chatur Mallik PS BIH Art
74 Shri Mallikarjun Mansur PS KAR Art
75 Shri Ezra Mir PS MAH Art
76 Shri Pankaj Kumar Mullick PS WB Art
77 Shri Mohan Naik PS OR Social Work
78 Shri Kalamandalam Krishnan Nair PS KER Art
79 Dr. P. Narasimhayya PS KAR Litt. & Edu.
80 Shri Shantilal B. Pandya PS DEL Science &
81 Dr. Pisharoth Rama Pisharoty PS GUJ Science &
82 Shri E. Anantharao S. Prasanna PS KAR Sports
83 Shri G. Venkateswara Rao PS AP Art
84 Dr. Vadlamudi Venkata Rao PS ASM Litt. & Edu.
85 Shri Vijaya Raghava Rao PS WB Art
86 Dr. Perugu Siva Reddy PS AP Medicine
87 Shri Phaneshwar Nath Renu PS BIH Litt. & Edu.
88 Shri Weer Rajendra Rishi PS PUN Litt. & Edu.
89 Syed Masud Hasan Rizvi PS UP Litt. & Edu.
90 Dr. Cuddalore Subramania Chetty Sadasivan PS AP Medicine
91 Dr. Prem Prakash Sahni PS DEL Medicine
92 Shri Devendra Nath Samant PS BIH Social Work
93 Shri V. Satyanarayana Sarma PS AP Art
94 Pandita Sumatiben Nemchand Shah PS MAH Litt. & Edu.
95 Smt. Indumatiben Chimanlal Sheth PS GUJ Social Work
96 Dr. Rajendra Vir Singh PS UP Medicine
97 Shri Maisnam Amubi Singh PS MAN Art
98 Shri Narain Singh PS RAJ Civil Service
99 Dr. Badri Narain Sinha PS UP Medicine
100 Smt. Kodumudi Balambal Sundarambal PS TN Art
101 Shri Relangi Venkataramaiah PS AP Art
102 Shri Avinash Anandrai Vyas PS MAH Art
103 Shri Deoram Sayajitrao Alias Kakasaheb Wagh PS MAH Social Work
104 Shri Sikander Ali Wjad PS MAH Litt. & Edu.
1971
1 Smt. Indira Gandhi BR UP Public Affairs
2 Shri Bimal Prasad Chaliha PV ASM Civil Service
3 Ustad Allauddin Khan PV WB Art
4 Smt. Sumati Morarjee PV MAH Civil Service
5 Shri Uday Shankar PV MAH Art
6 Dr. Vithalrao Nagesh Shirodkar PV GOA Medicine
7 Shri Balram Sivaraman PV TN Civil Service
8 Shri N. Ramaswami Ayyar PB TN Social Work
9 Shri Suraj Bhan PB CHA Litt. & Edu.
10 Shri Gokulbhai Daulatram Bhatt PB RAJ Social Work
11 Shri J. Bhudhardas Bhojak PB GUJ Art
12 Shri Monindra Nath Chakravarti PB WB Civil Service
13 Shri Kandathil Mammon Cherian PB KER Litt. & Edu.
14 Shri Jogesh Chandra De PB WB Trade & Ind.
15 Shri Ramrao Madhaorao Deshmukh PB MAH Trade & Ind.
16 Dr. Satish Dhawan PB KAR Science &
17 Shri Bhalchandra Digambar Garware PB MAH Trade & Ind.
18 Smt. Gangubai Hanagal PB KAR Art
19 Shri Musiri Subramania Iyer PB TN Art
20 Shri P Tiruvillvamalai Seshan M. Iyer PB TN Art
21 Shri Jainendra Kumar Jain PB DEL Litt. & Edu.
22 Shri Mangtu Ram Jaipuria PB DEL Social Work
23 Dr. Veni Shankar Jha PB MP Litt. & Edu.
24 Shri Raj Kapoor PB PUN Art
25 Shri A. Vithal Alias Dhananjay Keer PB MAH Litt. & Edu.
26 Shri Amir Khan PB MAH Art
27 Shri Nisar Husain Khan PB UP Art
28 Shri P. Kalathil Kunju Kurup PB KER Art
29 Shri Rasipuram Krishnaswami Laxman PB MAH Art
30 Dr. Shantilal Jamnadas Mehta PB MAH Medicine
31 Shri Ved Rattan Mohan PB UP Trade & Ind.
32 Shri Kedar Nath Mookerjee PB WB Trade & Ind.
33 Dr. Santosh Kumar Mukerji PB MP Medicine
34 Dr. Bishnupada Mukhopadhyaya PB BIH Medicine
35 Shri Kalindi Charan Panigrahi PB OR Litt. & Edu.
36 Shri Manibhai J. Patel PB MP Trade & Ind.
37 Smt. Damal Krishnaswami Pattamal PB TN Art
38 Shri Krishnarao Phulambrikar PB MAH Art
39 Shri Namakkal Venkatarama Ramalingam Pillai PB TN Litt. & Edu.
40 Dr. Vulimiri Ramalingaswami PB TN Medicine
41 Shri Suresh Chandra Roy PB WB Trade & Ind.
42 Dr. Pandurang Vasudeva Sakharam PB ITLY Science &
43 Prof. Pichu Sambamoorthi PB TN Art
44 Shri Devchand Chhaganlal Shah PB MAH Social Work
45 Dr. Madan Mohan Singh PB DEL Medicine
46 Shri Jaishankar Sundari PB GUJ Art
47 Shri Bhagwati Charan Verma PB UP Litt. & Edu.
48 Shri Parmeshwari Lal Verma PB CHA Civil Service
49 Shri Kasturi Lal Vij PB DEL Civil Service
50 Shri M. Devidas Alias Baba Amte PS MAH Social Work
51 Dr. Robin Banerjee PS ASM Social Work
52 Rani Lila Ramkumar Bhargava PS UP Social Work
53 Smt. Sheila Bhatia PS DEL Litt. & Edu.
54 Shri Atma Ram Bhatt PS MAH Litt. & Edu.
55 Shri Prabhashankar Ramachandra Bhatt PS MAH Social Work
56 Shri Pramatha Nath Bishi PS WB Litt. & Edu.
57 Shri Sudhansu Kumar Chakravarty PS BIH Civil Service
58 Shri Sankho Chaudhuri PS DEL Art
59 Shri Leslie Claudius PS WB Sports
60 Kum. Subhashni Jhunnu Dasgupta PS DEL Civil Service
61 Shri Manna Dey PS MAH Art
62 Dr. Moti Lal Dhar PS UP Science &
63 Shri Khailshankar Durlabhji PS RAJ Trade & Ind.
64 Lt. Col. Suresh Chandra Dutta PS WB Medicine
65 Shri Zafar Futehally PS MAH Science &
66 Shri Amiya Bhusan Das Gupta PS DEL Civil Service
67 Shri Atul Chandra Hazarika PS ASM Litt. & Edu.
68 Shri Vaidyanatha Vaidyasubramanya Iyer PS TN Social Work
69 Shri Pandurang Dharmaji Jadhav PS MAH Social Work
70 Shri Jagmohan PS PUN Civil Service
71 Shri Udaybhansinhji Natwarsinhji Jethwa PS GUJ Trade & Ind.
72 Smt. Adya Jha PS DEL Social Work
73 Shri Debi Sahai Jindal PS DEL Trade & Ind.
74 Shri Palanindy Kandaswamy PS TN Civil Service
75 Shri Mangalampalli Balamurali Krishna PS TN Art
76 Dr. Sundaram Krishnamurti PS TN Medicine
77 Prof. Devendra Lal PS GUJ Science &
78 Shri Maqbool Ahmed Lari PS UP Litt. & Edu.
79 Miss Grace Mary Linnell PS UK Litt. & Edu.
80 Shri Abdul Haye alias Sahir Ludhianvi PS PUN Litt. & Edu.
81 Shri Labhu Ram Josh Malsiani PS PUN Litt. & Edu.
82 Shri Sailendra Nath Manna PS WB Sports
83 Shri Ramanatha Iyer Mathrubbotham PS TN Public Affairs
84 Shri Ram Lal Mehta PS DEL Public Affairs
85 Prof. Ratan Shankar Mishra PS UP Litt. & Edu.
86 Dr. Sadashiv Misra PS OR Civil Service
87 Shri Chandi Prasad Misra PS DEL Medicine
88 Smt. Tripti Mitra PS WB Art
89 Shri Ghaus Mohamed PS AP Sports
90 Dr. Hari Mohan PS DEL Medicine
91 Shri Syed Mohd. Mirza Mohazzab PS UP Litt. & Edu.
92 Dr. Coorg Narasimhaiengar Krishna Murthy PS UP Trade & Ind.
93 Shri K. Venkataswami Naidu PS TN Social Work
94 Shri V. Kunchu Nair PS KER Art
95 Shri Sachchidanand Keshav Nargundkar PS BIH Civil Service
96 Dr. Yelavarthy Nayudamma PS TN Trade & Ind.
97 Smt. Sulabha Panandikar PS MAH Litt. & Edu.
98 Shri Subrahmanya Paramanandan PS DEL Civil Service
99 Shri Krishna Swarup Pathak PS PUN Civil Service
100 Shri Sukharam Abaji Patil PS MAH Social Work
101 Shri Chengannur Raman Pillai PS KER Art
102 Shri K. Natesa Dhandayuthapani Pillai PS TN Art
103 Shri Chandgi Ram PS DEL Sports
104 Shri Tiruvadi Venkataraman Ramamurti PS DEL Science &
105 Dr. Basapatna Narayana Blkrishna Rao PS KAR Medicine
106 Smt. Shantha Rao PS KAR Art
107 Shri Devan Venkata Reddi PS AP Trade & Ind.
108 Shri Prem Nath Sahni PS PUN Trade & Ind.
109 Kum. Kamaljit Sandhu PS USA Sports
110 Dr. Krishnaswami Srinivasa Sanjivi PS TN Medicine
111 Smt. Savitabehen PS DEL Social Work
112 Shri Trivandrum Kandaswami Pillai Shanmugam PS TN Art
113 Shri Ravi Shankar Sharma PS MAH Art
114 Shri Chinganbam Kalachand Shastri PS MAN Litt. & Edu.
115 Dr. Sishta Venkata Seetharama Shastry PS AP Science &
116 Shri Hari Dev Shourie PS DEL Trade & Ind.
117 Dr. Yudhvir Singh PS RAJ Social Work
118 Bhai Mohan Singh PS DEL Public Affairs
119 Shri Surya Deo Singh PS RAJ Social Work
120 Shri Suresh Singh PS UP Litt. & Edu.
121 Dr. Harbhajan Singh PS DEL Science &
122 Shri Nirmal Chandra Sinha PS DEL Litt. & Edu.
123 Shri Kothamanglam Subbu PS TN Litt. & Edu.
124 Shri S.G. Mahalingayyar Subramaniam PS TN Litt. & Edu.
125 Shri Anand Raj Surana PS DEL Social Work
126 Shri Ghulam Rabbani Taban PS DEL Litt. & Edu.
127 Shri Narayan Gopal Thakar PS MAH Litt. & Edu.
128 Rev. Mother Theodosia PS KAR Litt. & Edu.
129 Pt. Siyaram Tiwari PS BIH Art
130 Shri Gundappa Ranganath Viswanath PS KAR Sports
131 Smt. Avabai Bomanji Wadia PS MAH Social Work
132 Shri Harnam Dass Wahi PS DEL Trade & Ind.
133 Shri Qadri Ragi Aziz Ahmed Khan Warsi PS AP Art
1972
1 Dr. P. Balacharya Gajendragadkar PV MAH Public Affairs
2 Dr. Aditya Nath Jha PV UP Public Affairs
3 Air Chief Pratap Chandra Lal PV PUN Civil Service
4 Gen. S.H.F. Jamshedji Manekshaw PV TN Civil Service
5 Dr. Jivraj N. Mehta PV MAH Public Affairs
6 Admiral Sardarilal Mathradas Nanda PV DEL Civil Service
7 Shri Ghulam Mohd. Sadiq PV J&K Public Affairs
8 Dr. Vikram Ambalal Sarabhai PV GUJ Science &
9 Shri Hormusji Maneckji Seervai PV MAH Litt. & Edu.
10 Lt. Gen Jagjit Singh Aurora PB DEL Civil Service
11 Shri Madhavrao Bagal PB MAH Social Work
12 Shri Surinder Singh Bedi PB DEL Civil Service
13 Lt.Gen. Gopal G. Bewoor PB KAR Civil Service
14 Smt. Gulestan Rustom Billimoria PB MAH Social Work
15 Lt. Gen P. Kunhiraman Candeth PB DEL Civil Service
16 Prof. Ram Narayan Chakravarti PB WB Science &
17 Dr. Pran Nath Chhutani PB CHA Litt. & Edu.
18 Smt. Yashodhara Dasappa PB KAR Social Work
19 Shri Maheshwar Dayal PB DEL Social Work
20 Air Mar. H.C. Dewan PB PUN Civil Service
21 Air Mar. M.M. Engineer PB GUJ Civil Service
22 Shri Benoy Bhushan Ghosh PB WB Civil Service
23 Major Inderjit Singh Gill PB MAH Civil Service
24 Shri Mohd. Hayath PB KAR Civil Service
25 Dr. Lakhumal Hiranand Hiranandani PB MAH Medicine
26 Prof. L.A.Krishna Iyer PB KER Science &
27 Vice Adm. Sourendra Nath Kohli PB PUN Civil Service
28 Dr. Jai Krishna PB UP Civil Service
29 Vice Adm. Nilkanta Krishnan PB TN Civil Service
30 Shri Ashwini Kumar PB PUN Civil Service
31 Shri Pran Nath Luthra PB PUN Civil Service
32 Shri Amrut V. Mody PB MAH Civil Service
33 Shri N.G. Krishna Murti PB DEL Civil Service
34 Shri T.A. Pai PB KAR Civil Service
35 Pandit Vinayakrao Patwardhan PB MAH Art
36 Prof. Dattatraya Yeshwant Phadke PB MAH Science &
37 Shri Kayalath Pothen Philip PB MAH Litt. & Edu.
38 Dr. Bhalchandra Nilkanth Purandare PB MAH Medicine
39 Lt.Gen. T.N. Raina PB J&K Civil Service
40 Dr. Bharat Ram PB DEL Trade & Ind.
41 Dr. Mohinder Singh Randhawa PB PUN Science &
42 Shri Adya Rangacharya PB KAR Litt. & Edu.
43 Shri Mandagere Bharadwaj Ramachandra Rao PB DEL Science &
44 Shri Ayyagiri Sambasiva Rao PB AP Science &
45 Dr. Sujoy Bhushan Roy PB WB Medicine
46 Shri Khusro Framurz Rustamji PB MP Civil Service
47 Shri S. S. Sahi PB CHA Civil Service
48 Dr. Shantilal C. Sheth PB MAH Medicine
49 Dr. Baldev Singh PB DEL Medicine
50 Lt. Gen. Khem Karan Singh PB PUN Civil Service
51 Lt. Gen. Sartaj Singh PB PUN Civil Service
52 Lt. Gen. Sagat Singh PB PUN Civil Service
53 Shri B.N. Sircar PB BIH Art
54 Shri Papanasam Sivan PB TN Art
55 Shri Chandrika Prasad Srivastava PB UK Civil Service
56 Dr. M.S. Swaminathan PB TN Science &
57 Prof. Krishnaswami Swaminathan PB DEL Litt. & Edu.
58 Dr. Bal Dattatriya Tilak PB MAH Science &
59 Dr. Syed Husain Zaheer PB AP Trade & Ind.
60 Shri Ved Prakash Agnihotri PS PUN Science &
61 Shri Ramamurthi Badrinath PS DEL Civil Service
62 Shri Om Prakash Bahl PS PUN Civil Service
63 Major Harsh Vardhan Bahuguna PS UP Sports
64 Shri Badri Prasad Bajoria PS UP Social Work
65 Shri Debdulal Bandopadhyay PS WB Civil Service
66 Shri Surendra Nath Banerjee PS WB Art
67 Shri Pradip Kumar Banerjee PS WB Civil Service
68 Shri Puran Lal Batra PS HRY Science &
69 Shri Rajindra Singh Bedi PS MAH Litt. & Edu.
70 Shri Dharam Vir Bharati PS MAH Litt. & Edu.
71 Shri Swarn Singh Boparai PS PUN Civil Service
72 Dr. (Mrs.) Dorothy Dunning Chacko PS DEL Medicine
73 Brig. Harish Chandra PS DEL Civil Service
74 Shri B. Subramanya Chandrasekhar PS KAR Sports
75 Dr. Thayil John Cherian PS TN Medicine
76 Shri Chiranjit PS DEL Art
77 Shri Mohan Mull Chordia PS TN Trade & Ind.
78 Dr. (Smt.) Vatsala Samant Choudhry PS UP Medicine
79 Shri Himangshu Mohan Choudhury PS UP Civil Service
80 Shri Phool Chand Chowdhary PS DEL Litt. & Edu.
81 Shri Charles M. Correa PS MAH Science &
82 Shri Prabhu Dayal Dabriwala PS WB Social Work
83 Shri Brijbir Saran Das PS DEL Civil Service
84 Smt. Girija Devi PS UP Art
85 Shri Vasudeo Santu Gaitonde PS MAH Art
86 Shri Shalil Ghosh PS MAH Litt. & Edu.
87 Shri Surjit Singh Gujral PS DEL Civil Service
88 Shri Sheikh Gulab PS MP Civil Service
89 Smt. Surrinder Bansidhar Gupta PS DEL Social Work
90 Shri Ishwar Chander Gupta PS CHA Civil Service
91 Shri Hari Prasad Jaiswal PS KAR Civil Service
92 Shri Sunil Janah PS DEL Art
93 Shri Lalgudi Gopalaiyer Jayaraman PS TN Art
94 Shri Bhimsen Gururaj Joshi PS MAH Art
95 Shri Mahendra Kapoor PS MAH Art
96 Dr. Amiya Bhushon Kar PS WB Medicine
97 Shri Jagan Nath Krishan Kate PS MP Litt. & Edu.
98 Dr. (Mrs.) Sant Kaur PS CHA Medicine
99 Dr. Prithvi Nath Khoshoo PS UP Medicine
100 Dr. Syam Nandan Prasad Kishore PS BIH Litt. & Edu.
101 Smt. Kanta Saroop Krishen PS CHA Social Work
102 Shri Vedakantara Subramania Krishnan PS MP Litt. & Edu.
103 Shri Ram Kumar PS DEL Art
104 Shri Jagdish Lal PS PUN Civil Service
105 Shri Vidya Nath Langer PS DEL Litt. & Edu.
106 Smt. Mali PS J&K Social Work
107 Prof. Pran Nath Mehra PS CHA Science &
108 Dr. G. Subbukrishna Melkote PS OR Public Affairs
109 Shri Hrishikesh Mukherji PS MAH Art
110 Shri Karachur Lingappa Nanjappa PS DEL Civil Service
111 Shri Puttaparthi Narayanacharya PS AP Litt. & Edu.
112 Shri Kamal Kanti Naskar PS WB Civil Service
113 Dr. Dattatraya Nagappa Pai PS MAH Medicine
114 Shri Bhuwan Chand Pande PS UP Civil Service
115 Smt. Savitri Indrajit Parekh PS GUJ Art
116 Dr.(Miss) Leela Vinayak Phatak PS DEL Civil Service
117 Shri Vazhuvoor B. Ramiah Pillai PS TN Art
118 Shri Samta Prasad PS UP Art
119 Shri Madras Kandaswamy Radha PS TN Art
120 Kum. Waheeda Rahman PS MAH Art
121 Shri Raghu Rai PS DEL Art
122 Shri P Ramanathan Rajgopal PS TN Civil Service
123 Prof. Balasubramaniam Ramamurthi PS TN Medicine
124 Shri Iyyanki Venkata Ramanayya PS AP Social Work
125 Shri Krishna Reddy PS FRA Art
126 Smt. Juthika Roy PS WB Art
127 Smt. Chandra Prava Saikiani PS ASM Social Work
128 Shri Chandra Shekhar Samal PS WB Civil Service
129 Dr. Balu Sankaran PS SWTZ Medicine
130 Smt. Suchitra Sen PS WB Art
131 Shri K.C. Sengupta PS WB Civil Service
132 Shri Homi Cawas Sethna PS MAH Civil Service
133 Shri T.Amudon Sharma PS MAN Art
134 Shri Rajinder Singh PS PUN Civil Service
135 Shri Sukhbir Singh PS CHA Civil Service
136 Dr. K. Kirpal Singh PS PUN Science &
137 Shri Vijay Singh PS RAJ Civil Service
138 Shri Sudhindra Sircar @ Badal Sircar PS WB Litt. & Edu.
139 Shri Palhalli Sitaramiah PS KAR Social Work
140 Shri Mylai Ponnuswamy Sivagnanam PS TN Litt. & Edu.
141 Shri Bhawani Prasad Tiwari PS MP Litt. & Edu.
142 Dr. Katil Narasimha Udupa PS UP Medicine
143 Dr. (Miss) Mary Puthusseril Varghese PS TN Medicine
144 Dr. Ravivarma Marthanda Varma PS KAR Medicine
145 Dr. Gubbi Hampanna Veeranna PS KAR Art
146 Dr. Virendra Verma PS UP Litt. & Edu.
147 Shri Ajit Laxman Wadekar PS MAH Sports
148 Shri Moreshwar Mangesh Wagle PS MAH Civil Service
1973
1 Smt. Basanti Devi PV WB Civil Service
2 Shri U.N. Dhebar PV GUJ Social Work
3 Smt. Nellie Sen Gupta PV WB Social Work
4 Dr. Daulat Sinyh Kothari PV DEL Science &
5 Dr. Nagendra Singh PV RAJ Public Affairs
6 Shri Thirumalraya Swaminathan PV TN Civil Service
7 Dr. Om P. Bahl PB USA Science &
8 Shri C. Vaidyanatha Bhagavathar PB KER Art
9 Smt. Gosasp Maneckji Sorabji Captain PB MAH Social Work
10 Shri Harindranath Chattopadhyaya PB AP Litt. & Edu.
11 Shri Banarsi Dass Chaturvedi PB UP Litt. & Edu.
12 Dr. Raja M. Annamalai Muthiah Chettiar PB TN Trade & Ind.
13 Shri Maqbool Fida Husain PB DEL Art
14 Shri Pothen Joseph PB KER Litt. & Edu.
15 Shri Naraindas Rattanmal Malkani PB RAJ Social Work
16 Shri Vinoo Mankad PB GUJ Sports
17 Shri Sudhir Krishna Mukherjee PB WB Civil Service
18 Shri Ramakant Maheshwar Muzumdar PB KAR Civil Service
19 Shri Krishna Rao Shankar Pandit PB MP Art
20 Shri Pitambar Pant PB UP Civil Service
21 Shri Vennelakanti Raghavaiah PB AP Social Work
22 Dr. Raja Ramanna PB TN Science &
23 Shri Kunjuraman Sukumaran PB KER Litt. & Edu.
24 Lt. Col. Koka Simhadri Babu PS DEL Civil Service
25 Shri Jayant Kumar Bagchi PS WB Civil Service
26 Shri Panimangalore Appraya Bhat PS MAH Civil Service
27 Dr. Bhoi Bheemanna PS AP Litt. & Edu.
28 Dr. Nandlal Bordia PS MP Medicine
29 Shri Prabhakar Bhikaji Chitnis PS MAH Civil Service
30 Shri Ranjit Ramchandrarao Desai PS MAH Litt. & Edu.
31 Smt. Sitara Devi PS MAH Art
32 Dr. Kandarp Tulja Dholakia PS MAH Medicine
33 Shri Farookh M. Engineer PS MAH Sports
34 Shri Raghunath Singh Gahlowt PS DEL Civil Service
35 Shri Balwant Gargi PS CHA Litt. & Edu.
36 Shri Harishchandra Kasinath Garve PS KAR Civil Service
37 Shri Fateh Chand Gera PS DEL Civil Service
38 Dr. Narendra Singh Jain PS DEL Medicine
39 Smt. Yamunabai Vinayakrao Khadilkar PS MAH Civil Service
40 Shri Shakoor Khan PS DEL Art
41 Dr. Maddali Gopala Krishna PS UTTR Civil Service
42 Shri Venkataraman Krishnamurthy PS TN Civil Service
43 Shri Tripunittura Narayanan Krishnan PS TN Art
44 Shri Salam Machhlisheri PS DEL Litt. & Edu.
45 Shri Kishan Maharaj PS UP Art
46 Dr. Mohamed Abdul Malik Khader Mohamed PS KER Litt. & Edu.
47 Dr. Ramchandra Menda PS MAH Medicine
48 Dr. Madampath Kalathil Krishna Menon PS TN Medicine
49 Smt. Sulochana Modi PS MAH Social Work
50 Shri Debi Prasad Mukherji PS WB Civil Service
51 Shri Chellasami Sirchabai Murugabhupathy PS TN Art
52 Shri Thikkurussi Sukumaran Nair PS KER Art
53 Shri P.N. N. Bhaskaran Nair PS DEL Civil Service
54 Dr. Bhola Nath PS UP Medicine
55 Dr. Ramesh Nigam PS DEL Medicine
56 Dr. Jagdish Mitra Pahwa PS UP Medicine
57 Shri Shankar Ramchandra Panhale PS MAH Social Work
58 Dr. N. Kesava Panikkar PS TN Science &
59 Shri Shyam Lal Gupta Parshad PS UP Litt. & Edu.
60 Kum. Rohini Poovaiah PS KAR Social Work
61 Dr. Atm Prakash PS DEL Medicine
62 Shri Krishnan Raghavachari PS MAH Science &
63 Shri Balasubramanyan Ramadorai PS DEL Civil Service
64 Late Shri R.V. Ramaswamy PS TN Civil Service
65 Wing Cdr Keshavamurthy Ramchndra Rao PS GUJ Civil Service
66 Shri B.S. alias Balu Bhagvathar Sastrigal PS TN Art
67 Shri Dalip Kumar Sengupta PS WB Civil Service
68 Brig. Bhagwan Javharmal Shahaney PS MAH Civil Service
69 Kum. Uma Sharma PS DEL Art
70 Dr. Triloki Nath Sharma PS UP Civil Service
71 Shri S.G. Thakar Singh PS PUN Art
72 Shri Shumsher Singh PS MAH Civil Service
73 Shri Ijwant Singh PS DEL Public Affairs
74 Shri Kamal Krishna Sinha PS BIH Civil Service
75 Shri Prabhashankar Ogadhbhai Sompura PS GUJ Science &
76 Shri Chinnaswamy Rajan Subramanian PS KAR Civil Service
77 Prof. Govind Swarup PS KAR Science &
78 Dr. Prakash Narain Tandon PS DEL Medicine
79 Dr. Shridhar Upadhyay PS UTTR Civil Service
80 Smt. Coover Bai Jehangir Vakil PS MAH Litt. & Edu.
81 Smt. Sarojini Varadappan PS TN Social Work
82 Dr. Jamsaheb Nowroji Vazifdar PS MAH Medicine
83 Shri Vithal Ramkrishna Vengurlekar PS MAH Civil Service
84 Dr. Govindappa Venkataswamy PS TN Medicine
85 Shri Ramchandra Vishwanath Wardekar PS MAH Medicine
1974
1 Shri Niren De PV WB Public Affairs
2 Shri Binode Behari Mukherjee PV UTTR Art
3 Dr. V. Kasturi Ranga Varadaraja Rao PV KAR Civil Service
4 Shri Harish Chandra Sarin PV DEL Civil Service
5 Dr. Alice Bonner PB ITLY Art
6 Dr. Camille Bulcke PB BLGM Litt. & Edu.
7 Dr. Ram Kumar Caroli PB UP Medicine
8 Dr. Moti Chandra PB MAH Science &
9 Shri Dhiren Ganguli PB WB Art
10 Dr. D.Venkataramaiah Gundappa PB KAR Litt. & Edu.
11 Dr. Vasant Shankar Huzurbazar PB MAH Litt. & Edu.
12 Shri Chintamani Kar PB WB Art
13 Smt. Mogubai Kurdikar PB MAH Art
14 Shri Jayant Pandurang Naik PB MAH Litt. & Edu.
15 Shri Habibur Rahman PB DEL Science &
16 Shri B.Narsimha Reddy PB AP Art
17 Bishop John Richardson PB A&N Social Work
18 Prof. Toppur Seethapathy Sadasivan PB TN Science &
19 Shri Sukhlalji Sanghavi PB GUJ Litt. & Edu.
20 Dr. Hasmukh Dhirajlal Sankalia PB MAH Civil Service
21 Prof. Bhupati Mohan Sen PB WB Litt. & Edu.
22 Shri Thakur Jaideva Singh PB UP Science &
23 Shri Khushwant Singh PB PUN Litt. & Edu.
24 Dr. Arunachala Sreenivasan PB KAR Science &
25 Dr. Raman Viswanathan PB TN Medicine
26 Shri Kaifi Azmi PS UP Litt. & Edu.
27 Smt. Nutan Bahl PS MAH Art
28 Shri Subramanya Iyer Balakrishnan PS DEL Civil Service
29 Shri Himansu Kumar Banerjee PS WB Civil Service
30 Smt. Masuma Begum PS AP Social Work
31 Smt. Muryam Begum PS J&K Civil Service
32 Shri Pushkar Nath Bhan PS J&K Civil Service
33 Smt. Queenie H.E. Captain PS MAH Social Work
34 Shri Mani Madhava Chakyar PS KER Art
35 Dr. Mani Kumar Chhetri PS WB Medicine
36 Shri Baldev Raj Chopra PS AFGH Civil Service
37 Dr. Waman Patwardhan Dattatraya PS MAH Trade & Ind.
38 Smt. Nina Ripjit Singh @ Naina Devi PS DEL Art
39 Smt. Vindhyavasini Devi PS BIH Civil Service
40 Shri Gopal Chandra Dutt PS DEL Civil Service
41 Dr. Nagarur Gopinath PS DEL Medicine
42 Dr. Jogindra Lal Gupta PS DEL Medicine
43 Shri Indra Kumar Gupta PS DEL Civil Service
44 Shri Ali Hasan @ Kalloo Hafiz PS UP Civil Service
45 Shri Ram Prasad Jaiswal PS BIH Science &
46 Shri Hanamant Narher Joshi PS MAH Social Work
47 Shri Kooram Kannan PS AP Civil Service
48 Shri Achyut Purshottam Kanvinde PS DEL Science &
49 Shri Girish Raghunath Karnad PS KAR Art
50 Dr. Jagmohan Lal Karoli PS UP Social Work
51 Shri Raj Kumar Khanna PS DEL Civil Service
52 Father Thomas V. Kunnunkal PS KER Litt. & Edu.
53 Dr. Sriram Balkrishna Lagu PS MAH Art
54 Shri Ghulam Qadir Lalla PS J&K Trade & Ind.
55 Smt. Suchitra Mitra PS WB Science &
56 Prof. Dinesh Mohan PS UTTR Civil Service
57 Shri Kelu Charan Mohapatra PS OR Art
58 Dr. Hari Narain PS AP Civil Service
59 Dr. Venkatarama Narayanaswami PS TN Medicine
60 Dr. Maheswar Neog PS KER Litt. & Edu.
61 Shri Devki Nandan Pande PS UTTR Social Work
62 Shri Thiruvizhimazhalai Subramania Pillai PS TN Art
63 Dr. Lala Suraj Nandan Prasad PS BIH Medicine
64 Dr. Syed Zahoor Qasim PS DEL Civil Service
65 Shri Satyanarayan Rajguru PS OR Litt. & Edu.
66 Dr. Kadiyala Ramachandra PS TN Medicine
67 Shri M. Devesa Bhagavathar Ramanathan PS KER Art
68 Dr. C. Nagesh Ramachandra Rao PS UP Science &
69 Shri Kalluri Gopal Rao PS KAR Civil Service
70 Dr. Mysore Shrikanta Pandit Nilakanta Rao PS MAH Medicine
71 Shri Som Nath Sadhu PS J&K Civil Service
72 Shri Emani Sankara Sastri PS DEL Art
73 Shri Qazi Abdus Sattar PS UP Litt. & Edu.
74 Kum. Sitamon Sawian PS MEG Social Work
75 Shri Kirpal Singh Shekhawat PS RAJ Art
76 Shri Anant Gopal Sheorey PS MAH Litt. & Edu.
77 Shri Ishrat Ali Siddiqui PS UP Litt. & Edu.
78 Lt. Comdr. Joginder Singh PS DEL Sports
79 Dr. Shiv Mangal Singh Summan PS MP Litt. & Edu.
80 Dr. Sitaram Rao Valluri PS KAR Science &
81 Smt. Manik Amar Varma PS MAH Art
82 Smt. Jothi Vencatachellum PS TN Public Affairs
1975
1 Shri V.V. Giri BR OR Public Affairs
2 Dr. Basanti Dulal Nag Chaudhuri PV WB Litt. & Edu.
3 Dr.(Smt.) Durgabai Deshmukh PV MAH Social Work
4 Dr. Chintaman Dwarkanath Deshmukh PV AP Public Affairs
5 Smt. Mary Clubwala Jadhav PV TN Social Work
6 Dr. Raja Ramanna PV KAR Science &
7 Shri Homi Nusserwanji Sethna PV MAH Civil Service
8 Smt. M.S. Subbulakshmi PV TN Art
9 Dr. (Smt.) Premlila Vithaldas Thackersey PV MAH Litt. & Edu.
10 Ms. Begum Akhtar PB UP Art
11 Dr. Dilbagh Singh Athwal PB USA Science &
12 Dr.(Smt.) Asima Chatterjee PB WB Science &
13 Dr. Madhav Sadashiv Gore PB MAH Science &
14 Dr. Pratul Chandra Gupta PB WB Litt. & Edu.
15 Dr. P. Krishnagopala. Iyengar PB MAH Science &
16 Dr. Darab Jehangir Jussawala PB MAH Medicine
17 Shri Raj Kumar Khanna PB DEL Civil Service
18 Dr. Pancheti Koteswaram PB TN Civil Service
19 Dr. Vasudev Vishnu Mirashi PB MAH Litt. & Edu.
20 Shri Balai Chand Mukhopadhyaya PB BIH Litt. & Edu.
21 Prof. Kirpal Singh Narang PB PUN Litt. & Edu.
22 Shri P. Ardeshir Narielwala PB MAH Trade & Ind.
23 Shri R. Carltonvivian Piadade Noronha PB MP Civil Service
24 Smt. Ratan Shastri PB RAJ Social Work
25 Shri Suraj Mal Agrawal PS DEL Civil Service
26 Smt. Arjumand Wahabuddin Ahmed PS AP Social Work
27 Shri Bishan Saroop Bansal PS UTTR Civil Service
28 Smt. Malati Barua PS ASM Social Work
29 Shri Ajit Chandra Chatterjee PS WB Civil Service
30 Dr. Rajagopala Chidambaram PS TN Science &
31 Shri Krishna Prasad Dar PS UP Civil Service
32 Dr. Pranab Rebatiranjan Dastidar PS MAH Science &
33 Dr. Reuben David PS GUJ Medicine
34 Smt. Jagdamba Devi PS BIH Art
35 Shri Jatindra Mohan Dutta PS WB Litt. & Edu.
36 Smt. Lhingianeng Gangte PS MAN Social Work
37 Dr. Anil Kumar Ganguly PS WB Science &
38 Shri Madras Sundaram Iyer Gopalakrishnan PS TN Art
39 Shri Syed Husain Ali Jafri PS DEL Social Work
40 Pt. Jasraj PS MAH Art
41 Shri K.J. Jesudas PS KER Art
42 Dr. Stanley John PS KAR Medicine
43 Kum. Ivy Khan PS DEL Social Work
44 Shri Amjad Ali Khan PS DEL Art
45 Shri Gopi Krishna PS MAH Art
46 Shri Mathew M. Kuzhiveli PS KER Litt. & Edu.
47 Dr. (Smt.) Mary Poonen Lukose PS KER Medicine
48 Brig. Pessie Madan PS BUR Civil Service
49 Shri Gundu Bandopant Meemamsi PS UP Civil Service
50 Dr. Ali Mohammad (Jan) PS J&K Medicine
51 Dr. Dhanpat Rai Nagpaul PS UP Medicine
52 Smt. Sanjukta Panigrahi PS OR Art
53 Shri Basavaraj Rajguru PS KAR Art
54 Shri Kalyanam Raghu Ramaiah PS AP Art
55 Shri Bachubhai Rawat PS GUJ Litt. & Edu.
56 Shri Pankaj Lal Roy PS WB Sports
57 Shri Pradip Ranjan Roy PS WB Science &
58 Shri M.S. Sathyu PS MAH Art
59 Dr. Sekharipuram Narayana Aiyer Seshadri PS TN Science &
60 Dr. Mahadeo Lalji Shahare PS DEL Litt. & Edu.
61 Shri Arjan Singh PS UP Civil Service
62 Dr. Shambhu Dayal Singhal PS UTTR Science &
63 Shri Sudhakar Dwarkanath Soman PS MAH Science &
64 Prof. Kalpatthi Ganapathi Subramanyan PS WB Art
65 Shri Gitchandra Tongbra PS MAN Art
66 Shri N.S. Venkatesan PS CHA Civil Service
67 Shri Vishnu Shridhar Wakankar PS MP Civil Service
1976
1 Shri Kumaraswamy Kamraj BR TN Public Affairs
2 Shri Salim Moizuddin Abdul Ali PV UP Science &
3 Giani Gurmukh Singh Musafir PV PUN Litt. & Edu.
4 Shri Keshav Shankar Pillai PV DEL Art
5 Dr. Kalpathi Ramakrishna Ramanathan PV KER Science &
6 Shri Satyajit Ray PV WB Art
7 Dr. Kalu Lal Shrimali PV UP Litt. & Edu.
8 Col. Bashir Husain Zaidi PV DEL Litt. & Edu.
9 Dr. Malcolm Sathianathan Adiseshiah PB TN Civil Service
10 Dr. Harbans Rai Bachchan PB MAH Litt. & Edu.
11 Prof. Navakanta Barua PB ASM Litt. & Edu.
12 Shri Naoroji Pirojsha Godrej PB MAH Trade & Ind.
13 Shri Laxman Shastri Joshi PB MAH Litt. & Edu.
14 Begum Zehra Ali Yavar Jung PB AP Social Work
15 Shri Mallikarjun B. Mansoor PB KAR Art
16 Shri Shri Ram Mehta PB DEL Civil Service
17 Prof. Yash Pal PB PUN Science &
18 Shri Bhogi Lal Pandya PB RAJ Social Work
19 Prof. Udipi Ramachandra Rao PB KAR Science &
20 Dr. Krishnaswami Srinivasa Sanjivi PB TN Medicine
21 Shri Devulapalli Venkata K. Sastry PB AP Litt. & Edu.
22 Shri Devendra Sen PB WB Civil Service
23 Dr. Calambur Sivaramamurti PB DEL Civil Service
24 Dr. Ennacal Chandy George Sudarshan PB USA Litt. & Edu.
25 Hakim Saif-ud-din Ahmad PS UP Medicine
26 Shri Roshan Lal Anand PS PUN Sports
27 Rev. L. Kijungluba Ao PS NAG Social Work
28 Shri Nand Kumar Avasthi PS UP Social Work
29 Dr. Brojendra Kisore Banerjea PS WB Science &
30 Prof. Syed Bashiruddin PS UP Litt. & Edu.
31 Shri Shyam Benegal PS MAH Art
32 Shri Kailash Chand PS PUN Civil Service
33 Shri Satya Prosad Chatterjea PS DEL Civil Service
34 Smt. Ismat Chugtai PS MAH Litt. & Edu.
35 Shri Hari Kant Dang PS DEL Sports
36 Shri Sri Kishan Dass PS HRY Social Work
37 Smt. Ashapurna Debi PS WB Litt. & Edu.
38 Prof. Balkrishna Raghunath Deodhar PS MAH Science &
39 Dr. (Kum.) Durga Deulkar PS MAH Medicine
40 Shri Satya Dev PS HIM Civil Service
41 Smt. Kalabati Devi PS BIH Social Work
42 Smt. Maharaj K. Binodini Devi PS MAN Litt. & Edu.
43 Dr. Ravindra Santuram Dharkar PS MP Medicine
44 Shri Balkrishna Vithaldas Doshi PS GUJ Science &
45 Dr.(Kum.) Amy Dhunjibhoy Engineer PS UP Medicine
46 Shri Nimai Charan Harichandan PS OR Art
47 Dr. Atmaram Bhairav Joshi PS DEL Science &
48 Ustad Fayyaz Ahmed Khan PS MAH Art
49 Shri Raghunath Mahapatro PS OR Art
50 Shri Govinda Pillai Unnikrishna Menon PS TN Civil Service
51 Begum Mumtaz Jehan Mirza PS DEL Litt. & Edu.
52 Shri Om Parkash Mittal PS DEL Civil Service
53 Shri Ram Narain Nagu PS MP Civil Service
54 Dr. Bhikhubhai Khushalbhai Naik PS AP Medicine
55 Pandit Ram Narayan PS MAH Art
56 Dr. Manickam Narayanan PS TN Litt. & Edu.
57 Shri Palghat Kollengode Viswanath Narayanaswamy PS TN Art
58 Shri Tekur Kasi Nath PS DEL Art
59 Dr. Raghubhai Morarji Nayak PS UK Litt. & Edu.
60 Dr. Krishna Pai Narayana Pai PS KER Medicine
61 Shri Bishambhar Nath Pande PS UP Social Work
62 Shri Mukut Dhar Pandeya PS CHHT Litt. & Edu.
63 Dr. Krishna Chandra Panigrahi PS OR Litt. & Edu.
64 Kum. Thangam E. Philip PS MAH Civil Service
65 Swami Pranavananda PS UP Social Work
66 Prof. Attipat Krishnaswamy Ramanujan PS USA Litt. & Edu.
67 Shri Rattehalli Nagendra Rao PS KAR Art
68 Shri Mulk Raj Saraf PS J&K Litt. & Edu.
69 Smt. Gertrude Emerson Sen PS USA Litt. & Edu.
70 Shri Rakhaldas Sengupta PS DEL Civil Service
71 Dr. Muni Inder Dev Sharma PS DEL Medicine
72 Prof. Keshavuram Kashiram Shastree PS GUJ Litt. & Edu.
73 Dr. Gurbachan Singh Sidhu PS UP Science &
74 Brig. Ajit Singh PS DEL Civil Service
75 Shri Madurai S. Somasundaram PS TN Art
76 Smt. Subashni PS HRY Social Work
77 Smt. Parween Sultana PS MAH Art
78 Shri Mohd. Shafi Khan Bekal Utsahi PS UP Litt. & Edu.
79 Smt. Jai Hormusjee Vakeel PS MAH Social Work
1977
1 Shri Ali Yavar Jung Bahadur PV AP Public Affairs
2 Smt. T. Balasaraswati PV TN Art
3 Dr. Ajudhia Nath Khosla PV DEL Civil Service
4 Air Chief O.P. Mehra PV PUN Civil Service
5 Shri Ajoy Kumar Mukherjee PV WB Public Affairs
6 Shri Chandreshwar Prasad Narayan Singh PV DEL Litt. & Edu.
7 Shri Gopinath Aman PB DEL Litt. & Edu.
8 Baba Prithvi Singh Azad PB CHA Public Affairs
9 Dr. Harish Chandra PB USA Litt. & Edu.
10 Shri Shivputra Sidhram Komkali Alias Kumar Gandharv PB MP Art
11 Dr. (Smt.) Phulrenu Guha PB WB Social Work
12 Shri Jagmohan PB DEL Civil Service
13 Prof. Kailas Nath Kaul PB UP Litt. & Edu.
14 Dr. Yusuf Husain Khan PB DEL Litt. & Edu.
15 Shri Chackachanveedu Krishnan Nair PB DEL Social Work
16 Shri Koduvayur Sivarama Narayanaswami PB MAH Art
17 Shri Paramsukh J. Pandya PB MAH Art
18 Prof. Balasubramanian Ramamurthi PB TN Medicine
19 Dr. Perugu Siva Reddy PB AP Medicine
20 Smt. Annapurna Ravi Shankar PB UP Art
21 Dr. Yudhvir Singh PB DEL Social Work
22 Dr. Mysore Narasimhachar Srinivas PB KAR Science &
23 Dr. Thenpattinam Ponnusamy Meenakshi Sundaran PB TN Litt. & Edu.
24 Dr. (Miss) E. Kakkat Janaki Ammal PS KER Science &
25 Dr. Ram Narain Bagley PS UP Medicine
26 Dr. Ramamoorthy Belagaje PS UK Science &
27 Shri Dhan Raj Bhagat PS DEL Art
28 Shri Shri Ram Bharatya PS UP Social Work
29 Shri Ismail Ahmed Cachalia PS GUJ Social Work
30 Shri Jugal Kishore Chowdhury PS DEL Science &
31 Smt. Maitraye Devi PS WB Litt. & Edu.
32 Dr. Bhupendra Kumar Hazarika PS ASM Art
33 Prof. Prafulla Kumar Jena PS OR Science &
34 Dr. Vishwa Gopal Jhingran PS UTTR Science &
35 Shri Sita Ram Lalas PS RAJ Litt. & Edu.
36 Dr. Telo De Mascarenhas PS GER Public Affairs
37 Smt. Indira Miri PS ASM Litt. & Edu.
38 Sheik Chinna Moulana PS TN Art
39 Shri Pritish Nandy PS WB Litt. & Edu.
40 Dr. Rangaswamy Narasimhan PS MAH Civil Service
41 Shri Mohd. Fayazuddin Nizami PS AP Science &
42 Dr. (Miss) Lucy Oommen PS DEL Medicine
43 Shri Paul Pothen PS DEL Civil Service
44 Dr. Dhani Ram Prem PS UK Social Work
45 Ustad Allarakha Khan Qureshi PS J&K Art
46 Sheikh Mohd. Rafique PS UP Social Work
47 Shri Bhupathiraju Vissam Raju PS DEL Civil Service
48 Dr. Cingireddy Narayana Reddy PS AP Litt. & Edu.
49 Shri Jehangir Ardeshir Sabavala PS MAH Art
50 Shri Gulam Rasul Santosh PS DEL Art
51 Shri Tambarhalli Subramanya Satyan PS DEL Litt. & Edu.
52 Shri Devendra Satyarthi PS DEL Litt. & Edu.
53 Kum. Meena Shah PS UP Sports
54 Dr. (Smt.) Madhuri Ratilal Shah PS MAH Litt. & Edu.
55 Smt. Gool Kaikobad Sorabji Shavaksha PS MAH Social Work
56 Smt. Evelyn Norah Shullai PS MEG Litt. & Edu.
57 Rana Moti Singh PS PUN Science &
58 Prof. Sibte Hasan Zaidi PS UP Science &
1980
1 Mother Mary Bojaxhiu Teresa BR WB Social Work
2 Shri Bismillah Khan PV UP Art
3 Shri Rai Krishnadasa PV UP Civil Service
4 Shri Sunil Manohar Gavaskar PB MAH Sports
1981
1 Dr. Satish Dhawan PV KAR Science &
2 Shri Ravi Shankar PV UP Art
3 Dr. Manali K. Vainu Bappu PB TN Science &
4 Dr. Prafulla Bhagubhai Desai PB MAH Medicine
5 Smt. Mekhala Jha PB BIH Social Work
6 Shri Avul Pakir Jinalabdeen Abdul Kalam PB DEL Civil Service
7 Shri Gopi Nath Mohanty PB OR Litt. & Edu.
8 Dr. Prabhat Kumar Mukherjee PB WB Civil Service
9 Shri Amritlal Nagar PB UP Litt. & Edu.
10 Shri Mrinal Sen PB WB Art
11 Smt. Avabai Bomanji Wadia PB MAH Social Work
12 Smt. Chubalemla Ao PS NAG Social Work
13 Prof. Jasbir Singh Bajaj PS DEL Medicine
14 Shri Vasudevan Baskaran PS TN Sports
15 Dr. Krishna Datta Bharadwaj PS DEL Litt. & Edu.
16 Smt. Sita Devi PS DEL Art
17 Dr. Madhav Dhananjaya Gadgil PS KAR Civil Service
18 Dr. Hari Krishan Jain PS DEL Science &
19 Capt. Fakir Mohomed Jainuddin Juvale PS MAH Civil Service
20 Dr. Gurcharn Singh Kalkat PS USA Science &
21 Shri Babukudi V. Karanth PS KAR Art
22 Dr. Dinkar Gangadhar Kelkar PS MAH Science &
23 Shri Abid Ali Khan PS AP Litt. & Edu.
24 Shri Namagiripettai K. Krishnan PS TN Art
25 Shri Gambhir Singh Mura PS WB Art
26 Shri Kunwar Singh Negi PS UTTR Social Work
27 Shri Sita Ram Pal PS UP Social Work
28 Prof. Ram Partabrai Panjwani PS MAH Litt. & Edu.
29 Shri Dashrath Patel PS GUJ Art
30 Smt. Bakulaben Motibhai Patel PS GUJ Medicine
31 Shri Sayed Haider Raza PS FRA Art
32 Dr. Vishwanath Hari Salaskar PS MAH Social Work
33 Dr. Pramod Karan Sethi PS RAJ Medicine
34 Bhagat Puran Singh PS PUN Social Work
35 Dr. Dhanwant Singh PS PUN Medicine
36 Dr.(Kum.) Padma Subrahmanyam PS TN Art
37 Dr. K.Varadachari Thiruvengadam PS TN Medicine
38 Dr.(Kum.) Claire Marie Jeanne Vellut PS TN Social Work
1982
1 Miss Mira Behn PV UK Social Work
2 Prof. Jasbir Singh Bajaj PB DEL Medicine
3 Shri S. Balachander PB TN Art
4 Shri Gottipati Brahmaiah PB AP Social Work
5 Ms. Rani Gaidinliu PB NAG Social Work
6 Ustad Khadim Husain Khan PB MAH Art
7 Dr. (Smt.) Stella Kramrisch PB USA Litt. & Edu.
8 Dr. Jal Minocher Mehta PB MAH Medicine
9 Dr. Grace L.Mc Cann Morley PB DEL Science &
10 Prof. Atm Prakash PB DEL Medicine
11 Dr. Syed Zahoor Qasim PB DEL Civil Service
12 Dr. Arni S. Ramakrishnan PB TN Medicine
13 Dr. (Smt.) Kamal Jayasing Ranadive PB MAH Medicine
14 Acharya P.N. Pattabhirama Sastri PB UP Litt. & Edu.
15 Shri Jhabar Mall Sharma PB RAJ Litt. & Edu.
16 Dr. Ajit Ram Verma PB DEL Science &
17 Dr. Niranjan Das Aggarwal PS PUN Medicine
18 Shri Kalimuddin Ahmed PS BIH Litt. & Edu.
19 Sushree Hajjan Allah Jilai Bai PS RAJ Art
20 Shri Vaikom Muhammad Basheer PS KER Litt. & Edu.
21 Shri Ammannur Madhava Chakyar PS KER Art
22 Shri Madhav Kashinath Dalvi PS TN Social Work
23 Dr. Ghanashyam Das PS ASM Social Work
24 Vice Adm. Nar Pati Datta PS MAH Civil Service
25 Swami Kalyan Deo PS UP Social Work
26 Rear Adm. Francis Leslie Fraser PS UTTR Science &
27 Dr. Krishnaswamy Kasturirangan PS KAR Science &
28 Shri Syed M.H. Kirmani PS KAR Sports
29 Shri Prem Chandra Luthar PS DEL Civil Service
30 Shri Kapil Dev Nikhanj PS CHA Sports
31 Shri Prakash Ramesh Padukone PS DEN Sports
32 Shri Raghunath Vishnu Pandit PS GER Litt. & Edu.
33 Shri E.Srinivasan Parthasarathy PS TN Civil Service
34 Dr. Jabbar Razak Patel PS MAH Art
35 Shri Virendra Prabhakar PS DEL Art
36 Prof. Satya Prakash PS GUJ Science &
37 Shri Vakkaleri Narayana Rao PS KAR Science &
38 Dr. Gopal Krishna Saraf PS WB Medicine
39 Prof. Sher Singh Sher PS CHA Litt. & Edu.
40 Smt. Gaura Pant Shivani PS UP Litt. & Edu.
41 Dr. Chandreshwar Prasad Thakur PS BIH Medicine
42 Shri Shiv Dutt Upadhyaya PS DEL Social Work
43 Shri Gautam Vaghela PS MAH Art
44 Shri Ramaswamy M. Vasagam PS KER Science &
45 Shri Palligarnai Thirumalai Venugopal PS USA Civil Service
46 Dr. Rajendra Tansukhram Vyas PS MAH Social Work
47 Dr. Raj Vir Singh Yadav PS CHA Medicine
1983
1 Shri Acharya Vinoba Bhave BR MAH Social Work
2 Sir Richard Samuel Attenborough PB UK Art
3 Prof. Subodh Chandra Sen Gupta PB WB Litt. & Edu.
4 Dr. V. Doreswamy Iyengar PB KAR Art
5 Pt Vishnu Govind Jog PB WB Art
6 Lt. Gen. Suraj Parkash Malhotra PB DEL Civil Service
7 Dr. Nagendra PB DEL Litt. & Edu.
8 Shri K. Sankaran Nair PB KER Civil Service
9 Shri Prem Nazir PB KER Art
10 Shri Swraj Paul PB UK Social Work
11 Dr. Singanellur Puttaswamaiah Muthuraj Rajkumar PB KAR Art

12 Prof. K. Gopalaiyer Ramanathan PB MAH Litt. & Edu.
13 Shri Kershasp Tehmurasp Satarawala PB GOA Civil Service
14 Lt. Gen. Adi M. Sethna PB DEL Civil Service
15 Prof. Arun Kumar Sharma PB DEL Science &
16 Shri Benudhar Sharma PB ASM Litt. & Edu.
17 Shri Umrao Singh PB PUN Civil Service
18 Shri Raja Bhalendra Singh PB DEL Sports
19 Shri Vijay Prakash Amritraj PS TN Sports
20 Dr. Sengamedu Srinivasa Badrinath PS TN Medicine
21 Shri Kanwaljit Singh Bains PS UP Civil Service
22 Dr.(Kum.) Raj Baveja PS UP Medicine
23 Dada Shewak Bhojraj PS MAH Social Work
24 Prof. Prakash Chandra PS DEL Medicine
25 Miss Ahalya Chari PS TN Litt. & Edu.
26 Shri Amitabha Chaudhuri PS WB Litt. & Edu.
27 Shri Addepalli Sarvi Chetty PS AP Social Work
28 Shri Saroj Raj Choudhury PS WB Science &
29 Miss Pamela Cullen PS UK Art
30 Dr. R. Ganapati PS MAH Medicine
31 Isai Mani Seerkhazhi S. Govindarajan PS TN Art
32 Shri Guru Hanuman PS DEL Sports
33 Smt. Saliha Abid Husain PS DEL Litt. & Edu.
34 Shri Chhattra Pati Joshi PS DEL Civil Service
35 Ar.V.Mar. Harkrishan Lal Kapur PS DEL Civil Service
36 Dr. Dara Kaikhushroo Karanjavala PS MAH Medicine
37 Ustad Sharafat Hussain Khan PS UP Art
38 Shri Gulam Rusull Khan PS J&K Civil Service
39 Shri Komal Kothari PS RAJ Litt. & Edu.
40 Shri Nepal Mahato PS WB Art
41 Shri Hundraj Lilaram Dukhayal Manik PS GUJ Litt. & Edu.

42 Shri Prabhu Handel Manuel PS TN Art
43 Shri M.P. Nachimuthu PS TN Social Work
44 Smt. Eliza Nelson PS MAH Sports
45 Br. K.V. S.J Peter PS TN Civil Service
46 Shri Raghu Raj PS UP Civil Service
47 Shri Chand Ram PS HRY Sports
48 Dr. Shishupal Ram PS BIH Medicine
49 Smt. Kanwal Sidhu Nee Randhawa PS PUN Art
50 Dr. Narla Tata Rao PS AP Civil Service
51 Dr. Dharam Veer Sachdeva PS DEL Medicine
52 Shri Anselm Sawihlira PS MIZ Civil Service
53 Dr. Raghuvir 'Mitra' Sharan PS UP Litt. & Edu.
54 Shri Gulam Mohammed Sheikh PS GUJ Art
55 Shri Hassan Nasiem Siddiquie PS GOA Science &
56 Guru Lairenmayum Damu Singh PS MAN Sports
57 Shri Sat Pal Singh PS DEL Sports
58 Shri Kaur Singh PS PUN Sports
59 Shri Bahadur Singh PS JKND Sports
60 Dafadar Raghubir Singh PS RAJ Sports
61 Sardar Sohan Singh PS PUN Art
62 Prof. Attar Singh PS CHA Litt. & Edu.
63 Shri Raghubir Singh PS FRA Art
64 Shri Sobha Singh PS HRY Art
65 Shri Habib Tanvir PS DEL Art
66 Shri Jivanlal Motilal Thakore PS GUJ Civil Service
67 Shri Narain Singh Thapa PS MAH Art
68 Miss Manathoor Devasia Valsamma PS KER Sports
69 Dr. Purshottam Lal Wahi PS CHA Medicine
70 Dr. Nekibuz Zaman PS ASM Medicine
71 Miss Geeta Zutshi PS HRY Sports
1984
1 Mr. Horace Alexander PB USA Litt. & Edu.
2 Pt. Shri Narayana Chaturvedi PB UP Litt. & Edu.
3 Shri Michael Joseph Ferreira PB MAH Sports
4 Shri Villupuram Chinniah (Shivaji) Ganesan PB TN Art

5 Shri Jnan Prakash Ghosh PB WB Art
6 Prof. Kotta Satchidananda Murty PB AP Litt. & Edu.
7 Dr. Hanumanthappa Narasimhaiah PB KAR Litt. & Edu.
8 Dr. Sripada Pinakapani PB AP Art
9 Dr. Ishwari Prasad PB UP Litt. & Edu.
10 Shri Bhavesh Chandra Sanyal PB MP Art
11 Miss Marie Seton PB UK Litt. & Edu.
12 Prof. Archana Sharma PB WB Medicine
13 Prof. Obaid Siddiqi PB MAH Science &
14 Shri Kanwar Natwar Singh PB DEL Civil Service
15 Dr. Ganda Singh PB PUN Litt. & Edu.
16 Shri Vijay Dhondopant Tendulkar PB MAH Art
17 Acharya Baladeva Upadhyaya PB UP Litt. & Edu.
18 Shri Mohammed Hamid Ansari PS DEL Civil Service
19 Shri Mayangnokcha Ao PS NAG Litt. & Edu.
20 Shri Amitabh Bachchan PS MAH Art
21 Shri Charles Borromeo PS BIH Sports
22 Shri Kshem Suman Chandra PS DEL Litt. & Edu.
23 Smt. Lakshmi Kumari Chundawat PS RAJ Litt. & Edu.
24 Prof.(Miss Maria Renee Cura PS ARGN Science &
25 Smt. Omem Moyong Deori PS DEL Social Work
26 Smt. Ganga Devi PS BIH Art
27 Shri Prem Nath Dhawan PS TN Social Work
28 Shri Phu Dorjee PS SIK Sports
29 Miss Roshan Kumari Faqir Mohammed PS MAH Art
30 Ms. Shanta Kalidas Gandhi PS MAH Litt. & Edu.
31 Dr. Mukti Prasad Gogoi PS ASM Medicine
32 Shri Adoor Gopalakrishnan PS KER Art
33 Shri Chuni Goswami PS WB Sports
34 Dr. Vasant Ranchhod Gowariker PS MAH Science &
35 Dr. Bal Krishna Goyal PS MAH Medicine
36 Dr. Sadhu Singh Hamdard PS PUN Litt. & Edu.
37 Prof.(Mrs. Vera Hingorani PS DEL Medicine
38 Miss Qurratulain Hyder PS UP Litt. & Edu.
39 Shri Ganapatrao Govindrao Jadhav PS MAH Litt. & Edu.
40 Dr. Satya Pal Jagota PS CAN Civil Service
41 Dr. (Mrs.) Basantibala Jena PS OR Medicine
42 Shri Pramod Kale PS GUJ Science &
43 Shri Bhupen P. Khakhar PS GUJ Art
44 Prof. Mohammad Khalilullah PS DEL Medicine
45 Col. D. K. Khullar PS PUN Sports
46 Shri Ben Kingsley PS UK Art
47 Shri Syed Abdul Malik PS ASM Litt. & Edu.
48 Shri John Arthur King Martyn PS UTTR Litt. & Edu.
49 Dr. Krishna Prasad Mathur PS DEL Medicine
50 Pt. Vinaya Chandra Maudalya PS DEL Art
51 Shri Mavelikkara Krishnankutty Nair PS KER Art

52 Prof. Narayana Nair PS KER Medicine
53 Shri K. Narayanan PS GUJ Science &
54 Pt. Purushottam Das Pakhawaji PS RAJ Art
55 Miss Bachendri Pal PS UP Sports
56 Dr. Awadhesh Prasad Pandey PS AP Medicine
57 Shri Nilambar Pant PS KAR Science &
58 Shri Dharamchand Patni PS MAN Social Work
59 Shri Suranad P.N. Kunjan Pillai PS KER Litt. & Edu.
60 Dr. (Smt.) N. Rajam PS UP Art
61 Shri Zainulabedin Gulamhusain Rangoonwala PS MAH Social Work

62 Shri Myneni Hariprasada Rao PS MAH Science &
63 Smt. Radha Reddy PS DEL Art
64 Shri Raja Reddy PS DEL Art
65 Shri Nek Chand Saini PS CHA Art
66 Dr. Syed Naseer Ahmad Shah PS J&K Medicine
67 Dr. Malur Ramaswamy Srinivasan PS MAH Science &
68 Dr. Hariharan Srinivasan PS TN Medicine
69 Shri Krishna Murari Tiwari PS UTTR Civil Service
70 Shri Ramgopal Vijaiwargiya PS RAJ Art
71 Shri Hari Krishna Wattal PS UP Civil Service
72 Dr. Jai Singh Pal Yadav PS DEL Civil Service
1985
1 Prof. Mambillikalathil Govind Kumar Menon PV KER Civil Service

2 Prof. C. Nagesa Ramachandra Rao PV TN Science &

3 Dr. Rais Ahmed PB DEL Litt. & Edu.
4 Dr. (Just.) Durga Das Basu PB WB Public Affairs
5 Prof. Shiba Prasad Chatterjee PB WB Litt. & Edu.
6 Prof. Eknath Vasant Chitnis PB GUJ Science &
7 Prof. Virender Lal Chopra PB DEL Science &
8 Shri Santidev Ghose PB WB Art
9 Shri Surrindar Singh Gill PB DEL Civil Service
10 Shri Bhimsen Gururaj Joshi PB MAH Art
11 Justice Syed Sadat Abdul Masud PB WB Public Affairs
12 Smt. Kalanidhi Narayanan PB TN Art
13 Prof. Bernard Peters PB DEN Science &
14 Shri Thakazhi Sivasankara Pillai PB KER Litt. & Edu.
15 Shri Gopala Ramanujam PB TN Social Work
16 Prof. Sivaraj Ramaseshan PB KAR Science &
17 Shri Vuppuluri Ganapathi Sastry PB AP Litt. & Edu.
18 Dr. Amarjit Singh PB RAJ Civil Service
19 Prof. Gurbakhsh Singh PB DEL Civil Service
20 Shri T. Purushottamdas Luhar Sundaram PB PUD Litt. & Edu.

21 Prof. Gurbachan Singh Talib PB PUN Litt. & Edu.
22 Prof. Bhalchandra M. Udgaonkar PB MAH Science &
23 Dr. Srinivasan Varadarajan PB DEL Civil Service
24 Shri Om B. Agrawal PS WB Sports
25 Prof. Syed Hasan Askari PS BIH Litt. & Edu.
26 Shri Krishan Dev Bali PS DEL Civil Service
27 Shri Jai Rattan Bhalla PS DEL Science &
28 Maj. Gen. Som Nath Bhaskar PS KAR Civil Service
29 Smt. Ela Ramesh Bhatt PS GUJ Social Work
30 Miss Elizabeth Brunner PS DEL Art
31 Shri Arvindlal Navranglal Buch PS GUJ Social Work
32 Dr. Biswaranjan Chatterjee PS WB Medicine
33 Shri Shanti Dave PS GUJ Art
34 Shri James Dokhuma PS MIZ Litt. & Edu.
35 Dr. Ramniklal Kirchand Gandhi PS MAH Medicine
36 Shri Prabhulal Garg alias Kaka Hathrasi PS UP Litt. & Edu.

37 Shri Harbans Singh Jolly PS DEL Civil Service
38 Dr. Satish Chandra Kala PS UP Civil Service
39 Prof. Dinamani Shridhar Kamat PS UTTR Civil Service
40 Prof. Predhiman Krishan Kaw PS GUJ Science &
41 Shri Namagundlu Venkata Krishnamurthy PS MAH Civil Service
42 Shri Ratnappa Kumbhar PS MAH Social Work
43 Dr. Erasmus Lyngdoh PS MEG Civil Service
44 Shri Asa Singh Mastana PS DEL Art
45 Dr. Shital Raj Mehta PS RAJ Medicine
46 Dr. Bharat Mishra PS BIH Litt. & Edu.
47 Dr. Madan Mohan PS DEL Medicine
48 Shri Chandra Mohan PS CHA Civil Service
49 Shri Bhagwat Murmu PS BIH Social Work
50 Dr. Samiran Nundy PS DEL Medicine
51 Shri Laxman Pai PS GOA Art
52 Shri Hari Shankar Parsai PS MP Litt. & Edu.
53 Miss Smita S. Patil PS MAH Art
54 Shri S.V.S. Raghavan PS DEL Civil Service
55 Shri Palghat R. Raghu PS TN Art
56 Smt. Nelly Homi Sethna PS MAH Trade & Ind.
57 Shri Naseeruddin Shah PS MAH Art
58 Dr. (Smt.) Usha Sharma PS UP Medicine
59 Shri Ashangbam Singh PS MAN Litt. & Edu.
60 Shri Jasdev Singh PS DEL Civil Service
61 Dr. S.Srinivasa Sriramacharyulu PS DEL Medicine
62 Shri Jadunath Supakar PS UP Trade & Ind.
63 Shri Haridas Singh Thongram PS MAN Social Work
64 Miss P.T. Usha PS KER Sports
65 Smt. Anutai Vagh PS MAH Social Work
66 Dr. Marthanda V. Sankaran Valiathan PS KER Medicine
67 Dr. Gopal Krishna Vishwakarma PS DEL Medicine
1986
1 Shri M. Devidas Alias Baba Amte PV MAH Social Work
2 Shri Birju Maharaj PV DEL Art
3 Prof. Autar Singh Paintal PV DEL Medicine
4 Dr. V.Srinivasa Raghavan Arunachalam PB DEL Civil Service
5 Dr. Pushpa Mittra Bhargava PB AP Medicine
6 Smt. Ela Ramesh Bhatt PB GUJ Social Work
7 Lt.Gen.(Rt Manohar Lal Chibber PB DEL Civil Service
8 Ustad Nasir Aminuddin Dagar PB WB Art
9 Shri Venkataraman Krishnamurthy PB DEL Civil Service
10 Shri Jean Riboud PB FRA Public Affairs
11 Dr. S. Dillon Ripley PB USA Science &
12 Shri Rajeev Sethi PB DEL Civil Service
13 Shri Martand Singh PB DEL Public Affairs
14 Shri C. Venkataraman Sundaram PB TN Science &
15 Dr. Badri Nath Tandon PB DEL Medicine
16 Shri Gulshan Lal Tandon PB WB Civil Service
17 Shri Ram Krishna Trivedi PB UP Public Affairs
18 Kumari Anupama G. Abhyankar PS MAH Sports
19 Shri Anil Kumar Agarwal PS DEL Litt. & Edu.
20 Hon. Gokaldas Shivaldas Ahuja PS MAH Civil Service
21 Shri S.M. Shinde @ S.B. Appegaonkar PS MAH Art
22 Smt. Kanika Bandyopadhyaya PS WB Art
23 Shri Chandi Parsad Bhatt PS UTTR Social Work
24 Smt. Mahasveta Devi PS WB Social Work
25 Shri Krishen Dev Dewan PS BIH Social Work
26 Shri Govind Bhimacharya Joshi PS KAR Others
27 Prof. Santosh Kumar Kacker PS DEL Medicine
28 Shri Tushar Kanjilal PS WB Social Work
29 Shri Binode Kanungo PS OR Litt. & Edu.
30 Shri Avdhesh Kaushal PS UTTR Social Work
31 Shri Anil Kumar Lakhina PS MAH Civil Service
32 Shri Narayan Singh Manaklao PS RAJ Social Work
33 Shri Subrata Mitra PS WB Art
34 Dr. (Smt.) Chitra Jayant Naik PS MAH Litt. & Edu.
35 Shri Shaik Nazar PS AP Art
36 Prof. Abdur Rahman PS DEL Litt. & Edu.
37 Smt. Nuchhungi Renthlei PS MIZ Litt. & Edu.
38 Shri Swarup Krishan Reu PS DEL Sports
39 Shri Sanjit (Bunker) Roy PS DEL Social Work
40 Shri Geet Siriram Sethi PS GUJ Sports
41 Shri Mohammed Shahid PS UP Sports
42 Dr. Viswanathan Shanta PS TN Medicine
43 Shri Raghunath Sharma PS UP Litt. & Edu.
44 Shri Ramesh Inder Singh PS DEL Civil Service
45 Shri Rajkumar Singhajit Singh PS DEL Art
46 Dr. Somasundaram Subramanian PS DEL Civil Service
47 Shri Hisamudin Usta PS RAJ Art
1987
1 Khan Abdul Ghaffar Khan BR PAK Social Work
2 Smt. Kamaladevi Chattopadhyay PV KAR Social Work
3 Dr. Benjamin Peary Pal PV PUN Science &
4 Dr. Manmohan Singh PV DEL Civil Service
5 Late. Arun Shridhar Vaidya PV MAH Civil Service
6 Smt. Nalapat Balamani Amma PB KER Litt. & Edu.
7 Smt. Kishori Ravindra Amonkar PB MAH Art
8 Shri Srinivasa Anandaram PB DEL Civil Service
9 Shri Nikhil Ranjan Banerjee PB WB Art
10 Prof. Roddam Narasimha PB KAR Science &
11 Shri Ramachandra Dattatraya Pradhan PB MAH Civil Service

12 Shri Annada Sankar Ray PB WB Litt. & Edu.
13 Shri Julio Francis Ribeiro PB MAH Civil Service
14 Prof. Manmohan Sharma PB MAH Science &
15 Dr. Laxmi Prasad Sihare PB DEL Civil Service
16 Dr. Farokh Erach Udwadia PB MAH Medicine
17 Shri Mohammad Yunus PB DEL Civil Service
18 Dr. Nazir Ahmad PS UP Litt. & Edu.
19 Shri Mohd. Izhar Alam PS BIH Civil Service
20 Begam Zaffar Ali PS J&K Social Work
21 Smt. Jaya Arunachalam PS TN Social Work
22 Shri Kailasam Balachander PS TN Art
23 Shri Joginder Paul Birdi PS PUN Civil Service
24 Capt. Hormazdiar Jamshedji Muncherji Desai PS MAH Social Work

25 Dr. Saroj Kumar Gupta PS WB Medicine
26 Shri Hrangaia PS MIZ Social Work
27 Dr. Vanaja Iyengar PS AP Litt. & Edu.
28 Shri Gurbachan Jagat PS DEL Civil Service
29 Dr. Prem Kumar Kakar PS DEL Medicine
30 Smt. Khawlkungi PS MIZ Litt. & Edu.
31 Smt. Kumudini Lakhia PS GUJ Art
32 Smt. Vijaya Farrokh Mehta PS MAH Art
33 Shri Badri Narayan PS MAH Litt. & Edu.
34 Dr. Prabhu Dayal Nigam PS DEL Medicine
35 Shri Khelchandra Singh Ningthoukhongjam PS MAN Litt. & Edu.
36 Dr. Debiprasanna Pattanayak PS KAR Litt. & Edu.
37 Dr. Natesan Ramani PS TN Art
38 Prof. Paranandi Venkata Suryanarayana Rao PS MAH Science &

39 Miss Bhagyashree Sathe PS MAH Sports
40 Shri Abdus Sattar PS ASM Litt. & Edu.
41 Prof. Sant Singh Sekhon PS PUN Litt. & Edu.
42 Smt. Aparna Sen PS WB Art
43 Shri Vaidya Amar Nath Shastri PS CHA Medicine
44 Dr. Ramadas Panemangalore Shenoy PS KAR Science &

45 Shri Kartar Singh PS PUN Civil Service
46 Dr. Daljit Singh PS PUN Medicine
47 Shri Naresh Sohal PS UK Art
48 Shri Dilip Balwant Vengsarkar PS MAH Sports
49 Dr. Harbans Singh Wasir PS DEL Medicine
1988
1 Shri Marudur Gopalan Ramachandran BR TN Public Affairs
2 Justice Mirza Hameedullah Beg PV DEL Public Affairs
3 Dr. Kuppali Venkatappagowda Puttappa PV KAR Litt. & Edu.

4 Late Mahadevi Varma PV UP Litt. & Edu.
5 Shri Kushok Bakula PB DEL Public Affairs
6 Prof. Ram Prakash Bambah PB CHA Science &
7 Shri Kartar Singh Duggal PB DEL Litt. & Edu.
8 Dr. Ashok Sekhar Ganguly PB MAH Trade & Ind.
9 Shri Abid Hussain PB DEL Civil Service
10 Shri Shriyans Prasad Jain PB MAH Social Work
11 Shri Kelu Charan Mohapatra PB OR Art
12 Shri Bal Ram Nanda PB DEL Litt. & Edu.
13 Shri Akkineni Nageswara Rao PB AP Art
14 Prof. (Dr.) Pratury Tirumala Rao PB AP Medicine
15 Smt. Renuka Ray PB WB Public Affairs
16 Prof. Badanaval Venkata Sreekantan PB MAH Science &
17 Col. Satya Pal Wahi PB UP Trade & Ind.
18 Shri Jitendra Bhikaji Abhisheki PS MAH Art
19 Shri Viswanathan Anand PS TN Sports
20 Shri Mohammed Azharuddin PS AP Sports
21 Smt. Shabana Azmi PS MAH Art
22 Smt. Teejan Bai PS MP Art
23 Shri Bikash Bhattacharjee PS WB Art
24 Shri Madaram Brahma PS ASM Litt. & Edu.
25 Shri Avinder Singh Brar PS PUN Civil Service
26 Shri Jadeng Buana PS MIZ Social Work
27 Shri Valmiki Choudhary PS DEL Public Affairs
28 Prof. Nissim Ezekiel PS MAH Litt. & Edu.
29 Dr. Karimpumannil George PS KER Litt. & Edu.
30 Shri Zakir Hussain PS USA Art
31 Shri Chaman Lal PS DEL Civil Service
32 Smt. Chindodi Leela PS KAR Art
33 Shri Mario De Miranda PS MAH Litt. & Edu.
34 Dr. Vidya Niwas Misra PS UP Litt. & Edu.
35 Dr. Vithalbhai Chhotabhai Patel PS GUJ Medicine
36 Smt. Sudharani Raghupathy PS TN Art
37 Shri Ramanatha Venkata Ramani PS TN Science &
38 Shri Shivanarayan Motilal @ Babubhai Rathi PS MAH Trade & Ind.

39 Shri Sudarshan Sahoo PS OR Art
40 Shri Kudrat Singh PS RAJ Art
41 Shri U. K. Sivaraman PS TN Art
42 Shri Sarbdeep Singh Virk PS PUN Civil Service
43 Col.(Retd.) Darshan Singh Vohra PS CHA Social Work
44 Shri Ali Jawad Zaidi PS UP Litt. & Edu.
1989
1 Shri Umashankar Dikshit PV UP Public Affairs
2 Ustad Ali Akbar Khan PV WB Art
3 Dr. Monkombu S. Swaminathan PV DEL Science &
4 Late Lord Fenner Brockway PB UK Public Affairs
5 Dr. (Smt.) Banoo Jehangir Coyaji PB MAH Medicine
6 Smt. Girija Devi PB UP Art
7 Shri Kattingeri Krishna Hebbar PB MAH Art
8 Shri Girilal Jain PB DEL Litt. & Edu.
9 Smt. Anna Rajam Malhotra PB MAH Civil Service
10 Prof. Mukut Vehari Mathur PB RAJ Science &
11 Dr. Ashes Prosad Mitra PB DEL Science &
12 Shri Rustomji Hoermusji Mody PB JKND Trade & Ind.
13 Shri Suresh Shankar Nadkarni PB MAH Trade & Ind.
14 Dr. Narinder Singh Randhawa PB DEL Science &
15 Shri Yoshio Sakurauchi PB JPN Public Affairs
16 Shri Lakshman Singh PB MAH Public Affairs
17 Dr. Prakash Narain Tandon PB DEL Medicine
18 Dr. Kalim Ahmed Ajiz PS BIH Litt. & Edu.
19 Smt. Mithu Alur PS MAH Social Work
20 Shri Vedaratnam Appakutti PS TN Social Work
21 Dr. Barsane Lal Chaturvedi PS DEL Litt. & Edu.
22 Smt. Anita Desai PS DEL Litt. & Edu.
23 Smt. Rajmohini Devi PS MP Social Work
24 Dr. Saroj Ghose PS WB Science &
25 Shri Kanwar Pal Singh Gill PS CHA Civil Service
26 Smt. Krishnammal Jagannathan PS TN Social Work
27 Shri Mag Raj Khangarmal Jain PS RAJ Social Work
28 Shri Edward Kutchat PS A&N Social Work
29 Shri Adyar K. Lakshman PS TN Art
30 Shri Nima Namgyal Lama PS WB Civil Service
31 Prof. Shiv Raj Kumar Malik PS DEL Medicine
32 Shri Ved Prakash Marwah PS DEL Civil Service
33 Kum. Kiran Mazumdar PS KAR Trade & Ind.
34 Smt. Lila Firoz Poonawalla PS MAH Trade & Ind.
35 Dr. Palle Rama Rao PS AP Science &
36 Shri Moti Lal Razdan Saqi PS J&K Litt. & Edu.
37 Shri Hakubhai Vajubhai Shah PS GUJ Art
38 Shri Sarabjit Singh PS PUN Civil Service
39 Dr. L. Subramaniam PS TN Art
40 Shri Rong Bong Terang PS ASM Litt. & Edu.
41 Shri Ratan Thiyam PS MAN Art
42 Shri Upendra Jethalal Trivedi PS GUJ Art
43 Shri Sheikh Shams Uddin PS UP Art
44 Prof. V. Venkatachalam PS UP Litt. & Edu.
1990
1 Dr. Bhimrao Ramji Ambedkar BR MAH Public Affairs
2 Dr. Nelson Rolihlahla Mandela BR SA Public Affairs
3 Dr. Vallampadugai Srinivasa Raghavan Arunachalam PV DEL Litt. & Edu.

4 Shri Triloki Nath Chaturvedi PV KAR Civil Service
5 Prof. Bhabatosh Datta PV WB Litt. & Edu.
6 Shri Shivputra Sidhram Komkali Alias Kumar Gandharv PV MP Art

7 Dr. Avul Pakir Jainulabdeen Abdul Kalam PV DEL Science &

8 Dr. Semmangudi Radhakrishnier Srinivasier PV TN Art

9 Dr. Rajanikant Arole PB MAH Social Work
10 Prof. Bimal Kumar Bachhawat PB DEL Science &
11 Shri Purushottam Laxman Deshpande PB MAH Art
12 Dr. Sattaiyappa Dhandapani Desikar PB TN Litt. & Edu.

13 Dr. Laxmangudi Krishnamurthy Doraiswamy PB USA Science &

14 Pt. Nikhil Ghosh PB MAH Art
15 Dr. Bal Krishna Goyal PB MAH Medicine
16 Pt. Jasraj PB MAH Art
17 Dr. Mohammad Khalilullah PB DEL Medicine
18 Shri Ram Narain Malhotra PB MAH Civil Service
19 Prof. Bimal Krishna Matilal PB UK Litt. & Edu.
20 Shri Inder Mohan PB DEL Social Work
21 Late Shri Sumant Moolgaokar PB MAH Trade & Ind.
22 Prof. Hirendra Nath Mukerjee PB WB Litt. & Edu.
23 Shri Closepet Dasappa Narasimhaiah PB KAR Litt. & Edu.
24 Prof.(Dr.) Mudumbai Seshachalu Narasimhan PB MAH Science &
25 Shri Kunwar Singh Negi PB UTTR Litt. & Edu.
26 Prof. Trilochan Pradhan PB OR Litt. & Edu.
27 Shri Narasimhan Ram PB TN Litt. & Edu.
28 Dr. Sukumar Sen PB WB Litt. & Edu.
29 Shri Arun Shourie PB DEL Litt. & Edu.
30 Shri Julius Silverman PB UK Public Affairs
31 Dr. Malur Ramaswamy Srinivasan PB MAH Science &
32 Dr. Marthanda Varma Sankaran Valiathan PB KER Medicine

33 Shri Ram Narain Agarwal PS AP Science &
34 Dr. Mohan Mahadeo Agashe PS MAH Art
35 Kum. Chandra Prabha Aitwal PS UP Sports
36 Shri Mohammad Swaleh Ansari PS UP Trade & Ind.
37 Dr. Noshir Hormasji Antia PS MAH Medicine
38 Dr. Muthukumaraswamy Aram PS TN Litt. & Edu.
39 Shri Govindan Nair Aravindaan PS KER Art
40 Dr.(Smt.) Prabha Atre PS MAH Art
41 Smt. Asghari Bai PS MP Art
42 Smt. Gulab Bai PS UP Art
43 Shri Laurence Wilfred Baker PS KER Science &
44 Shri Pradip Kumar Banerjee PS WB Sports
45 Prof. Anjan Kumar Banerji PS UP Litt. & Edu.
46 Prof. Mallappa Krishna Bhargava PS KAR Medicine
47 Shri Jatish Chandra Bhattacharyya PS WB Science &
48 Pandit Balwantrai Gulabrai Bhatt Bhavrang PS UP Art

49 Smt. Diwaliben Punjabhai Bhil PS GUJ Art
50 Shri Raj Bisaria PS UP Art
51 Prof. Dr. Gisela Bonn PS GER Others
52 Shri Vijay Kumar Chopra PS PUN Litt. & Edu.
53 Shri Behram Pirojshaw Contractor PS MAH Litt. & Edu.
54 Dr. Anutosh Datta PS WB Medicine
55 Shri Prem Chand Degra PS BIH Sports
56 Dr. Madhav Gajanan Deo PS MAH Medicine
57 Shri Radha Mohan Gadanayak PS OR Litt. & Edu.
58 Shri Madhav Yeshwant Gadkari PS MAH Litt. & Edu.
59 Shri Sattanatha Muthaiah Ganapathy PS AP Art
60 Shri Achyut Madhav Gokhale PS DEL Civil Service
61 Prof. Ashin Das Gupta PS WB Litt. & Edu.
62 Shri Kamal Haasan PS TN Art
63 Shri Kisan Baburao Hajare PS MAH Social Work
64 Shri Yashpal Jain PS DEL Litt. & Edu.
65 Smt. Renana Jhabvala PS GUJ Social Work
66 Shri Sharad Joshi PS MAH Litt. & Edu.
67 Dr. Shanmugam Kameswaran PS TN Medicine
68 Shri Bishamber Khanna PS DEL Art
69 Shri Krishen Khanna PS DEL Art
70 Shri Madhavan Pillai Ramakrishna Kurup PS KER Science &

71 Shri Tarun Majumder PS WB Art
72 Shri Jagdish Chandra Mittal PS AP Art
73 Smt. Madhavi Mudgal PS DEL Art
74 Prof. (Dr.) Gopi Chand Narang PS DEL Litt. & Edu.
75 Shri Madurai Ponnusamy Sethuraman Natesan PS TN Art

76 Shri Ishwarbhai Jivaram Patel PS GUJ Social Work
77 Shri Dinkarrao Govindrao alias Appasaheb Pawar PS MAH Science &

78 Shri Dagadu Maruti Pawar alias Daya Pawar PS MAH Litt. & Edu.

79 Shri Nilmani Phookan PS ASM Litt. & Edu.
80 Shri Kanhaiya Lal Misra Prabhakar PS UP Litt. & Edu.
81 Shri Om Puri PS MAH Art
82 Shri Gulshan Rai PS MAH Sports
83 Dr. Pylore Krishnaier Rajagopalan PS TN Medicine
84 Shri Allu Ramalingaiah PS TN Art
85 Shri Banda Vasudev Rao PS MAH Trade & Ind.
86 Dr. (Smt.) Kanak Yatindra Rele PS MAH Art
87 Kum. Leela Samson PS DEL Art
88 Shri Maharajapuram Viswanatha Santhanam PS TN Art

89 Shri Chavaly Srinivasa Sastry PS DEL Civil Service
90 Shri Jaman Lal Sharma PS UP Sports
91 Guru Aribam Surchand Sharma PS MAN Litt. & Edu.
92 Shri Inder Sharma PS DEL Others
93 Dr. Shyam Singh Shashi PS DEL Litt. & Edu.
94 Prof. Ram Nath Shastri PS J&K Litt. & Edu.
95 Shri Taranath Narayan Shenoy PS MAH Sports
96 Dr. Shriniwas PS DEL Medicine
97 Dr. Ashok Chimanlal Shroff PS MAH Medicine
98 Dr. Rajinder Singh PS HIM Others
99 Shri Barjinder Singh PS HIM Litt. & Edu.
100 Kum. Silverine Swer PS MEG Social Work
101 Dr. (Smt.) Kapila Vatsyayan PS DEL Art
1991
1 Shri Morarji Ranchhodji Desai BR GUJ Public Affairs
2 Shri Rajiv Gandhi BR DEL Public Affairs
3 Sardar Vallabhbhai Patel BR GUJ Public Affairs
4 Shri Maqbool Fida Hussain PV MAH Art
5 Dr. Mangalampalli Balamurali Krishna PV TN Art

6 Prof. Hirendra Nath Mukherjee PV WB Public Affairs
7 Shri Gulzari Lal Nanda PV GUJ Public Affairs
8 Dr. Indraprasad Gordhanbhai Patel PV GUJ Science &

9 Prof. Nayakulu Gogineni Ranga PV AP Public Affairs
10 Shri Khusro Faramurz Rustamji PV MAH Civil Service
11 Prof. Rajaram Shastri PV UP Litt. & Edu.
12 Shri Ebrahim Alkazi PB DEL Art
13 Shri Lala Amarnath PB DEL Sports
14 Prof. Narayan Shridhar Bendre PB MAH Art
15 Shri Shyam Benegal PB MAH Art
16 Prof. Dinkar Balwant Deodhar PB MAH Sports
17 Shri Amjad Ali Khan PB DEL Art
18 Shri Mohammad Yusuf Khan alias Dilip Kumar PB MAH Art

19 Shri Narayan Singh Manaklao PB RAJ Social Work
20 Dr. Muthu Krishna Mani PB TN Medicine
21 Pt. Ram Narayan PB MAH Art
22 Shri Fali Sam Nariman PB DEL Public Affairs
23 Shri Kapil Dev Nikhanj PB DEL Sports
24 Shri Manubhai Rajaram Pancholi PB GUJ Public Affairs
25 Smt. Shakuntala Paranjpye PB MAH Social Work
26 Dr. Bindeshwar Pathak PB DEL Social Work
27 Pt. Samta Prasad alias Gudai Maharaj PB UP Art

28 Dr. Basavaraj Rajguru PB KAR Art
29 Dr. Prathap Chandra Reddy PB TN Medicine
30 Smt. Amala Shankar PB WB Science &
31 Shri Vishnu Vaman Shirwadkar alias Kusumagraj PB MAH Litt. & Edu.

32 Shri Kuthur Ramakrishnan Srinivasan PB TN Litt. & Edu.
33 Prof. Al-I-Ahmad Suroor PB UP Science &
34 Dr. Leslie Denis Swindale PB NZLD Science &
35 Shri Jeevan Singh Umranangal PB PUN Public Affairs
36 Prof.(Dr.) Man Mohan Singh Ahuja PS DEL Medicine
37 Dr. Sardar Anjum PS PUN Litt. & Edu.
38 Dr. (Ms.) Shareefunnisa Begum Ansari PS AP Litt. & Edu.
39 Shri Rakesh Bakshi PS DEL Science &
40 Dr. Ravinder Kumar Bali PS DEL Medicine
41 Prof. (Dr.) Dinabandhu Banerjee PS WB Social Work
42 Shri Rudraradhya Muddu Basavaradhya PS KAR Social Work
43 Shri Shreekrishna Mahadeo Beharay PS MAH Social Work
44 Prof. Sneh Bhargava PS DEL Medicine
45 Shri Bharat Bhushan PS UP Litt. & Edu.
46 Shri Ranbir Singh Bisht PS UP Art
47 Dr. (Prof.) Purushottam B. Buckshey PS DEL Medicine
48 Dr. Kotturathu Mammen Cherian PS TN Medicine
49 Kum. Selma Juliet Christina D' Silva PS MAH Sports
50 Smt. Vimla Dang PS PUN Social Work
51 Prof. Bulusu L. Deekshatulu PS AP Science &
52 Shri Vasantrao Srinivassa Dempo PS GOA Trade & Ind.
53 Shri Rajkumar Suddhendra Narayan Singh Deo PS BIH Art

54 Shri Shadi Lal Dhawan PS DEL Litt. & Edu.
55 Dr. Kapil Deva Dvivedi PS UP Litt. & Edu.
56 Shri Ram Ganpati PS DEL Civil Service
57 Shri Ramesh Gelli PS KAR Trade & Ind.
58 Dr. Mahendra Kumar Goel PS UP Medicine
59 Shri Bharat Gopy PS KER Art
60 Shri Hari Govindrao alias Bhausaheb Vartak PS MAH Public Affairs

61 Prof. Narinder Kumar Gupta PS DEL Science &
62 Dr. Syed Hasan PS BIH Litt. & Edu.
63 Shri Bellur Krishnamachar Sunderraja Iyengar PS KAR Litt. & Edu.

64 Shri Bimal Prashad Jain PS DEL Social Work
65 Smt. Shila Jhunjhunwala PS DEL Litt. & Edu.
66 Shri Chiranjilal Gograj Joshi PS MAH Social Work
67 Prof. Shri Krishna Joshi PS HRY Science &
68 Shri Satis Chandra Kakati PS ASM Litt. & Edu.
69 Dr. Neelkanth Annappa Kalyani PS MAH Trade & Ind.
70 Shri Rameshwar Singh Kashyap PS BIH Litt. & Edu.
71 Ustad Ghulam Mustafa Khan PS MAH Art
72 Ustad Hafeez Ahmed Khan PS DEL Art
73 Dr. (Smt.) Shanno Khurana PS DEL Art
74 Dr. Vishnu Bhikaji Kolte PS MAH Litt. & Edu.
75 Shri Maharaj Krishan Kumar PS DEL Art
76 Shri R.K. Lelhluna PS MIZ Litt. & Edu.
77 Dr. Madan Lal Madhu PS RUS Litt. & Edu.
78 Shri Namdeo Dhondo Mahanor PS MAH Litt. & Edu.
79 Dr. Govind Narain Malaviya PS UP Medicine
80 Shri Keshav Malik PS DEL Litt. & Edu.
81 Dr. Raghunath Anant Mashelkar PS MAH Science &
82 Dr. (Smt.) Shiela Mehra PS DEL Medicine
83 Shri Thacheril Govindan Kutty Menon PS MP Social Work

84 Shri Surendra Mohanty PS OR Litt. & Edu.
85 Dr. Susil Chandra Munsi PS MAH Medicine
86 Dr. Purohita Thirunarayana Narasimhachar PS KAR Litt. & Edu.

87 Smt. Mani Narayan PS MAH Art
88 Shri Gopal Das Neeraj PS UP Litt. & Edu.
89 Prof. Govindarajan Padmanaban PS KAR Science &
90 Shri Venkatesan Padmanabhan PS TN Social Work
91 Shri Sonam Paljor PS UTTR Sports
92 Smt. Pratima Barua Pandey PS ASM Art
93 Shri Manu Parekh PS DEL Art
94 Dr. Mohinder Nath Passey PS DEL Medicine
95 Shri Babulal Chhogalal Pataudi PS MP Public Affairs
96 Shri Ashok Kumar Patel PS J&K Civil Service
97 Shri Jagdish Kashibhai Patel PS GUJ Social Work
98 Dr. Dnyandeo Yashawantrao Patil PS MAH Social Work

99 Smt. Ujwala Patil PS MAH Sports
100 Dr. Jagdish Prasad PS DEL Medicine
101 Dr. Bangalore P. Radhakrishna PS KAR Science &
102 Shri Mehmood-ur Rahman PS J&K Civil Service
103 Shri Sundaram Ramakrishnan PS MAH Social Work
104 Dr. Alla Venkata Rama Rao PS AP Science &
105 Shri Padamanur Ananda Rau PS TN Trade & Ind.
106 Dr. Kantilal Hastimal Sancheti PS MAH Social Work
107 Shri Dhera Ram Shah PS DEL Social Work
108 Pandit Shiv Kumar Sharma PS MAH Art
109 Sardar Gurcharan Singh PS PUN Art
110 Dr. Jai Pal Singh PS HRY Medicine
111 Shri Prakash Singh PS UP Civil Service
112 Prof.(Smt. Sharda Sinha PS BIH Art
113 Dr. Rustom Phiroze Soonawala PS MAH Medicine
114 Dr. Naresh Trehan PS DEL Medicine
115 Shri Ramanarayan Upadhyay PS MP Litt. & Edu.
116 Kum. Alarmel Valli PS TN Art
117 Dr. Genesan Venkataraman PS AP Science &
118 Dr. Hosagrahar Chandrashekhariah Visvesvaraya PS DEL Trade & Ind.

1992
1 Maulana Abul Kalam Azad BR WB Public Affairs
2 Shri Satyajit Ray BR WB Art
3 Shri Jehangir Ratanji Dadabhai Tata BR MAH Trade & Ind.

4 Smt. Aruna Asaf Ali PV DEL Public Affairs
5 Shri Laxmanshastri Balaji Joshi PV MAH Litt. & Edu.
6 Dr. Mallikarjun Bheemaryappa Mansoor PV KAR Art

7 Dr.(Kum.) Sivaramakrishna Iyer Padmavati PV DEL Medicine
8 Shri Kaloji Narayana Rao PV AP Art
9 Shri Ravi Narayan Reddy PV AP Public Affairs
10 Dr. Shantaram Rajaram Vankudre Alias Dr. V. Shantaram PV MAH Art

11 Shri Govinddas Mannulal Shroff PV MAH Litt. & Edu.
12 Sardar Swaran Singh PV PUN Public Affairs
13 Shri Atal Bihari Vajpayee PV DEL Public Affairs
14 Shri Naushad Ali Wahid Ali PB MAH Art
15 Shri Bijoy Chandra Bhagavati PB ASM Public Affairs
16 Pt. Devabrata Chaudhuri @ Debu PB DEL Art
17 Pt. Hariprasad Chaurasia PB MAH Art
18 Dr. Thayil John Cherian PB TN Medicine
19 Prof. Ranjan Roy Daniel PB TN Science &
20 Shri Virendra Dayal PB DEL Civil Service
21 Dr. Khem Singh Gill PB PUN Science &
22 Shri Vavilala Gopalakrishnayya PB AP Public Affairs
23 Shri Kisan Baburao Anna @ Hajare PB MAH Social Work

24 Hakim Abdul Hameed PB DEL Medicine
25 Smt. Byrappa Saroja Devi Harsha PB KAR Art
26 Shri Kongara Jaggaiah PB TN Art
27 Shri Girish Karnad PB KAR Art
28 Dr. Krishnaswamy Kasturirangan PB KAR Science &
29 Dr. Triloki Nath Khoshoo PB DEL Science &
30 Shri Goro Koyama PB JPN Others
31 Shri Adusumalli Radha Krishna PB AP Art
32 Prof. Trippunithura Krishnan PB TN Art
33 Dr. Ramchandra Lele PB MAH Medicine
34 Shri Talat Manzoor Mahmood PB MAH Art
35 Shri Syed Abdul Malik PB ASM Litt. & Edu.
36 Shri Dalsukh Dahyabhai Malvania PB GUJ Litt. & Edu.
37 Smt. Sonal Mansingh PB DEL Art
38 Dr.(Smt.) Mamballaikalathil Sarada Menon PB TN Social Work

39 Shri Setu Madhava Rao Pagadi PB MAH Litt. & Edu.
40 Shri Hasmukh Thakordas Parekh PB MAH Trade & Ind.
41 Prof. Cingireddy Narayana Reddy PB AP Litt. & Edu.
42 Smt. Mrinalini Sarabhai PB GUJ Art
43 Prof. Gursaran Prashad Talwar PB DEL Medicine
44 Vaidya Brihaspati Dev Triguna PB DEL Medicine
45 Dr.(Smt.) Kadur Venkatalakshamma PB KAR Art
46 Pt. Chintaman Raghunath Vyas PB MAH Art
47 Prof. Saiyid Amir Hasan Abidi PS DEL Litt. & Edu.
48 Shri Aspy Darabshaw Adajania PS MAH Sports
49 Mir Mushtaq Ahmed PS DEL Litt. & Edu.
50 Shri Madhava Ashish PS UP Science &
51 Smt. Jaya Bachchan PS MAH Art
52 Dr.(Smt.) Inderjit Kaur Barthakur PS DEL Civil Service
53 Shri Ramsing Fakiraji Bhanawat PS MAH Social Work
54 Dr. Mathura Nath Bhattacharyya PS ASM Medicine
55 Dr. Vishnu Ganesh Bhide PS MAH Litt. & Edu.
56 Shri Gulabdas Harjivandas Broker PS MAH Litt. & Edu.
57 Shri Krishnan Krishnan Nair alias Krishna Chaitanya PS DEL Litt. & Edu.

58 Guru Pankaj Charan Das PS OR Art
59 Dr. Burjor Cavas Dastur PS MAH Medicine
60 Dr. Rathindra Datta PS TRI Medicine
61 Shri Biren De PS DEL Art
62 Dr. (Smt.) Rajammal Packiyanathan Devadas PS TN Litt. & Edu.

63 Dr. Mahamaya Prasad Dubey PS DEL Medicine
64 Prof. Laxmi Narayan Dubey PS MP Litt. & Edu.
65 Dr. Lovelin Kumar Gandhi PS DEL Medicine
66 Sister Felisa Garbala PS GUJ Social Work
67 Shri Maadari Bhagya Gautam PS KAR Public Affairs
68 Kum. Srirangam Gopalarathnam PS AP Art
69 Dr. Khalid Hameed PS UK Medicine
70 Shri Jagjit Singh Hara PS PUN Science &
71 Shri Lalchand Hirachand PS MAH Trade & Ind.
72 Shri Shanti Lal Jain PS DEL Others
73 Prof. Vasant Shankar Kanetkar PS MAH Litt. & Edu.
74 Shri Nilkanth Yeshwant Khadilkar PS MAH Litt. & Edu.
75 Ustad Sabri Khan PS DEL Art
76 Dr. Anil Kohli PS DEL Medicine
77 Smt. Sunita Kohli PS DEL Art
78 Shri Madurai Narayanan Krishnan PS TN Art
79 Shri Manoj Kumar PS MAH Art
80 Dr. Ramesh Kumar PS DEL Medicine
81 Shri Ram Sarup Lugani PS DEL Litt. & Edu.
82 Prof. Usha Kehar Luthra PS DEL Medicine
83 Dr. Janardan Shankar Mahashabde PS MP Medicine
84 Shri Kandathil Mammen Mappillai Mammen PS TN Trade & Ind.

85 Dr. Pakkiam Vaikundam Arulanandam Mohandas PS TN Medicine

86 Vaidyan E. Thaikkattu Neelakandhan Mooss PS KER Medicine

87 Smt. Meera Mukherjee PS WB Art
88 Prof. Bratindra Nath Mukherjee PS WB Others
89 Smt. Shovana Narayan PS DEL Litt. & Edu.
90 Shri Mayankote Kelath Narayanan PS DEL Civil Service
91 Kum. Asha Bachubhai Parekh PS MAH Art
92 Smt. Rukmini Baburao Pawar PS MAH Trade & Ind.
93 Dr. Kameshwar Prasad PS DEL Medicine
94 Dr. Nataraja Ramakrishna PS AP Art
95 Smt. Shantha Ranganathan PS TN Social Work
96 Shri Gjanardhana Puranik Narayana Rao PS BHU Science &

97 Shri Nisith Ranjan Ray PS WB Litt. & Edu.
98 Shri Chuauhang Rokhuma PS MIZ Social Work
99 Shri Bhagaban Sahu PS OR Art
100 Shri Dharam Pal Saini PS MP Social Work
101 Shri Jitendra Narain Saksena PS DEL Civil Service
102 Shri Kailash Singh Sankhala PS RAJ Science &
103 Smt. Meenakshi Saraogi PS WB Trade & Ind.
104 Shri Vaman Balkrishna Naique P. Sardesai PS GOA Public Affairs

105 Dr. Vijaykumar Swarupchand Shah PS MAH Medicine

106 Smt. Vidyaben Shah PS DEL Social Work
107 Shri Kalyanji Virji Shah PS MAH Art
108 Shri Anandji Virji Shah PS MAH Art
109 Shri Mahipatrai Jadavji Shah PS MAH Social Work
110 Dr. Vinod Prakash Sharma PS DEL Science &
111 Smt. Sundari Krishnalal Shridharani PS DEL Art
112 Shri Oudh Narayan Shrivastava PS DEL Civil Service
113 Hony Capt. Shriram Singh PS DEL Sports
114 Shri Ajit Pal Singh PS DEL Sports
115 Shri Hukam Singh PS DEL Sports
116 Dr. Moirangtham Kirti Singh PS MAN Litt. & Edu.
117 Shri Tapan Sinha PS WB Art
118 Dr. (Kum.) Esther Abrham Solomon PS GUJ Litt. & Edu.
119 Dr. Luis Jose De Souza PS MAH Medicine
120 Shri Joseph Allen Stein PS DEL Science &
121 Shri Muthu Muthiah Sthapathi PS TN Art
122 Prof. Vangalampalayam Chellappagounder Kulandai Swamy PS DEL Litt. & Edu.

123 Shri Homijehangir Hormusji Taleyarkhan PS MAH Public Affairs

124 Dr. Zal Sohrab Tarapore PS MAH Science &
125 Dr. (Smt.) Amrit Tewari PS CHA Medicine
126 Shri Bal Krishen Thapar PS DEL Litt. & Edu.
127 Shri Chittu Tudu PS BIH Art
128 Shri William Mark Tully PS UK Litt. & Edu.
129 Shri Tadepalli Venkanna PS AP Art
130 Prof. Gopalasamudram Sitaraman Venkataraman PS TN Medicine

131 Shri Kasinadhuni Vishwanath PS TN Art
132 Smt. Chitra Visweswaran PS TN Art
133 Shri Alfred Georg Wuerfel PS DEL Others
1997
1 Smt. Aruna Asaf (Posth.) Ali BR DEL Public Affairs
2 Dr. A.P.J. Abdul Kalam BR DEL Science &
3 Shri Gulzari Lal Nanda BR GUJ Public Affairs
1998
1 Smt. M.S. Subbulakshmi BR TN Art
2 Shri Chidambaram Subramaniam BR TN Public Affairs
3 Dr. (Ms.) Usha H. Mehta PV MAH Social Work
4 Shri Nani Ardeshir Palkhivala PV MAH Public Affairs
5 Dr. (Smt.) Lakshmi Sahgal PV UP Public Affairs
6 Shri Walter Sisulu PV SA Public Affairs
7 Dr. Udupi Rajagopalachar Ananthamurthy PB KAR Litt. & Edu.
8 Prof. Sivaramakrishna Chandrasekhar PB KAR Science &
9 Prof. Debi Prasad Chattopadhyaya PB WB Litt. & Edu.
10 Shri Satyapal Dang PB PUN Public Affairs
11 Col. Gurbakhsh Singh Dhillon PB MP Public Affairs
12 Shri Hari Krishan Dua PB DEL Litt. & Edu.
13 Dr. Maligail Ram krishna Girinath PB TN Medicine
14 Dr.(Ms.) Hem Lata Gupta PB DEL Medicine
15 Shri K.M. Mathew PB KER Litt. & Edu.
16 Shri G. Madhavan Nair PB KER Science &
17 Dr. Rajendra Singh Paroda PB DEL Science &
18 Dr. Gurukumar Bhalchandra Parulkar PB MAH Medicine

19 Prof. Vaidyeswaran Rajaraman PB KAR Science &
20 Dr. Bhisham Sahni PB DEL Litt. & Edu.
21 Dr. Vempati Chinna Satyam PB TN Art
22 Dr. Laxmi Mall Singhvi PB DEL Public Affairs
23 Justice Vithal Mahadev Tarkunde PB UP Public Affairs
24 Dr. Panangipalli Venugopal PB DEL Medicine
25 Dr. Manmohan Attavar PS KAR Science &
26 Smt. Dipali Borthakur PS ASM Art
27 Sister Leonarda Angela Casiraghi PS KAR Social Work
28 Prof. Ranjit Roy Chaudhury PS DEL Medicine
29 Prof. Brijinder Nath Goswamy PS CHA Litt. & Edu.
30 Prof.(Smt) Priyambada Mohanty Hejmadi PS OR Science &
31 Shri Anil Kakodkar PS MAH Science &
32 Shri Shambu Nath Khajuria PS J&K Social Work
33 Shri Ramesh Krishnan PS TN Sports
34 Shri Ottaplakkal Neelakanta Velu Kurup PS KER Litt. & Edu.

35 Shri P.I. Mohammed Kutty (Mammootty) PS TN Art
36 Shri Kunja Bihari Meher PS OR Art
37 Shri Naushad Ismail Padamsee PS MAH Trade & Ind.
38 Card. Antony Padiyara PS KER Social Work
39 Shri Chewang Phunsog PS DEL Civil Service
40 Shri Pargat Singh Powar PS PUN Sports
41 Prof. Aditya Narain Purohit PS UTTR Science &
42 Hon. Capt. Lila Ram PS HRY Sports
43 Shri Suryadevara Ramachandra Rao PS GUJ Civil Service

44 Shri Krishnarao Ganpatrao @ Shahir Sable PS MAH Art

45 Smt. Lalsangzuali Sailo PS MIZ Litt. & Edu.
46 Shri Pradhan Shambu Saran PS DEL Science &
47 Shri Vijay Kumar Saraswat PS AP Science &
48 Smt. Zohra Segal PS DEL Art
49 Shri Kongbrailatpam Ibomcha @ Abhiram Sharma Shaba PS MAN Art

50 Shri Uppalapu Shrinivas PS TN Art
51 Prof. Gurdial Singh PS PUN Litt. & Edu.
52 Smt. Shantha Sinha PS AP Social Work
53 Shri Narayan Gangaram Surve PS MAH Litt. & Edu.
54 Ms. Kanta Tyagi PS MP Social Work
55 Shri Ralte Vanlawma PS MIZ Social Work
56 Smt. Shiny Wilson PS TN Sports
1999
1 Shri Gopinath (posth.) Bordoloi BR ASM Public Affairs
2 Shri Jayaprakash (Posth.) Narayan BR BIH Public Affairs
3 Prof. Amartya Sen BR UK Litt. & Edu.
4 Pandit Ravi Shankar BR USA Art
5 Shri Pandurangshastri Athavale PV MAH Social Work
6 Dr. Rajagopala Chidambaram PV MAH Science &
7 Shri Nana Deshmukh PV DEL Social Work
8 Dr. Sarvepalli Gopal PV TN Litt. & Edu.
9 Shri Satish Gujral PV DEL Art
10 Justice V.R. A. Krishna Iyer PV KER Public Affairs
11 Pandit Bhimsen Gururaj Joshi PV MAH Art
12 Justice Hans Raj Khanna PV DEL Public Affairs
13 Dr. Verghese Kurien PV GUJ Science &
14 Kum. Lata Dinanath Mangeshkar PV MAH Art
15 Shri Braj Kumar Nehru PV HIM Civil Service
16 Smt. Damal Krishnaswamy Pattammal PV TN Art
17 Shri Lallan Prasad Singh PV DEL Civil Service
18 Shri Dharma Vira PV DEL Civil Service
19 Dr. Sengamedu Srinivasa Badrinath PB TN Medicine
20 Shri Jag Parvesh Chandra PB DEL Public Affairs
21 Dr. Jacob Cherian PB TN Social Work
22 Smt. Pushpa Lata Das PB ASM Social Work
23 Shri Sohrab Pirojsha Godrej PB MAH Trade & Ind.
24 Dr. George Joseph PB GUJ Science &
25 Shri Anil Kakodkar PB MAH Science &
26 Shri D.C. Kizhakemuri PB KER Litt. & Edu.
27 Shri Ashok Kumar PB MAH Art
28 Prof. Vidya Niwas Misra PB UP Litt. & Edu.
29 Shri Krishnamurthy Santhanam PB DEL Science &
30 Shri Hari Dev Shourie PB DEL Social Work
31 Dr. Shivmangal Singh Suman PB MP Litt. & Edu.
32 Shri Ramkinker Upadhyay PB UP Others
33 Dr. Kurudamannil A. Abraham PS TN Medicine
34 Shri Javed Akhtar PS MAH Art
35 Dr. Bashir Badr PS MP Litt. & Edu.
36 Shri Ruskin Bond PS UTTR Litt. & Edu.
37 Dr. Raj Bothra PS USA Medicine
38 Smt. Shayama Chona PS DEL Litt. & Edu.
39 Shri Gian Parkash Chopra PS DEL Litt. & Edu.
40 Prof Asis Datta PS UP Science &
41 Shri Namdev Dhasal PS MAH Litt. & Edu.
42 Dr.(Smt.) Saryu Vinod Doshi PS MAH Art
43 Smt. Sulochana Shankarrao Latkar PS MAH Art
44 Smt. Karnam Malleshwari PS AP Sports
45 Dr. (Smt.) Sumati Mutatkar PS DEL Art
46 Dr. Kanhaiya Lal Nandan PS DEL Litt. & Edu.
47 Prof. Indira Nath PS DEL Science &
48 Shri Harshavardhan Neotia PS WB Trade & Ind.
49 Vaidya Balendu Prakash PS UTTR Medicine
50 Shri Mallasamudram Subramanyam Ramakumar PS MAH Science &

51 Shri Acharya Ramamurti PS BIH Social Work
52 Dr. Mangina Rao PS AP Science &
53 Dr. Rehmath Beegum Sailaniyoda PS A&N Medicine
54 Brig.(Retd) Thenphunga Sailo PS MIZ Social Work
55 Shri Virendra Singh Sethi PS CHA Science &
56 Dr. Satya Vrat Shastri PS DEL Litt. & Edu.
57 Dr. Satinder Kumar Sikka PS HRY Science &
58 Smt. Shobha Deepak Singh PS DEL Art
59 Shri Rajkumar Jhalajit Singh PS MAN Litt. & Edu.
60 Shri Jaganmoy Mitra alias Jagmohan Sursagar PS MAH Art

61 Shri Ram Vanji Sutar PS UP Art
62 Shri Sachin Ramesh Tendulkar PS MAH Sports
63 Shri Natwarbhai Thakkar PS NAG Social Work
64 Vaidya Devendra Triguna PS DEL Medicine
65 Shri Tsering Wangdus PS J&K Art
66 Dr. Panniyampalli Warrier PS KER Medicine
2000
1 Shri Sikander Bakht PV DEL Public Affairs
2 Prof. Jagdish Natwarlal Bhagwati PV USA Litt. & Edu.
3 Pandit Hari Prasad Chaurasia PV MAH Art
4 Dr. Manohar Singh Gill PV DEL Civil Service
5 Dr. Krishnaswamy Kasturirangan PV KAR Science &
6 Dr. Krishen Behari Lall PV DEL Civil Service
7 Guru Kelucharan Mohapatra PV OR Art
8 Pandit Jasraj Motiram PV MAH Art
9 Shri Maidavolu Narasimham PV AP Trade & Ind.
10 Shri Rasipuram Krishnaswami Narayan PV TN Litt. & Edu.

11 Shri Bhairab Datt Pande PV UTTR Civil Service
12 Prof. Kakkadan Nandanath Raj PV KER Litt. & Edu.
13 Shri Tarlok Singh PV DEL Civil Service
14 Dr. Vasudev Kalkunte Aatre PB DEL Science &
15 Shri Anil Kumar Agarwal PB DEL Others
16 Shri Ram Narain Agarwal PB AP Science &
17 Smt. Sharan Rani Backliwal PB DEL Art
18 Swami Kalyan Dev PB UP Social Work
19 Shri Dharmasthala Veerendra Heggade PB KAR Social Work

20 Prof. Pavagada Venkata Indiresan PB DEL Science &
21 Shri Rajini Kanth PB TN Art
22 Maulana Wahiduddin Khan PB DEL Public Affairs
23 Prof. Braj Basi Lal PB DEL Science &
24 Dr. Raghunath Anant Mashelkar PB DEL Science &
25 Shri Holenarasipur Yoganarasimham Sharada Prasad PB DEL Litt. & Edu.

26 Begam Kudsia Aizaz Rasul PB UP Social Work
27 Smt. Radha Reddy PB DEL Art
28 Shri Raja Reddy PB DEL Art
29 Prof.(Dr.) Pakkiriswamy Sekharan PB KAR Science &
30 Late Shri Karamshi Jethabhai Somaiya PB MAH Social Work
31 Late Dr. S. Srinivasan PB KER Science &
32 Shri Ratan Naval Tata PB MAH Trade & Ind.
33 Prof. (Dr.) Harbans Singh Wasir PB HRY Medicine
34 Ms. Neidonuo Angami PS NAG Social Work
35 Dr. Mahendra Bhandari PS UP Medicine
36 Dr. Vijay Pandurang Bhatkar PS MAH Science &
37 Dr. Dilip Devidas Bhawalkar PS MP Science &
38 Prof. Grigoriy Lvovitch Bondarevsky PS RUS Litt. & Edu.
39 Dr. Vipin Buckshey PS DEL Medicine
40 Vaidya Suresh Chandra Chaturvedi PS MAH Medicine
41 Shri Pahlira Sena Chawngthu PS MIZ Litt. & Edu.
42 Shri Kanhai Chitrakar PS UP Art
43 Dr. Kirpal Singh Chugh PS CHA Medicine
44 Dr. Pradeep Kumar Dave PS UP Medicine
45 Shri Aloysius Prakash Fernandez PS KAR Others
46 Shri Satya Narayan Gourisaria PS UK Public Affairs
47 Shri Gopalasamy Govindarajan PS MAH Science &
48 Smt. Piloo Nowshir Jungalwalla PS DEL Litt. & Edu.
49 Dr. Mathew Samuel Kalarickal PS TN Medicine
50 Shri Shekhar Kapur PS MAH Art
51 Shri Jagan Nath Kaul PS HRY Social Work
52 Dr. Gurdev Singh Khush PS PHLP Science &
53 Shri Dina Nath Malhotra PS DEL Others
54 Smt. Hema Malini PS MAH Art
55 Smt. Anjolie Ela Menon PS DEL Art
56 Dr. Parasu Ram Mishra PS JKND Science &
57 Dr. Mandan Mishra PS DEL Litt. & Edu.
58 Smt. Shubha Mudgal PS DEL Art
59 Smt. Patricia Mukhim PS MEG Social Work
60 Shri Nagavara Ramarao Narayana Murthy PS KAR Trade & Ind.

61 Smt. Janaky Athi Nahappan PS MAL Social Work
62 Shri Alyque Padamsee PS MAH Art
63 Shri Abdur Rahman Rahi PS J&K Litt. & Edu.
64 Shri Allah Rakka Rahman PS TN Art
65 Shri Enuga Sreenivasulu Reddy PS USA Public Affairs
66 Dr. Ramanand Sagar PS MAH Art
67 Dr. Gurumukh Sajanmal Sainani PS MAH Medicine
68 Dr. Immaneni Sathyamurthy PS TN Medicine
69 Shri Kalika Prasad Saxena PS UP Litt. & Edu.
70 Smt. Nabaneeta Dev Sen PS WB Litt. & Edu.
71 Shri Elangbam Nilakanta Singh PS MAN Litt. & Edu.
72 Prof.(Dr.) Kakarla Subbarao PS AP Medicine
73 Dr. Hanumappa Sudarshan PS KAR Social Work
74 Shri Rabindra Nath Upadhyay PS ASM Social Work
75 Smt. Santosh Yadav PS DEL Sports
2001
1 Ustad Bismillah Khan BR UP Art
2 Kum. Lata Dinanath Mangeshkar BR MAH Art
3 Shri John Kenneth Galbraith PV USA Litt. & Edu.
4 Shri Benjamin Arthur Gilman PV USA Public Affairs
5 Shri Amjad Ali Khan PV DEL Art
6 Shri Zubin Mehta PV USA Art
7 Shri Hrishikesh Mukherjee PV MAH Art
8 Shri Kotta Satchidananda Murty PV AP Litt. & Edu.
9 Dr. Chakravarthi Vijayaraghava Narasimhan PV TN Civil Service

10 Shri Hosei Norota PV JPN Public Affairs
11 Dr. Calyampudi Radhakrishna Rao PV USA Science &

12 Prof. Man Mohan Sharma PV MAH Science &
13 Pandit Shiv Kumar Sharma PV MAH Art
14 Shri Viswanathan Anand PB TN Sports
15 Shri Dev Anand PB MAH Art
16 Shri Amitabh Bachchan PB MAH Art
17 Shri Rahul Bajaj PB MAH Trade & Ind.
18 Shri Badrinarayan Ramulal Barwale PB MAH Trade & Ind.
19 Shri Trimbak alias Balasaheb Shivram Bharade PB MAH Social Work

20 Dr. Boyi Bhimanna PB AP Litt. & Edu.
21 Shri Swadesh Chatterjee PB USA Public Affairs
22 Shri Baldev Raj Chopra PB MAH Art
23 Shri Ashok Haribhai Desai PB DEL Public Affairs
24 Dr. Karimpumannil George PB KER Litt. & Edu.
25 Dr. Bhupen Hazarika PB MAH Art
26 Shri Lalgudi Gopalaiyer Jayaraman PB TN Art
27 Dr. (Ms.) Yamini Krishnamurti PB DEL Art
28 Prof. Shiv Kumar Kumar PB AP Litt. & Edu.
29 Shri Raghunath Mohapatra PB OR Art
30 Dr. Arun Netravali PB USA Science &
31 Shri Mohan Singh Oberoi PB DEL Trade & Ind.
32 Dr. Rajendra Kumar Pachauri PB DEL Others
33 Maulana Abdul Karim Parekh PB MAH Social Work
34 Dr.(Kum.) Amrita Patel PB GUJ Trade & Ind.
35 Shri Aroon Purie PB DEL Litt. & Edu.
36 Dr. Bhupathiraju Vissam Raju PB AP Trade & Ind.
37 Dr.(Smt.) Paluvai Bhanumathi Ramakrishna PB TN Art
38 Shri Sundaram Ramakrishnan PB MAH Social Work
39 Dr. Chitranjan Singh Ranawat PB USA Medicine
40 Dr. Palle Rama Rao PB AP Science &
41 Dr. Raj Reddy PB USA Science &
42 Ms. Uma Sharma PB DEL Art
43 Shri Pran Sikand PB MAH Art
44 Dr. Lakshminarayana Subramaniam PB KAR Art
45 Dr. Naresh Kumar Trehan PB DEL Medicine
46 Shri Khalid Abdul Hamid Ansari PS MAH Litt. & Edu.
47 Prof. Bala V. Balachandran PS USA Litt. & Edu.
48 Shri Sripathi Panditharadhyula Balasubrahmanyam PS TN Art

49 Dr. Jyoti Bhushan Banerji PS UP Medicine
50 Smt. Jeelani Bano PS AP Litt. & Edu.
51 Dr. Sandip Kumar Basu PS DEL Science &
52 Shri Bisweswar Bhattacharjee PS MAH Science &
53 Shri Mahesh Bhupathi PS KAR Sports
54 Shri Vijay Kumar Chaturvedi PS MAH Science &
55 Shri Manoj Das PS PUD Litt. & Edu.
56 Prof. Dr. Alaka Keshav Deshpande PS MAH Medicine
57 Dr. Sharadkumar Dicksheet PS USA Medicine
58 Dr. (Ms.) Ketayun Ardeshir Dinshaw PS MAH Science &
59 Dr. Prem Shanker Goel PS KAR Science &
60 Dr. Chittoor Mohammed Habeebullah PS AP Medicine
61 Ms. Malathi Krishnamurthy Holla PS KAR Sports
62 Shri Aamir Raza Husain PS DEL Art
63 Dr. Devegowda Javaregowda PS KAR Litt. & Edu.
64 Smt. Padmaja Phenany Joglekar PS MAH Art
65 Dr. Chandrasekhara Basavanneppa Kambar PS KAR Litt. & Edu.

66 Dr. S.T. Gnanananda Kavi PS AP Litt. & Edu.
67 Shri Keshavkumar Chintaman Ketkar PS MAH Litt. & Edu.

68 Shri Mohammed Tayab Khan PS RAJ Art
69 Dr. Sunil Manilal Kothari PS DEL Art
70 Dr. Ravindra Kumar PS UP Litt. & Edu.
71 Ms. Bhuvneshwari Kumari PS DEL Sports
72 Dr. Mool Chand Maheshwari PS DEL Medicine
73 Prof. Goverdhan Mehta PS KAR Science &
74 Shri Viswanathan Mohanlal PS TN Art
75 Ms. Tulasi Munda PS OR Social Work
76 Smt. Sobha Naidu PS AP Art
77 Dr. Madhavan Krishnan Nair PS KER Medicine
78 Dr. Chandrathil Gouri Krishnadas Nair PS KAR Science &

79 Shri Leander Adrian Paes PS WB Sports
80 Shri Kandathil Mammen Philip PS MAH Trade & Ind.
81 Shri Dhanraj Pillay PS MAH Sports
82 Dr. Madabusi Santanam Raghunathan PS MAH Science &
83 Dr. Sanjaya Rajaram PS MXC Science &
84 Shri Daatla Venkata Suryanarayana Raju PS AP Art

85 Prof. Tiruppattur Venkatachalamurti Ramakrishnan PS KAR Science &

86 Dr. Avadhanam Sita Raman PS TN Art
87 Dr. Thirumalachari Ramasami PS TN Science &
88 Shri Mohan Ranade PS MAH Public Affairs
89 Ms. Sunita Rani PS PUN Sports
90 Dr. Dasika Durga Prasada Rao PS AP Science &
91 Dr. Siramdasu Venkata Rama Rao PS AP Art

92 Dr. Dasari Prasada Rao PS AP Medicine
93 Dr. Paul Ratnasamy PS MAH Science &
94 Dr. Kallam Anji Reddy PS AP Trade & Ind.
95 Shri Kalidas Gupta Riza (Expired) PS MAH Litt. & Edu.
96 Smt. Padma Sachdev PS DEL Litt. & Edu.
97 Dr. Bhabendra Nath Saikia PS ASM Litt. & Edu.
98 Prof. Ashoke Sen PS UP Science &
99 Dr.(Smt.) Gouri Sen PS DEL Medicine
100 Prof. Mohammad Shafi PS UP Science &
101 Shri Laishram Nabakishore Singh PS MAN Medicine
102 Prof. Bikash Chandra Sinha PS WB Science &
103 Dr.(Prof.) Bhupathiraju Somaraju PS AP Medicine
104 Shri Elattuvalapil Sreedharan PS DEL Civil Service
105 Prof. Suhas Pandurang Sukhatme PS MAH Science &
106 Shri Thota Tharani PS TN Art
107 Bishop Mullanakuzhiyil Abraham Thomas PS RAJ Social Work

108 Shri Vachnesh Tripathi PS UP Litt. & Edu.
109 Dr. Krishna Prasad Singh Varma PS DEL Medicine
110 Dr. Nerella Venumadhav PS AP Art
111 Lt.Gen.(Rt Mohammad Ahmad Zaki PS AP Civil Service
2002
1 Smt. Kishori Ravindra Amonkar PV MAH Art
2 Dr.(Smt.) Gangubai Hangal PV KAR Art
3 Pandit Kishan Maharaj PV UP Art
4 Dr. Chakravarthi Rangarajan PV AP Litt. & Edu.
5 Shri Soli Jehangir Sorabjee PV DEL Public Affairs
6 Congressm Gary Ackerman PB USA Public Affairs
7 Major Hari Pal Singh Ahluwalia PB DEL Social Work
8 Dr. Prabha Atre PB MAH Art
9 Prof. Sushantha Kumar Bhattacharya PB UK Public Affairs
10 Shri Chandrakant Gulabrao Borde PB MAH Sports
11 Shri Yevgeni Petrovich Chelyshev PB RUS Litt. & Edu.
12 Shri Pravinchandra Varjivan Gandhi PB MAH Trade & Ind.
13 Smt. Shobha V. Gurtu PB MAH Art
14 Shri Zakir Hussain PB MAH Art
15 Shri Bellur Krishnamachar Sundara Raja Iyengar PB MAH Litt. & Edu.

16 Shri Faquir Chand Kohli PB MAH Science &
17 Prof. Vangalampalayam Chellappagounder Kulandaiswamy PB TN Science &

18 Shri Henning Holck Larsen PB MAH Trade & Ind.
19 Shri Guri Ivanovich Marchuk PB RUS Science &
20 Shri Jagat Singh Mehta PB RAJ Civil Service
21 Shri Ismail Merchant PB MAH Art
22 Shri Mario De Miranda PB GOA Litt. & Edu.
23 Congressm Frank Pallone PB USA Public Affairs
24 Shri Ramanujam Varatharaja Perumal PB KER Science &

25 Prof. Natesan Rangabashyam PB TN Medicine
26 Shri Maharajakrishna Rasgotra PB DEL Civil Service
27 Shri Habib Ahmed Khan Tanvir PB MP Art
28 Shri Kottayan Katankot Venugopal PB DEL Public Affairs
29 Shri Nirmal Verma PB DEL Litt. & Edu.
30 Shri Kattassery Joseph Yesudas PB TN Art
31 Dr. Suresh Hariram Advani PS MAH Medicine
32 Smt. Norma Alvares PS GOA Social Work
33 Shri Wannakuwattawaduge Don Amardeva PS SL Art

34 Dr. Prakash Murlidhar Amte PS MAH Social Work
35 Dr. Munirathna Anandakrishnan PS TN Litt. & Edu.
36 Dr. Anand Swarup Arya PS UTTR Science &
37 Prof. Narayanaswamy Balakrishnan PS KAR Science &
38 Prof. Padmanabhan Balaram PS KAR Science &
39 Prof. Dorairajan Balasubramanian PS AP Science &
40 Smt. Raj Begum PS J&K Art
41 Pandit Vishwa Mohan Bhatt PS RAJ Art
42 Smt. Pushpa Bhuyan PS ASM Art
43 Shri Viresh Pratap Chaudhry PS DEL Public Affairs
44 Shri Gopal Chhotray PS DEL Litt. & Edu.
45 Dr. Pradeep Kumar Chowbey PS DEL Medicine
46 Prof. Ramanath Cowsik PS KAR Science &
47 Prof. Vijay Kumar Dada PS DEL Medicine
48 Shri Rajan Devadas PS USA Art
49 Ms. Diana Fram Edulji PS MAH Sports
50 Dr. Chaitanyamoy Ganguly PS AP Science &
51 Dr. Kota Harinarayana PS KAR Science &
52 Shri Muzaffer Hussain PS MAH Litt. & Edu.
53 Shri Gyan Chand Jain PS DEL Litt. & Edu.
54 Ms. Darshana Navnitlal Jhaveri PS MAH Art
55 Dr. Ashok Jhunjhunwala PS TN Science &
56 Shri Hirebettu Sadananda Kamath PS MAH Science &
57 Shri Madhu Mangesh Karnik PS MAH Litt. & Edu.
58 Dr. Ashok Ramchandra Kelkar PS MAH Litt. & Edu.
59 Ustad Abdul Latif Khan PS MP Art
60 Dr. Prakash Nanalal Kothari PS MAH Medicine
61 Smt. Mani Krishnaswami PS TN Art
62 Shri Veettikat Kunduthodiyil Kutty Madhvan PS HRY Litt. & Edu.

63 Dr. Hrashel Sawi Luaia PS MIZ Social Work
64 Dr. Harsh Mahajan PS DEL Medicine
65 Prof. Amitav Mallik PS DEL Science &
66 Smt. Manorama PS TN Art
67 Dr. Kiran Martin PS DEL Social Work
68 Dr. Vikram Marwaha PS MAH Medicine
69 Shri Fazal Mohammad PS UP Art
70 Shri Taro Nakayama PS JPN Public Affairs
71 Shri Katuru Narayana PS AP Science &
72 Dr. Atluri Sriman Narayana PS AP Medicine
73 Shri Govind Nihalani PS MAH Art
74 Dr. Kamaljit Singh Paul PS USA Medicine
75 Dr. Apathukatha Sivathanu Pillai PS DEL Science &
76 Smt. Prema Narendra Purao PS MAH Social Work
77 Dr. Satish Chandra Rai PS UP Public Affairs
78 Dr. Sivananda Rajaram PS TN Social Work
79 Dr. Karimpat Mathangi Ramakrishnan PS TN Medicine
80 Shri Jaspal Rana PS DEL Sports
81 Dr. Gullapalli Nageswara Rao PS AP Medicine
82 Dr. Idupuganti Venkata Subba Rao PS AP Science &

83 Dr. Turlapaty Kutumba Rao PS AP Litt. & Edu.
84 Shri Mani Ratnam PS TN Art
85 Dr. Duvvur Nageshwar Reddy PS AP Medicine
86 Ms. Kiran Segal PS DEL Art
87 Shri Navaneetham Padmanabha Seshadri PS DEL Art

88 Dr. Prahlad Kumar Sethi PS DEL Medicine
89 Shri Virendra Kumar Sharma PS MAH Science &
90 Dr. Kim Yang Shik PS SKOR Litt. & Edu.
91 Dr. Byrana Nagappa Suresh PS KER Science &
92 Shri Phillips Talbot PS USA Public Affairs
93 Mrs. Saroja Vaidyanathan PS DEL Art
94 Shri Dimitris C. Velissaropoulos PS GRCE Litt. & Edu.
95 Shri Thettagudi Hariharasarma Vinayakram PS TN Art

2003
1 Shri Kazi Lhendup Dorji Kangsarpa PV WB Public Affairs
2 Smt. Sonal Mansingh PV DEL Art
3 Shri Bal Ram Nanda PV DEL Litt. & Edu.
4 Vaidya Bhrihaspati Dev Triguna PV DEL Medicine
5 Smt. Teejan Bai PB CHHT Art
6 Shri Ammannur Madhava Chakyar PB KER Art
7 Shri Prabhu Dayal Chawla PB DEL Others
8 Shri Herbert Paul Fischer PB GER Public Affairs
9 Shri Jamshyd Naoroji Godrej PB MAH Trade & Ind.
10 Shri Coluthur Gopalan PB DEL Medicine
11 Shri Parasaran Kesava Iyengar PB DEL Public Affairs
12 Shri Balasubramania Rajam Iyer PB TN Art
13 Prof. Shri Krishna Joshi PB HRY Science &
14 Shri Madurai Narayanan Krishnan PB TN Art
15 Dr. Ramesh Kumar PB DEL Medicine
16 Prof. Rajinder Kumar PB KAR Science &
17 Dr. Purshotam Lal PB UP Medicine
18 Dr. Sitakant Mahapatra PB OR Litt. & Edu.
19 Prof. Bagicha Singh Minhas PB DEL Science &
20 Shri Subhas Mukhopadhyay PB WB Litt. & Edu.
21 Shri Puliyur Subramaniam Narayanaswamy PB TN Art
22 Shri Trichur Vaidyanatha Ramachandran PB TN Art
23 Dr. Arcot Ramachandran PB KAR Science &
24 Dr. Kantilal Hastimal Sancheti PB MAH Medicine
25 Shri Tiruvalangadu Vembu Iyer Sankaranarayanan PB TN Art

26 Shri Naseeruddin Shah PB MAH Art
27 Shri Thaliyadiparambil Vittappa Ramachandra Shenoy PB DEL Others

28 Shri Jagjit Singh PB MAH Art
29 Prof. Ram Badan Singh PB DEL Science &
30 Shri Hari Shankar Singhania PB DEL Trade & Ind.
31 Shri Umayalpuram Kasiviswanatha Sivaraman PB TN Art

32 Shri Narayanan Srinivasan PB TN Science &
33 Dr.(Kum.) Padma Subrahmanyam PB TN Art
34 Smt. Swapnasundari PB DEL Art
35 Shri Ottupulakkal Velukkuty Vijayan PB KER Litt. & Edu.
36 Dr. Herbert Yefremov PB RUS Science &
37 Shri Manzoor Ahtesham PS MP Litt. & Edu.
38 Prof. Ram Gopal Bajaj PS AP Art
39 Shri Jahnu Barua PS ASM Litt. & Edu.
40 Prof. Asok Kumar Barua PS WB Science &
41 Shri Shivram Baburao Bhoje PS MAH Science &
42 Dr. Jagdish Chaturvedi PS DEL Litt. & Edu.
43 Shri Nalli Kuppuswami Chettiar PS TN Trade & Ind.
44 Dr. Jai Bhagwan Chowdhury PS HRY Science &
45 Shri Danny Denzongpa PS MAH Art
46 Smt. Kshetrimayum Ongbi Thouranisabi Devi PS MAN Art

47 Dr. Francis Dore PS FRA Public Affairs
48 Prof.(Smt. Rita Ganguly PS DEL Art
49 Ms. Ranjana Gauhar PS DEL Art
50 Shri Sadashiv Vasantrao Gorakshkar PS MAH Art
51 Prof Jagdev Singh Guleria PS DEL Medicine
52 Smt. Rakhee Gulzar PS MAH Art
53 Smt. Verna Elizabeth Ingty PS MEG Social Work
54 Shri Pratapsinh Jadhav PS MAH Others
55 Shri Nemichandra Jain PS DEL Art
56 ` Om Prakash Jain PS DEL Art
57 Dr. Motilal Jotwani PS DEL Litt. & Edu.
58 Dr. Sarvagya Singh Katiyar PS UP Science &
59 Shri Vadiraj Raghavendra Katti PS KAR Science &
60 Shri Aamir Khan PS MAH Art
61 Ustad Shafaat Ahmed Khan PS DEL Art
62 Prof. Narayana Panicker Kochupillai PS DEL Medicine
63 Shri Nandanoori Mukesh Kumar PS AP Sports
64 Dr. Chawngthu Lalhmingliana PS MIZ Social Work
65 Prof. Neelakanta Ramakrishna Menon PS WB Public Affairs

66 Dr. Gyan Chandra Mishra PS MAH Science &
67 Prof. Gopal Chandra Mitra PS OR Science &
68 Dr. Jai Pal Mittal PS MAH Science &
69 Shri Manthiram Natarajan PS DEL Science &
70 Shri Nokdenlemba PS NAG Litt. & Edu.
71 Shri Gopal Purushottam Phadke PS MAH Sports
72 Shri Kanhaya Lal Pokhriyal PS UTTR Sports
73 Dr. Yarlagadda Lakshmi Prasad PS AP Litt. & Edu.
74 Shri Sundaram Ramakrishnan PS KER Science &
75 Ms. Malavika Sarukkai PS TN Art
76 Smt. Sukumari Sathyabhama PS TN Art
77 Dr. Ashok Seth PS DEL Medicine
78 Shri Tekkatte Narayan Shanbhag PS MAH Litt. & Edu.
79 Baburao Govindrao Shirke PS MAH Science &
80 Shri Shailendra Nath Shrivastava PS BIH Litt. & Edu.
81 Ms. Jyotirmoyee Sikdar PS WB Sports
82 Dr. Pritam Singh PS UP Litt. & Edu.
83 Dr. Vijay Prakash Singh PS BIH Medicine
84 Shri Mahendra Singh Sodha PS UP Science &
85 Shri Thoguluva Meenakshi Iyengar Sounderarajan PS TN Art

86 Dr. Rajagopalan Krishnan Vaidian PS KER Medicine
87 Shri Ramasamy Vairamuthu PS TN Litt. & Edu.
88 Shri Nagarajan Vedachalam PS KER Science &
89 Shri Srinivas Venkataraghavan PS TN Sports
90 Pandit Satish Chintaman Vyas PS MAH Art
91 Shri Kishorebhai Ratilal Zaveri PS DEL Social Work
2004
1 Prof. Jayant Vishnu Narlikar PV MAH Science &
2 Ms. Amrita Pritam PV DEL Litt. & Edu.
3 Justice Manepalli Narayana Rao Venkatachaliah PV KAR Public Affairs

4 Shri Thoppil Varghese Antony PB TN Civil Service
5 Shri Soumitra Chatterjee PB WB Art
6 Justice Chandrashekhar Shankar Dharmadhikari PB MAH Public Affairs

7 Shri Gulzar PB MAH Art
8 Prof. Sardara Singh Johl PB PUN Science &
9 Shri Madhav Vittal Kamath PB MAH Litt. & Edu.
10 Late Shri Komal Kothari PB RAJ Art
11 Shri Yoshiro Mori PB JPN Public Affairs
12 Prof. Gopi Chand Narang PB DEL Litt. & Edu.
13 Prof. Govindarajan Padmanaban PB KAR Science &
14 Smt. Poornima Arvind Pakvasa PB GUJ Social Work
15 Shri Vishnu Prabhakar PB DEL Litt. & Edu.
16 Dr. (Smt.) N. Rajam PB UP Art
17 Dr. (Prof.) Chennamaneni Hanumantha Rao PB AP Litt. & Edu.

18 Shri Thiruvengadam Lakshman Sankar PB AP Civil Service

19 Shri Madurai Thirumalai Nambi Seshagopalan PB TN Art

20 Dr. Bijoy Nandan Shahi PB DEL Medicine
21 Dr. Krishna Srinivas PB TN Litt. & Edu.
22 Smt. Alarmel Valli PB TN Art
23 Kum. Meher Jehangir Banaji PS MAH Social Work
24 Ms. K. M. Beenamol PS KER Sports
25 Dr. Arun Trimbak Dabke PS CHHT Medicine
26 Smt. Sharayu Daftary PS MAH Trade & Ind.
27 Shri Manoranjan Das PS OR Art
28 Shri Maguni Charan Das PS OR Art
29 Pt. Damodar Keshav Datar PS MAH Art
30 Dr. Kumarpal Desai PS GUJ Litt. & Edu.
31 Smt. Gurumayum Anita Devi PS MAN Sports
32 Shri Nampally Divakar PS AP Science &
33 Shri Rahul Dravid PS KAR Sports
34 Dr.(Smt.) Tatyana Yakovlevna Elizarenkova PS RUS Litt. & Edu.
35 Shri Sourav Ganguly PS WB Sports
36 Smt. Anju Bobby George PS KER Sports
37 Shri Kadri Gopalnath PS KAR Art
38 Prof. Anil Kumar Gupta PS GUJ Litt. & Edu.
39 Dr. Sharad Moreshwar Hardikar PS MAH Medicine
40 Shri A. Hariharan PS MAH Art
41 Dr. Syed Shah Mohammed Hussaini PS KAR Litt. & Edu.
42 Ms. Flora Isabel MacDonald PS CAN Public Affairs
43 Smt. Gowri Ishwaran PS DEL Litt. & Edu.
44 Shri Leeladhar Jagoodi PS UTTR Litt. & Edu.
45 Prof.(Smt. Sunita Jain PS DEL Litt. & Edu.
46 Shri Purshottam Das Jalota PS MAH Art
47 Shri Krishn Kanhai PS UP Art
48 Shri Heisnam Kanhailal PS MAN Art
49 Prof. Prithvi Nath Kaula PS UP Litt. & Edu.
50 Shri Satish Kumar Kaura PS DEL Science &
51 Shri Anupam P. Kher PS MAH Art
52 Smt. Sikkil Venkatraman Kunjumani PS TN Art
53 Dr. Subhash Chander Manchanda PS DEL Medicine
54 Dr. Siddhartha Mehta PS DEL Medicine
55 Dr. Ashwin Balachand Mehta PS MAH Medicine
56 Shri Nalini Ranjan Mohanty PS KAR Science &
57 Shri Batchu Lutchmiah Srinivasa Murthy PS KAR Social Work

58 Guru Keezhpadam Kumaran Nair PS KER Art
59 Shri Morup Namgial PS J&K Art
60 Smt. Sikkil Natesan Neela PS TN Art
61 Prof. Hamlet Bareh Ngapkynta PS MEG Litt. & Edu.
62 Shri Aubakir Dastanuly Nilibayev PS KZKH Litt. & Edu.
63 Yogacharya Sadashiv Prahlad Nimbalkar PS MAH Sports
64 Shri Haridwaramangalam A. Kumarvel Palanivel PS TN Art

65 Dr. Shyam Narain Panday PS UP Litt. & Edu.
66 Prof. Kesava Paniker Ayyappa Paniker PS KER Litt. & Edu.

67 Shri P. Parameswaran PS KER Litt. & Edu.
68 Shri Kantibhai Baldevbhai Patel PS GUJ Art
69 Dr. Samuel Paul PS KAR Litt. & Edu.
70 Dr. Tumkur Seetharamiah Prahlad PS KAR Science &
71 Dr. Vishweshwaraiah Prakash PS KAR Science &
72 Ms. Premlata Puri PS DEL Litt. & Edu.
73 Smt. Sudha Raghunathan PS TN Art
74 Shri Bharathi Rajaa PS TN Art
75 Guru Shri Veeranala Jayarama Rao PS DEL Art
76 Smt. Queenie Rynjah PS MEG Social Work
77 Dr. Surinder Kumar Sama PS DEL Medicine
78 Shri Bal Gangadhar Samant PS MAH Litt. & Edu.
79 Prof. (Dr.) Rajan Saxena PS UP Medicine
80 Shri Kanhaiyalal Sethia PS WB Litt. & Edu.
81 Dr. Ramesh Chandra Shah PS MP Litt. & Edu.
82 Dr. Kudli Nanjunda Ghanapathi Shankara PS GUJ Science &

83 Dr. Devi Prasad Shetty PS KAR Medicine
84 Smt. Bharati Shivaji PS DEL Art
85 Dr. Lalji Singh PS AP Science &
86 Pandit Surinder Singh PS DEL Art
87 Dr. Gopal Prasad Sinha PS BIH Medicine
88 Prof. Rajpal Singh Sirohi PS DEL Science &
89 Pandit Bhajan Sopori PS DEL Art
90 Prof.(Dr.) Heinrich Freiherr Von Stietencron PS GER Litt. & Edu.
91 Shri Sudhir Tailang PS DEL Litt. & Edu.
92 Shri Dilip Kumar Tirkey PS OR Sports
93 Dr.(Smt.) Dalip Kaur Tiwana PS PUN Litt. & Edu.
94 Shri Neyyattinkara Vasudevan PS KER Art
95 Prof. Mamannamana Vijayan PS KAR Science &
96 Prof. Asifa Zamani PS UP Litt. & Edu.
2005
1 Shri Milon Kumar Banerji PV DEL Public Affairs
2 Dr. Mohan Dharia PV MAH Social Work
3 Shri Jyotindra Nath Dixit PV DEL Civil Service
4 Dr. Bal Krishna Goyal PV MAH Medicine
5 Shri Rasipuram Krishnaswamy Laxman PV MAH Art

6 Pandit Ram Narayan PV MAH Art
7 Dr. Karan Singh PV DEL Public Affairs
8 Prof. Marthanda Varma Sankaran Valiathan PV KAR Medicine

9 Dr. Sardar 'Anjum' PB HRY Litt. & Edu.
10 Dr. Andre Beteille PB DEL Litt. & Edu.
11 Shri Chandi Prasad Bhatt PB UTTR Others
12 Shri Tumkur Ramaiya Satish Chandran PB KAR Civil Service
13 Dr. Mrinal Datta Chaudhuri PB DEL Litt. & Edu.
14 Dr. Yash Raj Chopra PB MAH Art
15 Shri Probodh Chandra Manna Dey PB KAR Art

16 Prof. Irfan Habib PB UP Litt. & Edu.
17 Dr. Yusuf Khwaja Hamied PB MAH Medicine
18 Prof. (Ms.) Qurratulain Hyder PB UP Litt. & Edu.
19 Dr. Tarlochan Singh Kler PB DEL Medicine
20 Dr. Anil Kohli PB DEL Medicine
21 Prof. Mrinal Miri PB MEG Litt. & Edu.
22 Dr. Hari Mohan PB DEL Medicine
23 Dr. Brijmohan Lall Munjal PB DEL Trade & Ind.
24 Shri Madath Thekepat Vasudevan Nair PB KER Litt. & Edu.

25 Shri Azim Premji PB KAR Trade & Ind.
26 Shri Balraj Puri PB J&K Litt. & Edu.
27 Shri Syed Mir Qasim PB DEL Public Affairs
28 Prof. A. Ramachandran PB DEL Art
29 Shri Gopichettipalayam Venkataramana Iyer Ramakrishna PB TN Civil Service

30 Prof. Valangiman Subramanian Ramamurthy PB DEL Science &

31 Shri Koduru Iswara Varaprasad Reddy PB AP Science &

32 Prof. Kolli Srinath Reddy PB DEL Medicine
33 Shri Girish Chandra Saxena PB DEL Civil Service
34 Dr. Narasimhiah Seshagiri PB KAR Science &
35 Dr.(Smt.) Kiran Mazumdar Shaw PB KAR Science &
36 Shri William Mark Tully PB DEL Litt. & Edu.
37 Shri Muzaffar Ali PS DEL Art
38 Smt. Shameem Dev Azad PS DEL Art
39 Prof. Amiya Kumar Bagchi PS WB Litt. & Edu.
40 Dr. Govindaswamy Bakthavathsalam PS TN Medicine
41 Dr. Dipankar Banerjee PS DEL Science &
42 Dr. Srikumar Banerjee PS MAH Science &
43 Kum. Hema Bharali PS ASM Social Work
44 Smt. Shobhana Bhartia PS DEL Litt. & Edu.
45 Shri Manuel Santana Aguiar alias M. Boyer PS GOA Art

46 Shri Manas Chaudhuri PS MEG Litt. & Edu.
47 Smt. Krishnan Nair Santhakumari Chithra PS TN Art

48 Shri Banwari Lal Chouksey PS MP Science &
49 Shri Nana M. Chudasama PS MAH Social Work
50 Prof. Darchhawna PS MIZ Litt. & Edu.
51 Prof. Bhagavatula Dattaguru PS KAR Science &
52 Smt. Yumlembam Devi PS MAN Art
53 Shri Vasudevan Gnana Gandhi PS KER Science &
54 Shri Pullela Gopi Chand PS AP Sports
55 Prof. Jagtar Singh Grewal PS CHA Litt. & Edu.
56 Dr. Jitendra Mohan Hans PS DEL Medicine
57 Ms. Indira Jaising PS DEL Public Affairs
58 Shri Amin Kamil PS J&K Litt. & Edu.
59 Prof. Madhu Sudan Kanungo PS UP Science &
60 Shri Shah Rukh Khan PS MAH Art
61 Ustad Ghulam Sadiq Khan PS DEL Art
62 Shri Anil Kumble PS KAR Sports
63 Dr. Paneenazhikath Narayana Vasudeva Kurup PS DEL Medicine

64 Rev. (Dr.) Lalsawma PS MIZ Social Work
65 Shri Gadul Singh Lama (Sanu Lama) PS SIK Litt. & Edu.
66 Dr. Narendra Nath Lavu PS AP Medicine
67 Prof. Madappa Mahadevappa PS KAR Science &
68 Shri Mammen Mathew PS KER Litt. & Edu.
69 Shri Chaturbhuj Meher PS OR Art
70 Dr. Veer Singh Mehta PS DEL Medicine
71 Smt. Kumkum Mohanty PS OR Art
72 Dr. Shantaram Balwant Mujumdar PS MAH Litt. & Edu.
73 Ms. Sunita Narain PS DEL Others
74 Shri Punaram Nishad PS CHHT Art
75 Ms. Mehrunnisa Parvez PS MP Litt. & Edu.
76 Smt. Theilin Phanbuh PS MEG Social Work
77 Dr. Cyrus Soli Poonawalla PS MAH Medicine
78 Shri Gurbachan Singh Randhawa PS DEL Sports
79 Lt. Col. Rajyavardhan Singh Rathore PS DEL Sports
80 Shri K.C. Reddy PS KAR Science &
81 Shri Sushil Sahai PS UP Science &
82 Guru Kedar Nath Sahoo PS JKND Art
83 Raasachary Swami Ram Swaroop Sharma PS UP Art
84 Shri Sougaijam Thanil Singh PS MAN Art
85 Smt. Gladys June Staines PS AUS Social Work
86 Smt. Kavita Krishnamurti Subramaniam PS KAR Art
87 Ms. Rachel Thomas PS DEL Sports
88 Shri Kunnakudi Ramaswami Sastri Vaidyanathan PS TN Art

89 Smt. Komala Varadan PS DEL Art
90 Shri Bilat Paswan Vihangam PS BIH Litt. & Edu.
91 Shri Puran Chand Wadali PS PUN Art
2006
1 Dr. Norman E. Borlaug PV MXC Science &
2 Shri Charles Correa PV MAH Science &
3 Dr.(Ms.) Nirmala Deshpande PV DEL Social Work
4 Smt. Mahasweta Devi PV WB Litt. & Edu.
5 Shri Adoor Gopalakrishnan PV KER Art
6 Justice Visheshwar Nath Khare PV UP Public Affairs
7 Shri Colathur Rama Krishnaswamy Rao Sahib PV TN Civil Service

8 Prof. Obaid Siddiqi PV KAR Science &
9 Prof. Prakash Narain Tandon PV DEL Medicine
10 Dr. Jaiveer Agarwal PB TN Medicine
11 Shri Puthenveetil Sankar Nair Appu PB KAR Civil Service

12 Shri Shashi Bhushan PB DEL Public Affairs
13 Shri Ganga Prasad Birla PB WB Social Work
14 Mr. Gregory Bongard-Levin PB RUS Litt. & Edu.
15 Prof.(Dr.) Lokesh Chandra PB DEL Litt. & Edu.
16 Shri Konidala Chiranjeevi PB AP Art
17 Dr.(Smt.) Dineshnandini Dalmia PB DEL Litt. & Edu.
18 Shri Tarun Das PB HRY Trade & Ind.
19 Prof. Madhav Gadgil PB MAH Science &
20 Shri A.K. Hangal PB MAH Art
21 Smt. Devaki Jain PB KAR Social Work
22 Shri Kamleshwar PB HRY Litt. & Edu.
23 Ustad Ghulam Mustafa Khan PB MAH Art
24 Ustad Sabri Khan PB DEL Art
25 Ustad Abdul Halim Jaffer Khan PB MAH Art
26 Dr.(Smt.) Shanno Khurana PB DEL Art
27 Late Dr. Gunter Kruger PB MAH Trade & Ind.
28 Late Porayath Leela PB TN Art
29 Shri Kunnath Puthiyaveetil Nambiar PB KAR Science &

30 Shri Nandan Mohan Nilekani PB KAR Science &
31 Ms. Sai Paranjpye PB MAH Art
32 Shri Deepak S. Parekh PB MAH Trade & Ind.
33 Prof. Moolamattom Varkey Pylee PB KER Litt. & Edu.
34 Shri Subramanian Ramadorai PB MAH Trade & Ind.
35 Prof. Natuvilmatom Srinivasan Ramaswamy PB KAR Social Work

36 Shri Pavani Parmeswara Rao PB UP Public Affairs
37 Shri Ramakanta Rath PB OR Litt. & Edu.
38 Dr.(Ms.) V. Shanta PB TN Medicine
39 Shri Hira Lall Sibal PB CHA Public Affairs
40 Air Com. Jasjit Singh PB HRY Others
41 Shri Arjan Singh PB UP Others
42 Dr. Vijaypat Singhania PB MAH Sports
43 Prof. Kalapathi Ganapathi Subramanyan PB GUJ Art
44 Dr. Kewal Krishan Talwar PB CHA Medicine
45 Prof. Vijay Shankar Vyas PB RAJ Litt. & Edu.
46 Dr. Dusan Zbavitel PB CZEC Litt. & Edu.
47 Dr. Suwalal Chhaganmal Bafna PS MAH Social Work
48 Dr. Sanjeev Bagai PS DEL Medicine
49 Prof. Ramachandran Balasubramanian PS TN Science &
50 Shri Prithipal Singh Bedi PS DEL Social Work
51 Smt. Madhumita Bisht PS DEL Sports
52 Ms. Shobana Chandrakumar PS TN Art
53 Shri Jatindra Nath Chaudhry PS DEL Civil Service
54 Dr. D. Chinniah PS KAR Medicine
55 Dr.(Ms.) Ileana Citaristi PS OR Art
56 Smt. Ajeet Cour PS DEL Litt. & Edu.
57 Ms. Sucheta Dalal PS MAH Litt. & Edu.
58 Shri Mahmood Dhaulpuri PS DEL Art
59 Shri Mohan Singh Gunjyal PS ARP Sports
60 Prof. (Dr.) Harsh Kumar Gupta PS AP Science &
61 Swami Harigovind PS UP Art
62 Prof. Seyed E. Hasnain PS AP Science &
63 Smt. Shahnaz Husain PS DEL Trade & Ind.
64 Shri Shree Lal Joshi PS RAJ Art
65 Dr. Anil Prakash Joshi PS UTTR Social Work
66 Prof Mohan Kameswaran PS TN Medicine
67 Prof. Upendra Kaul PS DEL Medicine
68 Dr.(Smt.) Surinder Kaur PS HRY Art
69 Ustad Rashid Khan PS WB Art
70 Prof. Laltluangliana Khiangte PS MIZ Litt. & Edu.
71 Smt. Mangte Chungneijang Mary Kom PS MAN Sports

72 Smt. Vasundhara Komkali PS MP Art
73 Shri Suresh Krishna PS TN Trade & Ind.
74 Prof. Narendra Kumar PS KAR Science &
75 Smt. Sugatha Kumari PS KER Litt. & Edu.
76 Dr. (Ms.) Tsering Landol PS J&K Medicine
77 Prof.(Dr.) Lothar Lutze PS GER Litt. & Edu.
78 Sheikh Abdul Rahman Al Mahmoud PS QATR Public Affairs
79 Dr. Yashodhar Mathpal PS UTTR Art
80 Miss Sania Mirza PS AP Sports
81 Dr. Ghanashyam Mishra PS OR Medicine
82 Shri Madhup Mudgal PS DEL Art
83 Dr. Sudha Murty PS KAR Social Work
84 Shri Banbehari Vishnu Nimbkar PS MAH Science &
85 Dr. B. Palaniappan PS TN Medicine
86 Smt. Mrinal Pande PS DEL Litt. & Edu.
87 Shri Kavungal Chathunni Panicker PS KER Art
88 Pandit Shyama Charan Pati PS JKND Art
89 Prof. Syed Zillur Rahman PS UP Medicine
90 Dr. Harbhajan Singh Rissam PS DEL Medicine
91 Shri Rajendra Kumar Saboo PS CHA Social Work
92 Shri Bahadur Singh Sagoo PS PUN Sports
93 Smt. Gayatri Sankaran PS TN Art
94 Shri Prasad Sawkar PS GOA Art
95 Prof.(Dr.) Kamal Kumar Sethi PS DEL Medicine
96 Miss Mahmuda Ahmad Ali Shah PS J&K Litt. & Edu.
97 Shri Aribam Syam Sharma PS MAN Art
98 Dr. S. Sivaram PS MAH Science &
99 Smt. Kanaka Srinivasan PS DEL Art
100 Shri Pankaj Keshubhai Udhas PS MAH Art
101 Prof. Tehemton Erach Udwadia PS MAH Medicine
102 Sister Sudha Varghese PS BIR Social Work
103 Shri Melhupra Vero PS NAG Social Work
104 Prof. Sitanshu Yashaschandra PS GUJ Litt. & Edu.
105 Smt. Fatma Rafiq Zakaria PS MAH Litt. & Edu.
106 Shri Kashmiri Lal Zakir PS CHA Litt. & Edu.
2007
1 Justice Prafulla Chandra Bhagwati PV DEL Public Affairs
2 Shri Naresh Chandra PV DEL Civil Service
3 Dr. Raja Jesudoss Chelliah PV TN Public Affairs
4 Dr. V. Krishnamurthy PV DEL Civil Service
5 Shri Fali Sam Nariman PV DEL Public Affairs
6 Late Prof. Raja Rao PV USA Litt. & Edu.
7 Prof. Balu Sankaran PV DEL Medicine
8 Shri Khushwant Singh PV DEL Litt. & Edu.
9 Prof. Ennackal Chandy George Sudarshan PV USA Science &

10 Shri Narinder Nath Vohra PV HRY Civil Service
11 Shri Javed Akhtar PB MAH Litt. & Edu.
12 Father Gabriel Chiramel C.M.I. PB KER Litt. & Edu.
13 Ms. Ela Gandhi PB SA Public Affairs
14 Dr. Saroj Ghose PB WB Science &
15 Dr. (Smt.) V. Mohini Giri PB DEL Social Work
16 Late Prof. Somnath Hore PB WB Art
17 Dr. Jamshed J. Irani PB MAH Trade & Ind.
18 Dr. Gurcharan Singh Kalkat PB CHA Science &
19 Dr. N. Mahalingam PB TN Trade & Ind.
20 Dr. Prithipal Singh Maini PB DEL Medicine
21 Shri Tyeb Mehta PB MAH Art
22 Pandit Rajan Misra PB DEL Art
23 Pandit Sajan Misra PB DEL Art
24 Shri Sunil Bharti Mittal PB DEL Trade & Ind.
25 Shri Ramankutty Nair PB KER Art
26 Dr. Gopaldas Neeraj PB UP Litt. & Edu.
27 Mrs. Indra K. Nooyi PB USA Trade & Ind.
28 Shri Kavalam Narayana Panikkar PB KER Art
29 Prof. Bhikhu Parekh PB UK Litt. & Edu.
30 Hakim Syed Mohammad Sharfuddin Quadri PB WB Medicine

31 Dr. Vilayanur Subramanian Ramachandran PB USA Science &

32 Prof. Tapan Kumar Raychaudhuri PB UK Litt. & Edu.
33 Shri Syed Haider Raza PB FRA Art
34 Prof. Jeffrey D. Sachs PB USA Litt. & Edu.
35 Late Shri Chandra Prasad Saikia PB ASM Litt. & Edu.
36 Capt. L.Z. Sailo PB MIZ Litt. & Edu.
37 Prof. (Dr.) Shiv Kumar Sarin PB DEL Medicine
38 Prof. Shriram Sharma PB MAH Medicine
39 Dr. (Smt.) Manju Sharma PB DEL Science &
40 Prof. Thirukodikaval Nilakanta Srinivasan PB USA Litt. & Edu.

41 Mr. Osamu Suzuki PB JPN Trade & Ind.
42 Justice K.T. Thomas PB KER Public Affairs
43 Shri Rabinder Gokaldas Ahuja PS MAH Others
44 Dr. Thekkethil Kochandy Alex PS KAR Science &
45 Prof. (Ms.) Temsula Ao PS ASM Litt. & Edu.
46 Dr. M. Mohan Babu PS AP Art
47 Ms. Runa Banerjee PS UP Social Work
48 Dr. Rabi Narayan Bastia PS MAH Science &
49 Prof. Dilip Biswas PS DEL Science &
50 Prof. Ananda Mohan Chakrabarty PS USA Science &
51 Smt. Geeta Chandran PS DEL Art
52 Prof. (Dr.) Harpinder Singh Chawla PS CHA Medicine
53 Smt. Tarla Dalal PS MAH Others
54 Late Shri Ravindra Dayal PS DEL Litt. & Edu.
55 Shri Astad Aderbad Deboo PS MAH Art
56 Shri Vijai Dan Detha PS RAJ Litt. & Edu.
57 Smt. Naorem Ongbi Neelamani Devi PS MAN Art

58 Dr. Bakul Harshadrai Dholakia PS GUJ Litt. & Edu.
59 Shri Remo Fernandes PS GOA Art
60 Shri Amitav Ghosh PS USA Litt. & Edu.
61 Dr.(Ms.) Meenakshi Gopinath PS DEL Litt. & Edu.
62 Shri P. Gopinathan PS KER Art
63 Shri Rajinder Gupta PS PUN Trade & Ind.
64 Shri Sushil Gupta PS DEL Social Work
65 Prof. (Dr.) Narmada Prasad Gupta PS DEL Medicine
66 Dr.(Ms.) Syeda Saiyidain Hameed PS DEL Public Affairs
67 Smt. Pushpa Hans PS DEL Art
68 Prof. Mushirul Hasan PS DEL Litt. & Edu.
69 Prof. (Dr.) Ashok Kumar Hemal PS DEL Medicine
70 Smt. Shanti Hiranand PS DEL Art
71 Kumari Koneru Humpy PS AP Sports
72 Shri Mujtaba Hussain PS AP Litt. & Edu.
73 Smt. Shashikala Jawalkar PS MAH Art
74 Dr. (Smt.) Ananda Shankar Jayant PS AP Art
75 Shri Kiran Sharadchandra Karnik PS DEL Science &
76 Mrs. Naina Lal Kidwai PS MAH Trade & Ind.
77 Dr. Giriraj Kishore PS UP Litt. & Edu.
78 Prof. (Dr.) Atul Kumar PS DEL Medicine
79 Rajmata Goverdan Kumarri PS GUJ Art
80 Shri Sonam Tshering Lepcha PS SIK Art
81 Shri S.Balachandra Menon PS KER Art
82 Prof. (Dr.) Adya Prasad Mishra PS UP Litt. & Edu.
83 Dr. Anoop Misra PS DEL Medicine
84 Sister M. Cyril Mooney PS IRL Social Work
85 Dr. P. Namperumalsamy PS TN Medicine
86 Dr. Manjunath Cholenahally Nanjappa PS KAR Medicine

87 Prof. Mayil Vahanan Natarajan PS TN Medicine
88 Prof. Thanu Padmanabhan PS MAH Science &
89 Prof. Kallipatti Ramasamy Palaniswamy PS TN Medicine
90 Dr. Lalit Pande PS UTTR Others
91 Dr. Mahadev Prasad Pandey PS CHHT Litt. & Edu.
92 Prof. (Dr.) Shekhar Pathak PS UTTR Litt. & Edu.
93 Dr. Yusufkhan Mohamadkhan Pathan PS MAH Litt. & Edu.

94 Shri Lama Thupten Phuntsok PS ARP Social Work
95 Shri S. Dakshinamurthy Pillai PS TN Art
96 Late Prof. Devindra Rahinwal PS UTTR Social Work
97 Dr. Baldev Raj PS TN Science &
98 Dr. (Smt.) Pratibha Ray PS OR Litt. & Edu.
99 Prof. Rybakov Rostislav PS RUS Litt. & Edu.
100 Dr. Mahipal Singh Sachdev PS DEL Medicine
101 Ms. Mira alias Mariam L'vovna Salganik PS RUS Litt. & Edu.

102 Ms. Teesta Setalvad PS MAH Public Affairs
103 Shri Vikram Seth PS UK Litt. & Edu.
104 Shri Thingbaijam Babu Singh PS MAN Art
105 Dr. Balbir Singh PS DEL Medicine
106 Shri Chiranjeev Milkha Singh PS PUN Sports
107 Pandit Gajendra Narayan Singh PS BIH Art
108 Shri Anantharamakrishnan Sivasailam PS TN Trade & Ind.
109 Shri Sonam Skalzang PS J&K Art
110 Prof. Sudhir Kumar Sopory PS HRY Science &
111 Shri Pannuru Sripathy PS AP Art
112 Shri Valayapatti A.R. Subramaniyam PS TN Art
113 Shri Waman Thakre PS MP Art
114 Dr. B. Paul Thaliath PS UP Medicine
115 Smt. P.R. Thilagam PS TN Art
116 Dr. Sheo Bhagwan Tibrewal PS UK Medicine
117 Shri T.S. Rangarajan alias Kavignar Vaalee PS TN Litt. & Edu.

118 Prof. (Dr.) Khadg Singh Valdiya PS KAR Science &
119 Dr. Mohsin Wali PS DEL Medicine
120 Shri Khalid Zaheer PS UTTR Social Work
2008
1 Justice Adarsh Sein Anand PV UP Public Affairs
2 Shri Viswanathan Anand PV TN Sports
3 Dr. (Smt.) Asha Bhosle PV MAH Art
4 Prof. P.N. Dhar PV DEL Public Affairs
5 Late Sir Edmund Hillary PV NZLD Sports
6 Shri Lakshmi Niwas Mittal PV UK Trade & Ind.
7 Shri Pranab Mukherjee PV DEL Public Affairs
8 Shri N.R. Narayana Murthy PV KAR Trade & Ind.
9 Shri P.R.S. Oberoi PV DEL Trade & Ind.
10 Dr. Rajendra Kumar Pachauri PV DEL Science &
11 Dr. E. Sreedharan PV DEL Science &
12 Shri Ratan Naval Tata PV MAH Trade & Ind.
13 Shri Sachin Ramesh Tendulkar PV MAH Sports
14 Mian Bashir Ahmad PB J&K Public Affairs
15 Prof. Kaushik Basu PB USA Litt. & Edu.
16 Dr. (Smt.) Shayama Chona PB DEL Litt. & Edu.
17 Prof. (Dr.) Jagjit Singh Chopra PB CHA Medicine
18 Ustad Rahim Fahimuddin Khan Dagar PB DEL Art

19 Shri Chandrashekhar Dasgupta PB DEL Civil Service
20 Prof. Asis Datta PB DEL Science &
21 Prof. Padma Desai PB USA Litt. & Edu.
22 Prof. Lord Meghnad Jagdishchandra Desai PB UK Public Affairs

23 Prof. (Dr.) Sukh Dev PB DEL Science &
24 Prof. Nirmal Kumar Ganguly PB DEL Medicine
25 Prof. Brijinder Nath Goswamy PB CHA Litt. & Edu.
26 Dr. Vasant Ranchhod Gowariker PB MAH Science &
27 Shri Baba Neelkanth Kalyani PB MAH Trade & Ind.
28 Shri K. Vaman Kamath PB MAH Trade & Ind.
29 Dr. (Ms.) Inderjit Kaur PB PUN Social Work
30 Shri Ravindra Kelekar PB GOA Litt. & Edu.
31 Ustad Asad Ali Khan PB DEL Art
32 Mr. Dominique Lapierre PB FRA Social Work
33 Shri Devendra Raj Mehta PB RAJ Social Work
34 Shri Shiv Nadar PB TN Trade & Ind.
35 Shri Suresh Kumar Neotia PB DEL Trade & Ind.
36 Prof.(Dr.) Tharaileth Koshy Oommen PB HRY Litt. & Edu.
37 Shri Kantipudi Padmanabhaiah PB DEL Civil Service
38 Dr. Vikram Shankar Pandit PB USA Trade & Ind.
39 Shri V. Ramachandran PB KER Civil Service
40 Prof. (Dr.) Sushil Kumar Saxena PB DEL Art
41 Late Shri Amar Nath Sehgal PB DEL Art
42 Shri Shrilal Shukla PB UP Litt. & Edu.
43 Shri Jasdev Singh PB DEL Others
44 Dr. (Smt.) P. Susheela PB TN Art
45 Prof. Srinivasa Varadhan PB USA Litt. & Edu.
46 Late Mr. Yuli M. Vorontsov PB RUS Public Affairs
47 Mrs. Sunita Williams PB USA Others
48 Prof. Ji Xianlin PB CHI Litt. & Edu.
49 Dr. B. Sivanthi Adityan PS TN Litt. & Edu.
50 Prof. Bina Agarwal PS DEL Litt. & Edu.
51 Dr. Kailash Chandra Agrawal 'Manav' PS RAJ Social Work
52 Prof. K.S. Nisar Ahmed PS KAR Litt. & Edu.
53 Shri Yusuff Ali M.A. PS UAE Social Work
54 Shri Tom Alter PS MAH Art
55 Dr. Vellayani Arjunan PS KER Litt. & Edu.
56 Prof. (Dr.) Shyam Narayan Arya PS BIH Medicine
57 Dr. (Smt.) Sheela Barthakur PS ASM Social Work
58 Dr. Nirupam Bhajpai PS USA Litt. & Edu.
59 Prof. (Dr.) Dinesh Kumar Bhargava PS DEL Medicine
60 Shri Bhaichung Bhutia PS SIK Sports
61 Kumari Karuna Mary Braganza PS MAH Social Work
62 Smt. Bula Chowdhury Chakraborty PS WB Sports
63 Guru Moozhikkulam Kochukuttan Chakyar PS KER Art

64 Shri Jonnalagadda Gurappa Chetty PS AP Art
65 Dr. Sirkazhi G. Siva Chidambaram PS TN Art
66 Smt. Meenakshi Sabanayagam Chitharanjan PS TN Art

67 Prof. (Dr.) Kasturi Lal Chopra PS DEL Science &
68 Smt. Madhuri Dixit Nene PS MAH Art
69 Shri Vinod Dua PS DEL Litt. & Edu.
70 Ms. Barkha Dutt PS DEL Litt. & Edu.
71 Dr. Simon Tony Fernandez PS KER Medicine
72 Shri Kekoo M. Gandhy PS MAH Art
73 Dr. (Smt.) Helen Giri PS MEG Art
74 Shri Jatin Goswami PS ASM Art
75 Shri Vellur Ramachandra Gowrishankar PS KAR Social Work
76 Shri Hans Raj Hans PS PUN Art
77 Shri Surjya Kanta Hazarika PS ASM Litt. & Edu.
78 Prof. Joseph H. Hulse PS CAN Science &
79 Shri Bhavarlal Hiralal Jain PS MAH Science &
80 Dr. Rakesh Kumar Jain PS UTTR Medicine
81 Dr. Raman Kapur PS DEL Medicine
82 Haji Kaleem Ullah Khan PS UP Science &
83 Dr. Tatyarao Pundlikrao Lahane PS MAH Medicine
84 Prof. Dr. M. Leelavathy PS KER Litt. & Edu.
85 Dr. Pandit Gokulotsavji Maharaj PS MP Art
86 Mrs. Colette Mathur PS SWTZ Public Affairs
87 Prof. Amitabh Mattoo PS J&K Litt. & Edu.
88 Dr. Keiki R. Mehta PS MAH Medicine
89 Dr. (Ms.) Kshama Metre PS HIM Social Work
90 Dr. Amit Mitra PS DEL Trade & Ind.
91 Shri Mangala Prasad Mohanty PS JKND Art
92 Prof. Kochampilli Narayanan Nambiar PS KER Art
93 Shri John Martin Nelson PS CHHT Art
94 Prof. Mohan Chandra Pant PS UP Medicine
95 Prof. Bholabhai Patel PS GUJ Litt. & Edu.
96 Pandit Pratap Pawar PS UK Art
97 Mr. Gennadi Mikhailovich Pechnikov PS RUS Art
98 Shri Gangadhar Pradhan PS OR Art
99 Prof. (Dr.) Arjunan Rajasekaran PS TN Medicine
100 Prof. Yella Venkateswara Rao PS AP Art
101 Dr. Kutikuppala Surya Rao PS AP Social Work
102 Dr. (Smt.) Malvika Sabharwal PS DEL Medicine
103 Shri Madan Mohan Sabharwal PS DEL Social Work
104 Smt. Heisnam Sabitri PS MAN Art
105 Shri Vikramjit Singh Sahney PS DEL Social Work
106 Shri Rajdeep Sardesai PS DEL Litt. & Edu.
107 Dr. Deepak Sehgal PS DEL Medicine
108 Mr. Manoj Night Shyamalan PS USA Art
109 Dr. Aheibam Jayanta Kumar Singh PS MAN Medicine

110 Dr. Indu Bhushan Sinha PS BIH Medicine
111 Dr. Randhir Sud PS DEL Medicine
112 Mohammed Yusuf Taing PS J&K Litt. & Edu.
113 Prof. Sukhadeo Kisanrao Thorat PS DEL Litt. & Edu.
114 Dr. Srinivas Udgata PS OR Litt. & Edu.
115 Prof. Cannigaiper Uthamaroyan Velmurugendran PS TN Medicine

116 Dr. Sant Singh Virmani PS USA Science &
117 Shri Jawahar Wattal PS DEL Art
118 Prof. (Dr.) Surendra Singh Yadav PS DEL Medicine
119 Smt. Sentila T. Yanger PS NAG Art
2009
1 Pandit Bhimsen Gururaj Joshi BR MAH Art
2 Shri Sunderlal Bahuguna PV UTTR Others
3 Prof. Jasbir Singh Bajaj PV PUN Medicine
4 Prof. Debi Prasad Chattopadhyaya PV WB Litt. & Edu.
5 Dr. Ashok Sekhar Ganguly PV MAH Trade & Ind.
6 Sister Mary Nirmala Joshi M.C. PV WB Social Work
7 Dr. Anil Kakodkar PV MAH Science &
8 Dr. Purshotam Lal PV UP Medicine
9 Shri G. Madhavan Nair PV KAR Science &
10 Shri Govind Narain PV UP Public Affairs
11 Dr. Chandrika Prasad Srivastava PV MAH Civil Service
12 Dr. Isher Judge Ahluwalia PB DEL Litt. & Edu.
13 Dr. (Smt.) Inderjit Kaur Barthakur PB MEG Public Affairs
14 Smt. Shamshad Begum PB MAH Art
15 Shri Abhinav Bindra PB PUN Sports
16 Shri V.P. Dhananjayan PB TN Art
17 Smt. Shanta Dhananjayan PB TN Art
18 Dr. Ramachandra Guha PB KAR Litt. & Edu.
19 Shri Shekhar Gupta PB DEL Litt. & Edu.
20 Lord Khalid Hameed PB UK Medicine
21 Prof. (Dr.) Minoru Hara PB JPN Litt. & Edu.
22 Shri D. Jayakanthan PB TN Litt. & Edu.
23 Prof. Thomas Kailath PB USA Science &
24 Prof. (Dr.) Sarvagya Singh Katiyar PB UP Science &
25 Dr. G. Krishna PB AP Art
26 Prof. R.C. Mehta PB GUJ Art
27 Prof. A. Sreedhara Menon PB KER Litt. & Edu.
28 Shri Shashi Kant Misra PB HRY Civil Service
29 Shri Anilkumar Manibhai Naik PB MAH Trade & Ind.
30 Lt.Gen. Satish Nambiar PB DEL Others
31 Shri Kunwar Narain PB DEL Litt. & Edu.
32 Dr. Naganath Ramchandra Nayakawadi PB MAH Social Work
33 Dr. Kirit Shantilal Parikh PB DEL Public Affairs
34 Shri Satyam (Sam) Pitroda PB DEL Science &
35 Prof. C.K. Prahalad PB USA Litt. & Edu.
36 Dr. G.S. Randhawa PB DEL Science &
37 Dr. Brijendra Kumar Rao PB DEL Medicine
38 Dr. Bhakta Bhushan Rath PB USA Science &
39 Prof Conjeeveram Srirangachari Seshadri PB TN Science &

40 Dr. Vaidyanathan Ganapati Sthapati PB TN Art
41 Vaidya Devendra Triguna PB DEL Medicine
42 Dr. Sarojini Varadappan PB TN Social Work
43 Shri Pankaj Advani PS KAR Sports
44 Dr. Ameena Ahmad Ahuja PS DEL Art
45 Late Shri Tafazzul Ali PS ASM Art
46 Shri Suresh Gundu Amonkar PS GOA Litt. & Edu.
47 Smt. Aishwarya Rai Bachchan PS MAH Art
48 Dr. Utpal K. Banerjee PS DEL Litt. & Edu.
49 Dr. Kalyan Banerjee PS DEL Medicine
50 Smt. Hemi Bawa PS DEL Art
51 Shri Akshay Kumar Bhatia PS MAH Art
52 Shri Norden Tshering Bhutia PS SIK Litt. & Edu.
53 Dr. Kanneganti Brahmanandam PS AP Art
54 Dr. Bal Swarup Chaubey PS MAH Medicine
55 Shri Abhay Chhajlani PS MP Litt. & Edu.
56 Shri Ramkishore Chhipa (Derawala) PS RAJ Art
57 Shri Syamal Bhushan Ghosh Dastidar PS HRY Civil Service

58 Prof. Birendranath Datta PS ASM Litt. & Edu.
59 Smt. Shashi Deshpande PS KAR Litt. & Edu.
60 Ms. Devayani PS FRA Art
61 Shri Mahendra Singh Dhoni PS JKND Sports
62 Shri Prakash Narain Dubey PS MAH Art
63 Shri Suresh Dutta PS WB Art
64 Shri Shamsur Rahman Faruqi PS UP Litt. & Edu.
65 Shri Kalamandalam Gopi PS KER Art
66 Shri Niranjan Goswami PS WB Art
67 Dr. Alampur Saibaba Goud PS AP Medicine
68 Shri Bannanje Govindacharya PS KAR Litt. & Edu.
69 Dr. Ashok Kumar Grover PS DEL Medicine
70 Dr. Yash Gulati PS DEL Medicine
71 Dr. Ashok Kumar Gupta PS MAH Medicine
72 Prof. Syed Iqbal Hasnain PS DEL Others
73 Dr. Panchapakesa Jayaraman PS USA Litt. & Edu.
74 Shri Udit Narayan Jha PS MAH Art
75 Ms. Geeta Kapur PS DEL Art
76 Smt. Helen Khan PS MAH Art
77 Shri Hashmat Ullah Khan PS J&K Art
78 Dr. Mathoor Krishnamurti PS KAR Litt. & Edu.
79 Dr. S. Krishnaswamy PS TN Art
80 Shri Balbir Singh Kullar PS PUN Sports
81 Shri P.R. Krishna Kumar PS TN Medicine
82 Shri R.K. Krishna Kumar PS MAH Trade & Ind.
83 Dr. Arvind Lal PS DEL Medicine
84 Begum Bilkees I. Latif PS AP Social Work
85 Ms. Keepu Tsering Lepcha PS SIK Social Work
86 Shri Iravatham Mahadevan PS TN Art
87 Shri Jayanta Mahapatra PS OR Litt. & Edu.
88 Prof. Shyam Sunder Maheshwari PS RAJ Social Work
89 Aayu. Laxman Mane PS MAH Litt. & Edu.
90 Pandit Hridaynath Mangeshkar PS MAH Art
91 Shri Mattannoor Sankarankutty Marar PS KER Art

92 Dr. John Ralston Marr PS UK Litt. & Edu.
93 Ms. Penaz Doli Masani PS MAH Art
94 Dr. Alok Mehta PS DEL Litt. & Edu.
95 Shri Surinder Mehta PS DEL Others
96 Shri C. K. Menon PS UAE Social Work
97 Smt. Saoli Mitra PS WB Art
98 Shri Gobind Ram Nirmalkar PS CHHT Art
99 Dr. Shaik Khader Noordeen PS TN Medicine
100 Dr. (Smt.) Leela Omchery PS DEL Art
101 Dr. Pratapaditya Pal PS USA Art
102 Dr. Shyamlha Pappu PS DEL Public Affairs
103 Rev. Fr. Joseph Hilary Pereira PS MAH Social Work
104 Shri Harbhajan Singh Plaha PS PUN Sports
105 Dr. Devinder Singh Rana PS HIM Medicine
106 Shri Bansilal Rathi PS MP Social Work
107 Shri Sunil Kanti Roy PS WB Social Work
108 Prof. (Dr.) Thanikachalam Sadagopan PS TN Medicine
109 Shri Lalthangfala Sailo PS MIZ Litt. & Edu.
110 Smt. Aruna Sairam PS TN Art
111 Shri A. Sakthivel PS TN Trade & Ind.
112 Prof. Geshe Ngawang Samten PS UP Litt. & Edu.
113 Shri K. Asungba Sangtam PS NAG Public Affairs
114 Dr. A. Sankara Reddy PS DEL Litt. & Edu.
115 Shri Kumar Sanu PS MAH Art
116 Shri Ameen Sayani PS MAH Others
117 Dr. Kiran Seth PS DEL Art
118 Shri Gurumayum Gourakishor Sharma PS MAN Art

119 Dr. B.R. Shetty PS UAE Trade & Ind.
120 Dr. Ravindra Nath alias Ravindra Rajhans Shrivastava PS BIH Litt. & Edu.

121 Bhai Nirmal Singh 'Khalasa' PS PUN Art
122 Dr. R. Sivaraman PS KER Medicine
123 Prof. (Dr.) Ranbir Chander Sobti PS CHA Litt. & Edu.
124 Late Shri Skendrowell Syiemlieh PS MEG Art
125 Prof. Pramod Tandon PS MEG Science &
126 Prof. Jalees Ahmed Khan Tareen PS PUD Litt. & Edu.
127 Shri Thilakan PS KER Art
128 Prof. Ram Shankar Tripathi PS UP Litt. & Edu.
129 Shri K.P. Udayabhanu PS KER Art
130 Dr. Ashok Kumar Vaid PS DEL Medicine
131 Shri Sunny Varkey PS UAE Litt. & Edu.
132 Dr. G. Vijayaraghavan PS KER Medicine
133 Shri K. Viswanathan PS KER Social Work
134 Shri A. Vivekh PS TN Art
135 Shri Goriparthi Narasimha Raju Yadav PS AP Science &

2010
1 Shri Ebrahim Alkazi PV DEL Art
2 Dr. Venkatraman Ramakrishnan PV UK Science &
3 Dr. Yaga Venugopal Reddy PV AP Public Affairs
4 Dr. Prathap Chandra Reddy PV TN Trade & Ind.
5 Smt. Zohra Segal PV DEL Art
6 Dr. Umayalpuram K. Sivaraman PV TN Art
7 Dr. Satya Paul Agarwal PB DEL Medicine
8 Prof. Mohammad Amin PB DEL Litt. & Edu.
9 Shri Sailesh Kumar Bandyopadhyay PB WB Public Affairs
10 Shri Manvinder (Vindi) Singh Banga PB UK Trade & Ind.

11 Shri Anil Bordia PB RAJ Litt. & Edu.
12 Prof. Bipan Chandra PB DEL Litt. & Edu.
13 Shri Bal Krishna Chaturvedi PB DEL Civil Service
14 Shri Sant Singh Chatwal PB USA Public Affairs
15 Shri Gian Parkash Chopra PB DEL Litt. & Edu.
16 Prof. Tan Chung PB USA Litt. & Edu.
17 Prof. Madhusudan Amilal Dhaky PB GUJ Art
18 Dr. Padmakar Dubhashi PB MAH Civil Service
19 Dr. Pandit Puttaraj Kavi Gavaigalavaru PB KAR Art
20 Prof. Belle Monappa Hegde PB KAR Medicine
21 Shri Ilaiyaraaja PB TN Art
22 Shri Jagdish Chandra Kapur PB DEL Science &
23 Shri Shrinivas Vinayak Khale PB MAH Art
24 Ustad Sultan Khan PB MAH Art
25 Shri Aamir Khan PB MAH Art
26 Shri Ram Kumar PB DEL Art
27 Smt. Kumudini Lakhia PB GUJ Art
28 Shri Kuzhur Narayana Marar PB KER Art
29 Pandit Chhannulal Mishra PB UP Art
30 Ashtavaidy E.T. Narayanan Mooss PB KER Medicine
31 Capt. C.P. Krishnan Nair PB MAH Trade & Ind.
32 Shri Shripaul Oswal PB PUN Trade & Ind.
33 Shri Akbar Padamsee PB MAH Art
34 Dr. Ramakanta Madanmohan Panda PB MAH Medicine

35 Shri Eknathrao Vithalrao Patil PB MAH Social Work
alias Balasaheb Vikhe
36 Prof. Arogyaswami Joseph Paulraj PB USA Science &
37 Shri A.R. Rahman PB TN Art
38 Shri Moosa Raza PB DEL Civil Service
39 Dr. Mallika V. Sarabhhai PB GUJ Art
40 Dr. Nookala Chinna Satyanarayana PB AP Art
41 Prof. Abhijit Sen PB DEL Public Affairs
42 Prof. Satya Vrat Shastri PB DEL Litt. & Edu.
43 Dr. Noshir Minoo Shroff PB DEL Medicine
44 Shri Kushal Pal Singh PB DEL Trade & Ind.
45 Prof. Bikash Sinha PB WB Science &
46 Dr. Balagangadharanatha Swamiji PB KAR Social Work
47 Shri Narayanan Vaghul PB TN Trade & Ind.
48 Dr. Panniyampally Krishna Warrier PB KER Medicine
49 Dr. Fareed Rafiq Zakaria PB USA Litt. & Edu.
50 Shri Ramakant Vithal Achrekar PS MAH Sports
51 Smt. Anu Aga PS MAH Social Work
52 Dr. K.K. Aggarwal PS DEL Medicine
53 Dr. Philip Augustine PS KER Medicine
54 Smt. Gul Bardhan PS MP Art
55 Ms. Carmel Berkson PS MAH Art
56 Dr. Anil Kumar Bhalla PS DEL Medicine
57 Dr. Ranjit Bhargava PS UTTR Others
58 Dr. Lal Bahadur Singh Chauhan PS UP Litt. & Edu.
59 Shri Lalzuia Colney PS MIZ Litt. & Edu.
60 Dr. Maria Aurora Couto PS GOA Litt. & Edu.
61 Fr. Romuald DSouza PS GOA Litt. & Edu.
62 Ustad Faiyaz W. Dagar PS DEL Art
63 Smt. Haobam Ongbi Ngangbi Devi PS MAN Art

64 Dr. Vijay Prasad Dimri PS AP Science &
65 Ms. Bertha Gyndykes Dkhar PS MEG Litt. & Edu.
66 Dr. Surendra Dubey PS CHHT Litt. & Edu.
67 Dr. Rafael Iruzubieta Fernandez PS SPAN Public Affairs
68 Ms. Rekha Ganeshan PS MAH Art
69 Dr. Jawaharlal Rijhumal Gangaramani PS UAE Social Work
70 Shri Nemai Ghosh PS WB Art
71 Dr. Kodaganur S. Gopinath PS KAR Medicine
72 Smt. Sumitra Guha PS DEL Art
73 Dr. Laxmi Chand Gupta PS DEL Medicine
74 Prof. Pucadyil Ittoop John PS GUJ Science &
75 Shri Deep Chandra Joshi PS DEL Social Work
76 Shri D.R. Kaarthikeyan PS DEL Civil Service
77 Shri Kumar Ram Narain Karthikeyan PS TN Sports
78 Pandit Ulhas Kashalkar PS WB Art
79 Prof. Hamidi Kashmiri PS J&K Litt. & Edu.
80 Dr. Sudha Kaul PS WB Social Work
81 Prof. Sadiq-ur-Rahman Kidwai PS DEL Litt. & Edu.
82 Dr. J.R. Krishnamoorthy PS TN Medicine
83 Prof. Hermann Kulke PS GER Litt. & Edu.
84 Prof. Arvind Kumar PS MAH Litt. & Edu.
85 Dr. Mukund Lath PS RAJ Art
86 Dr. Vikas Haribhau Mahatme PS MAH Medicine
87 Shri T.N. Manoharan PS TN Trade & Ind.
88 Shri Ayekpam Tomba Meetei PS MAN Social Work
89 Dr. Kurian John Melamparambil PS KER Social Work
90 Shri Gulam Mohammad Mir PS J&K Others
91 Shri Irshad Mirza PS UP Trade & Ind.
92 Brig. (Dr.) Kapil Mohan PS HIM Trade & Ind.
93 Prof. Ramaranjan Mukherji PS WB Litt. & Edu.
94 Dr. Ram Dayal Munda PS JKND Art
95 Smt. Arundhati Nag PS KAR Art
96 Ms. Saina Nehwal PS AP Sports
97 Prof. Govind Chandra Pande PS MP Litt. & Edu.
98 Pandit Raghunath Panigrahi PS OR Art
99 Dr. Sudhir M. Parikh PS USA Social Work
100 Dr.(Smt.) Y.G. Rajalakshmi Parthasarathy PS TN Litt. & Edu.
101 Dr. Ranganathan Parthasarathy (Indira Parthasarathy) PS TN Litt. & Edu.

102 Shri Saif Ali Khan Pataudi PS MAH Art
103 Dr. Karsanbhai Khodidas Patel PS GUJ Trade & Ind.
104 Dr. Ravi Pillai PS BAH Trade & Ind.
105 Prof. Sheldon Pollock PS USA Litt. & Edu.
106 Shri Resul Pookutty PS KER Art
107 Shri Arjun Prajapati PS RAJ Art
108 Shri Deepak Puri PS DEL Trade & Ind.
109 Prof. (Dr.) Palpu Pushpangadan PS KER Science &
110 Shri K. Raghavan PS KER Art
111 Dr. Alluri Venkata Satyanarayana Raju PS AP Trade & Ind.

112 Dr. Shobha Raju PS AP Art
113 Dr. B. Ramana Rao PS KAR Medicine
114 Prof. M.R. Satyanarayana Rao PS KAR Science &
115 Guru Mayadhar Raut PS DEL Art
116 Prof. Vijayalakshmi Ravindranath PS KAR Science &
117 Shri Arun Sarma PS ASM Litt. & Edu.
118 Shri Virender Sehwag PS DEL Sports
119 Shri Kranti Shah PS MAH Social Work
120 Baba Sewa Singh PS PUN Social Work
121 Dr. Rabindra Narain Singh PS BIH Medicine
122 Shri Rajkumar Achouba Singh PS MAN Art
123 Shri Vijender Singh PS HRY Sports
124 Dr. Arvinder Singh Soin PS UP Medicine
125 Prof. Ponisseril Somasundaran PS USA Science &
126 Shri Venu Srinivasan PS TN Trade & Ind.
127 Shri Ignace Tirkey PS OR Sports
128 Dr. Jitendra Udhampuri PS J&K Litt. & Edu.
129 Shri Hari Uppal PS BIH Art
2011
1 Shri Montek Singh Ahluwalia PV DEL Public Affairs
2 Dr. Vijay Laxman Kelkar PV MAH Public Affairs
3 Dr. Akhlaq-Ur-Rahman Kidwai PV DEL Public Affairs
4 Prof. O.N.V. Kurup PV KER Litt. & Edu.
5 Dr. Sitakant Mahapatra PV ORI Litt. & Edu.
6 Shri Brajesh Chandra Mishra PV DEL Civil Service
7 Shri K Parasaran PV DEL Public Affairs
8 Shri Azim Premji PV KAR Trade & Ind.
9 Dr. Akkineni Nageswara Rao PV ANP Art
10 Prof. Palle Rama Rao PV ANP Science &
11 Dr. (Smt.) Kapila Vatsyayan PV DEL Art
12 Smt. Homai Vyarawalla PV GUJ Art
13 Shri S. P. Balasubrahmanyam PB TN Art
14 Smt. Rajashree Birla PB MAH Social Work
15 Dr. Mahesh Nilkanth Buch PB MP Civil Service
16 Shri C. V. Chandrasekhar PB TN Art
17 Shri Ajai Chowdhry PB DEL Trade & Ind.
18 Shri Yogesh Chander Deveshwar PB WB Trade & Ind.
19 Shri Satyadev Dubey PB MAH Art
20 Shri T. J. S. George PB KAR Litt. & Edu.
21 Shri Sankha Ghosh PB WB Litt. & Edu.
22 Shri S. Gopalakrishnan PB KAR Trade & Ind.
23 Dr. Keki Byram Grant (Posthumous) PB MAH Medicine
24 Shri Shashi Kapoor PB MAH Art
25 Shri Krishen Khanna PB HAR Art
26 Shri Khayyam PB MAH Art
27 Smt. Chanda Kochhar PB MAH Trade & Ind.
28 Shri Dwijen Mukherjee PB WB Art
29 Shri Madavoor Vasudevan Nair PB KER Art
30 Dr. Ramdas Madhav Pai PB KAR Litt. & Edu.
31 Shri Dasharath Patel (Posthumous) PB GUJ Art
32 Shri Rajendra Singh Pawar PB HAR Trade & Ind.
33 Dr. S. Ramachandran PB TN Science &
34 Smt. Shobhana Sitaram Ranade PB MAH Social Work
35 Dr. G. V. K. Reddy PB ANP Trade & Ind.
36 Dr. Kallam Anji Reddy PB ANP Trade & Ind.
37 Smt. Waheeda Rehman PB MAH Art
38 Shri Shyam Saran PB DEL Civil Service
39 Shri Analjit Singh PB DEL Trade & Ind.
40 Shri Surendra Singh PB DEL Civil Service
41 Ms. Arpita Singh PB DEL Art
42 Dr. Rudrapatna Krishna Sastry Srikantan PB KAR Art

43 Dr. K Raghavan Thirumulpad PB KER Medicine
44 Shri Mamraj Agarwala PS WB Social Work
45 Dr. Om Prakash Agrawal PS UP Others
46 Shri Mecca Rafeeque Ahmed PS TN Trade & Ind.
47 Prof.(Dr) M. Ahmed Ali PS TN Medicine
48 Prof. M. Annamalai PS KAR Science &
49 Dr. Jockin Arputham PS MAH Social Work
50 Shri Granville Austin PS UK Litt. & Edu.
51 Dr. Pukhraj Bafna PS CHAT Medicine
52 Prof.(Dr) Upendra Baxi PS UK Public Affairs
53 Shri Narayan Singh Bhati Zipashni PS ANP Civil Service
54 Dr. Mani Bhaumik PS USA Science &
55 Shri Mahim Bora PS ASM Litt. & Edu.
56 Ms. Urvashi Butalia PS DEL Litt. & Edu.
57 Shri Ajoy Chakrabarty PS WB Art
58 Prof. Pullella Sri Rama Chandrudu PS ANP Litt. & Edu.
59 Smt. Nomita Shipra Chandy PS KAR Social Work
60 Dr. Martha Alter Chen PS USA Social Work
61 Dr. Neelam Man Singh Chowdhry PS CHAN Art
62 Ms. Mamang Dai PS ARU Litt. & Edu.
63 Dr. Pravin Darji PS GUJ Litt. & Edu.
64 Shri Makar Dhwaj Darogha PS JHAR Art
65 Dr. Chandra Prakash Deval PS RAJ Litt. & Edu.
66 Smt. Kajol Devgan PS MAH Art
67 Smt. Mahasundari Devi PS BHR Art
68 Ms. N. Kunjarani Devi PS MANI Sports
69 Prof.(Dr) Madhukar Keshav Dhavalikar PS MAH Others
70 Prof.(Dr) Devi Prasad Dwivedi PS UP Litt. & Edu.
71 Shri Gajam Govardhana PS ANP Art
72 Dr. Mansoor Hasan PS UP Medicine
73 Smt. Sunayana Hazarilal PS MAH Art
74 Dr. Indira Hinduja PS MAH Medicine
75 Prof. S. R. Janakiraman PS TN Art
76 Shri Shaji Neelakantan Karun PS KER Art
77 Dr. Girish Kasaravalli PS KAR Art
78 Shri Sahabzade Irrfan Ali Khan PS MAH Art
79 Shri Sat Pal Khattar PS SING Trade & Ind.
80 Shri Balraj Komal PS DEL Litt. & Edu.
81 Prof. Krishna Kumar PS DEL Litt. & Edu.
82 Smt. Rajni Kumar PS DEL Litt. & Edu.
83 Shri Sushil Kumar PS DEL Sports
84 Smt. Shanti Teresa Lakra PS A&N Others
85 Shri V. V. S. Laxman PS ANP Sports
86 Shri Devanoora Mahadeva PS KAR Litt. & Edu.
87 Ms. Shital Kamalakar Mahajan PS MAH Sports
88 Dr. Shyama Prasad Mandal PS DEL Medicine
89 Shri Peruvanam Kuttan Marar PS KER Art
90 Shri Barun Mazumder PS WB Litt. & Edu.
91 Dr. M. H. Mehta PS GUJ Science &
92 Smt. Ritu Menon PS DEL Litt. & Edu.
93 Shri Jiyva Soma Mhase PS MAH Art
94 Dr. Azad Moopen M PS UAE Social Work
95 Smt. Gulshan Nanda PS DEL Others
96 Shri Gagan Narang PS ANP Sports
97 Dr. Avvai Natarajan PS TN Litt. & Edu.
98 Prof.(Dr) Bhalchandra Vana Nemade PS HP Litt. & Edu.
99 Smt. Sheela Patel PS MAH Social Work
100 Smt. Kshemavathy Pavithran PS KER Art
101 Dr. Jose Chacko Periappuram PS KER Medicine
102 Prof.(Dr) A Marthanda Pillai PS KER Medicine
103 Smt. Krishna Poonia PS RAJ Sports
104 Prof. Karl Harrington Potter PS USA Litt. & Edu.
105 Shri Dadi Dorab Pudumjee PS DEL Art
106 Prof. Riyaz Punjabi PS J&K Litt. & Edu.
107 Shri C. N. Raghavendran PS TN Science &
108 Prof. Koneru Ramakrishna Rao PS ANP Litt. & Edu.
109 Shri K. Raghavendra Rao PS TN Trade & Ind.
110 Ms. Anita Reddy PS KAR Social Work
111 Dr. Suman Sahai PS DEL Science &
112 Smt. Buangi Sailo PS MIZO Litt. & Edu.
113 Smt. Madras Kaderivelu Saroja PS TN Art
114 Shri P. K. Sen PS BHR Civil Service
115 Shri Anant Darshan Shankar PS KAR Public Affairs
116 Shri Gopalan Nair Shankar PS KER Science &
117 Prof. D. D. Sharma PS UTTR Litt. & Edu.
118 Prof. Nilamber Dev Sharma PS J&K Litt. & Edu.
119 Prof. E. A. Siddiq PS ANP Science &
120 Shri Harbhajan Singh PS PUN Sports
121 Shri Khangembam Mangi Singh PS MANI Art
122 Shri Jayaram Subramaniam PS TN Art
123 Dr. Subra Suresh PS USA Science &
124 Ms. Tabu PS MAH Art
125 Shri Kanubhai Hasmukhbhai Tailor PS GUJ Social Work

126 Shri Prahlad Singh Tipanya PS MP Art
127 Smt. Usha Uthup PS WB Art
128 Prof.(Dr) Sivapatham Vittal PS TN Medicine
2012
1 Dr. Bhupendra Kumar Hazarika PV USA Art
2 Shri Mario de Miranda PV GOA Art
3 Shri T. V. Rajeswar PV DEL Civil Service
4 Dr. Kantilal Hastimal Sancheti PV MAH Medicine
5 Prof. Kalpathi Ganapathi Subramanyan PV GUJ Art
6 Dr. Suresh Hariram Advani PB MAH Medicine
7 Ms. Shabana Azmi PB MAH Art
8 Prof. Homi K. Bhabha PB USA Litt. & Edu.
9 Prof. Shashikumar Madhusudan Chitre PB MAH Science &

10 Shri Khaled Choudhury PB WB Art
11 Shri Jatin Das PB DEL Art
12 Prof. Vidya Dehejia PB USA Litt. & Edu.
13 Shri Dharmendra PB MAH Art
14 Shri Satya Narayan Goenka PB MAH Social Work
15 Dr. T. V. Gopalakrishnan PB TN Art
16 Shri M.S. Gopalakrishnan PB TN Art
17 Shri Buddhadev Das Gupta PB WB Art
18 Shri Sunil Janah PB USA Art
19 Shri Anish Kapoor PB Great Art
20 Prof.(Dr.) Shantaram Balwant Mujumdar PB MAH Litt. & Edu.
21 Shri B. Muthuraman PB MAH Trade & Ind.
22 Smt. Mira Nair PB DEL Art
23 Prof. Arvind Panagariya PB USA Litt. & Edu.
24 Dr. Jose Pereira PB USA Litt. & Edu.
25 Shri Mata Prasad PB UP Civil Service
26 Dr. Madabusi Santanam Raghunathan PB MAH Science &
27 Dr. Patibandla Chandrasekhara Rao PB AP Public Affairs

28 Shri Ronen Sen PB DEL Civil Service
29 Dr. Devi Prasad Shetty PB KAR Medicine
30 Shri Murugappa Vellayan Subbiah PB TN Trade & Ind.
31 Shri Nagarajan Vittal PB TN Civil Service
32 Dr. Prof. Noshir Hormusji Wadia PB MAH Medicine
33 Shri George Yong-Boon Yeo PB SING Public Affairs
34 Shri Limba Ram Ahari PS RAJ Sports
35 Shri Satish Vasant Alekar PS MAH Art
36 Dr. Nitya Anand PS UP Medicine
37 Shri S. M. Arif PS AP Sports
38 Shri Ajeet Bajaj PS HAR Sports
39 Prof. Rameshwar Nath Koul Bamezai PS J&K Science &
40 Dr. Mukesh Batra PS MAH Medicine
41 Smt. Shamshad Begum PS CHAT Social Work
42 Shri Vanraj Bhatia PS MAH Art
43 Dr. Krishan Lal Chadha PS DEL Science &
44 Prof. Ravi Chaturvedi PS DEL Sports
45 Prof. Virander Singh Chauhan PS DEL Science &
46 Smt. Nameirakpam Ibemni Devi PS MANI Art
47 Smt. Reeta Devi PS DEL Social Work
48 Smt. Geeta Dharmarajan PS DEL Litt. & Edu.
49 Pandit Shri Gopal Prasad Dubey PS JRKN Art
50 Shri Arun Hastimal Firodia PS MAH Trade & Ind.
51 Dr. Eberhard Fischer PS SWIT Litt. & Edu.
52 Dr. P.K. Gopal PS TN Social Work
53 Ms. Jhulan Goswami Goswami PS WB Sports
54 Shri Swapan Guha PS RAJ Others
55 Shri Umakant Gundecha PS MP Art
56 Shri Ramakant Gundecha PS MP Art
57 Shri Kedar Gurung PS SIK Litt. & Edu.
58 Prof. Dr. Mahdi Hasan PS UP Medicine
59 Shri Ramachandra Subraya Hegde Chittani PS KAR Art
60 Shri Zafar Iqbal PS UP Sports
61 Shri Anup Jalota PS MAH Art
62 Smt. Yamunabai Vikram Jawle (Waikar) PS MAH Art
63 Shri Devendra Jhajhria PS RAJ Sports
64 Dr. Kota Ullas Karanth PS KAR Others
65 Shri Moti Lal Kemmu PS J&K Art
66 Shri Shahid Parvez Khan PS MAH Art
67 Dr. Jugal Kishore PS DEL Medicine
68 Shri Mohan Lal Kumhar PS RAJ Art
69 Shri Yezdi Hirji Malegam PS MAH Public Affairs
70 Shri Sakar Khan Manganiar PS RAJ Art
71 Smt. Joy Michael PS DEL Art
72 Dr. Minati Mishra PS ORI Art
73 Dr. V. Mohan PS TN Medicine
74 Dr. G. Muniratnam PS AP Social Work
75 Shri N. Muthuswamy PS TN Art
76 Smt. R. Nagarathnamma PS KAR Art
77 Dr. J. Hareendran Nair PS KER Medicine
78 Shri Kalamandalam Sivan Namboothiri PS KER Art
79 Dr. Vallalarpuram Sennimalai Natarajan PS TN Medicine

80 Prof. Katragadda Paddayya PS MAH Others
81 Shri Niranjan Pranshankar Pandya PS MAH Social Work
82 Shri Pravin Harjivandas Parekh PS DEL Public Affairs
83 Dr. Surjit Singh Patar PS PUNJ Litt. & Edu.
84 Ms. Priya Paul PS DEL Trade & Ind.
85 Shri Gopinath Pillai PS SING Trade & Ind.
86 Dr. Swati A. Piramal PS MAH Trade & Ind.
87 Shri Soman Nair Priyadarsan PS TN Art
88 Prof. Yagnaswamy Sundara Rajan PS KAR Science &
89 Shri T. Vengadapathi Reddiar PS POND Others
90 Prof. Sachchidanand Sahai PS HAR Litt. & Edu.
91 Shri Kartikeya V. Sarabhai PS GUJ Others
92 Shri Irwin Allan Sealy PS UTT Litt. & Edu.
93 Ms. Pepita Seth PS KER Litt. & Edu.
94 Shri Vijay Sharma PS HP Art
95 Prof. Shoji Shiba PS JPN Trade & Ind.
96 Shri Vijay Dutt Shridhar PS MP Litt. & Edu.
97 Prof. Jagadish Shukla PS USA Science &
98 Dr. Vijaipal Singh PS UP Science &
99 Dr. Jitendra Kumar Singh PS BIH Medicine
100 Dr. Lokesh Kumar Singhal PS HAR Science &
101 Prof. Ralte L. Thanmawia PS MIZO Litt. & Edu.
102 Dr. Uma Tuli PS DEL Social Work
103 Ms. Laila Tyabji PS DEL Art
104 Shri Prabhakar Ambadaspant Vaidya PS MAH Sports

105 Dr. Shrinivas S. Vaishya PS DAM Medicine
106 Shri Sat Paul Varma PS J&K Social Work
107 Dr. Adimurthy Vipparthi PS KER Science &
108 Smt. Phoolbasan Yadav PS CHAT Social Work
109 Smt. Binny Yanga PS ARP Social Work
2013
1 Shri Raghunath Mohapatra PV ORI Art
2 Prof. Roddam Narasimha PV KAR Science &
3 Prof. Yash Pal PV UP Science &
4 Shri Sayed Haider Raza PV DEL Art
5 Prof. Satya Nadham Atluri PB USA Science &
6 Dr. Maharaj Kishan Bhan PB DEL Civil Service
7 Shri Jaspal Singh Bhatti PB CHAN Art
8 Shri Rahul Dravid PB KAR Sports
9 Shri Adi Godrej PB MAH Trade & Ind.
10 Ustad Abdul Rashid Khan PB WB Art
11 Shri Rajesh Khanna PB MAH Art
12 Smt. M. C. Mary Kom PB MANI Sports
13 Dr. Nandkishore Shamrao Laud PB MAH Medicine
14 Shri Mangesh Padgaonkar PB MAH Litt. & Edu.
15 Shri Hemendra Singh Panwar PB HAR Civil Service
16 Prof. Jogesh Chandra Pati PB USA Science &
17 Shri Shivajirao Girdhar Patil PB MAH Public Affairs
18 Dr. Apathukatha Sivathanu Pillai PB DEL Science &
19 Dr. D. Ramanaidu PB AP Art
20 Dr.(Smt) Kanak Yatindra Rele PB MAH Art
21 Dr. Vijay Kumar Saraswat PB DEL Science &
22 Prof. Ashoke Sen PB UP Science &
23 Prof. Gayatri Chakravorty Spivak PB USA Litt. & Edu.
24 Dr. Byrana Nagappa Suresh PB KAR Science &
25 Smt. Sharmila Tagore PB DEL Art
26 Shri Ramamurthy Thyagarajan PB TN Trade & Ind.
27 Dr. Saroja Vaidyanathan PB DEL Art
28 Prof. Anvita Abbi PS DEL Litt. & Edu.
29 Dr. Sudarshan Kumar Aggarwal PS DEL Medicine
30 Prof. Manindra Agrawal PS UP Science &
31 Smt. Premlata Agrawal PS JHAR Sports
32 Prof. Mohammad Sharfe Alam PS BIH Litt. & Edu.
33 Shri S. Shakir Ali PS RAJ Art
34 Shri Gajam Anjaiah PS AP Art
35 Prof. Rajendra Achyut Badwe PS MAH Medicine
36 Prof. Mustansir Barma PS MAH Science &
37 Dr. Hemendra Prasad Barooah PS WB Trade & Ind.
38 Shri Pablo Bartholomew PS DEL Art
39 Swami G. C. D. Bharti Alias Bandhu Bharti PS CHAT Art

40 Shri Apurba Kishore Bir PS MAH Art
41 Dr. Ravindra Singh Bisht PS UP Others
42 Shri Ghanakanta Bora Borbayan PS ASM Art
43 Shri Avinash Chander PS DEL Science &
44 Ms. Jharna Dhara Chowdhury PS BD Social Work
45 Prof. K. C. Chunekar PS UP Medicine
46 Dr. Taraprasad Das PS ORI Medicine
47 Shri Purna Chandra Das PS WB Art
48 Prof. (Dr.) Trichur Viswanathan Devarajan PS TN Medicine
49 Prof. Sanjay Govind Dhande PS MAH Science &
50 Shri Yogeshwar Dutt PS HAR Sports
51 Shri Nida Fazli PS MAH Litt. & Edu.
52 Shri H. N. Girisha PS KAR Sports
53 Prof.(Dr.) Saroj Chooramani Gopal PS UP Medicine
54 Dr. J. Gowrishankar PS AP Science &
55 Dr. Vishwa Kumar Gupta PS DEL Medicine
56 Dr. Radhika Herzberger PS AP Litt. & Edu.
57 Smt. B. Jayashree PS KAR Art
58 Prof.(Dr) Pramod Kumar Julka PS DEL Medicine
59 Prof. Sharad Pandurang Kale PS MAH Science &
60 Shri Milind Pralhad Kamble PS MAH Trade & Ind.
61 Smt. Sridevi Kapoor PS MAH Art
62 Prof. Noboru Karashima PS JAPA Litt. & Edu.
63 Dr. Gulshan Rai Khatri PS DEL Medicine
64 Dr. Ram Krishan PS UP Social Work
65 Smt. Ritu Kumar PS DEL Others
66 Subedar Vijay Kumar PS MP Sports
67 Shri Salik Lakhnawi PS WB Litt. & Edu.
68 Shri S. (Bapu) Lakshminarayana PS TN Art

69 Smt. Hilda Mit Lepcha PS SKM Art
70 Smt. Vandana Luthra PS DEL Trade & Ind.
71 Shri SKM. Maeilanandhan PS TN Social Work
72 Shri J. Malsawma PS MIZO Litt. & Edu.
73 Dr. Ganesh Kumar Mani PS DEL Medicine
74 Dr. Amit Prabhakar Maydeo PS MAH Medicine
75 Shri Kailash Chandra Meher PS ORI Art
76 Ms. Neelima Chandrashekhar Mishra PS MAH Social Work

77 Smt. Sudha Malhotra Motwane PS MAH Art
78 Shri P. Madhavan Nair (Madhu) PS KER Art
79 Smt. Reema Nanavaty PS GUJ Social Work
80 Dr. Sundaram Natarajan PS MAH Medicine
81 Prof. Sankar Kumar Pal PS WB Science &
82 Shri Brahmdeo Ram Pandit PS MAH Art
83 Shri Nana Gajanan Patekar PS MAH Art
84 Shri Devendra Patel PS GUJ Litt. & Edu.
85 Smt. Rajshree Pathy PS TN Trade & Ind.
86 Dr. Deepak Bhaskar Phatak PS MAH Science &
87 Prof. Christopher Pinney PS UK Litt. & Edu.
88 Dr. Mudundi Ramakrishna Raju PS AP Science &
89 Smt. Manju Bharat Ram PS DEL Social Work
90 Dr. C. Venkata S. Ram PS AP Medicine
91 Shri R. Nageswara Rao (Babji) PS AP Art
92 Smt. Kalpana Saroj PS MAH Trade & Ind.
93 Ustad Ghulam Mohammed Saznawaz PS J&K Art
94 Shri Surender Sharma PS DEL Litt. & Edu.
95 Smt. Jaymala Jayram Shiledar PS MAH Art
96 Dr. Rama Kant Shukla PS DEL Litt. & Edu.
97 Shri Ngangom Dingko Singh PS MAH Sports
98 Dr. Jagdish Prasad Singh PS BIH Litt. & Edu.
99 Shri Ramesh Gopaldas Sippy PS MAH Art
100 Prof. Ajay Kumar Sood PS KAR Science &
101 Shri Bajrang Lal Takhar PS RAJ Sports
102 Pandit Suresh Talwalkar PS MAH Art
103 Dr. Maharukh Tarapore PS MAH Art
104 Shri Balwant Thakur PS J&K Art
105 Shri Rajendar Kumar Tiku PS J&K Art
106 Prof. Krishnaswamy Vijayraghavan PS DEL Science &
107 Prof. Akhtarul Wasey PS DEL Litt. & Edu.
2014
1 Prof. C. N. R. Rao BR KAR Science &
2 Shri Sachin Ramesh Tendulkar BR MAH Sports
3 Shri Bellur Krishnamachar Sundararaja Iyengar PV MAH Others

4 Dr. Raghunath Anant Mashelkar PV MAH Science &
5 Prof. Anisuzzaman PB BANG Litt. & Edu.
6 Dr. Mrityunjay B. Athreya PB DEL Litt. & Edu.
7 Prof. P. Balaram PB KAR Science &
8 Dr. Justice Dalveer Bhandari PB NETH Public Affairs
9 Shri Ruskin Bond PB UTT Litt. & Edu.
10 Ms. Anita Desai PB USA Litt. & Edu.
11 Shri Pullela Gopichand PB AP Sports
12 Shri Kamal Haasan PB TN Art
13 Prof. Jyeshtharaj Bhalchandra Joshi PB MAH Science &

14 Shri Vijayendra Nath Kaul PB DEL Civil Service
15 Prof. (Dr) Neelam Kler PB DEL Medicine
16 Dr. Madappa Mahadevappa PB KAR Science &
17 Shri Leander Paes PB MAH Sports
18 Dr. Koppillil Radhakrishnan PB KAR Science &
19 Dr. Anumolu Ramakrishna PB TN Science &
20 Dr. Thirumalachari Ramasami PB DEL Science &
21 Prof. Susanne H. Rudolph PB USA Litt. & Edu.
22 Prof. Lloyd I. Rudolph PB USA Litt. & Edu.
23 Dr. Vinod Prakash Sharma PB DEL Science &
24 Shri Gulammohammed Sheikh PB GUJ Art
25 Begum Parween Sultana PB MAH Art
26 Dr. Dhirubhai P. Thaker PB GUJ Litt. & Edu.
27 Shri Vairamuthu PB TN Litt. & Edu.
28 Shri T.H. Vikku Vinayakram PB TN Art
29 Dr. Naheed Abidi PS UP Litt. & Edu.
30 Dr. Kiritkumar Mansukhlal Acharya PS GUJ Medicine
31 Dr. Subrat Kumar Acharya PS DEL Medicine
32 Shri Mohammad Ali Baig PS AP Art
33 Ms Vidya Balan PS MAH Art
34 Shri Sekhar Basu PS MAH Science &
35 Shri Musafir Ram Bhardwaj PS HP Art
36 Prof. (Dr.) Balram Bhargava PS DEL Medicine
37 Prof. Ashok Chakradhar PS DEL Litt. & Edu.
38 Prof. (Dr.) Indira Chakravarty PS WB Medicine
39 Shri M. Chandradathan PS KER Science &
40 Ms Sabitri Chatterjee PS WB Art
41 Shri Chhakchhuak Chhuanvawra PS MIZO Litt. & Edu.
42 Ms Anjum Chopra PS HAR Sports
43 Dr. Sunil Dabas PS HAR Sports
44 Dr. Narendra Achyut Dabholkar PS MAH Social Work
45 Shri Keki N. Daruwalla PS DEL Litt. & Edu.
46 Shri Sunil Das PS WB Art
47 Prof. Biman Bihari Das PS DEL Art
48 Dr. Ramakant Krishnaji Deshpande PS MAH Medicine
49 Ms Supriya Devi PS WB Art
50 Smt. Elam Indira Devi PS MANI Art
51 Prof. G. N. Devy PS GUJ Litt. & Edu.
52 Shri Love Raj Singh Dharmshaktu PS UTT Sports
53 Dr. Brahm Dutt PS HAR Social Work
54 Prof. Kolakaluri Enoch PS AP Litt. & Edu.
55 Prof. Ved Kumari Ghai PS J&K Litt. & Edu.
56 Pandit Vijay Ghate PS MAH Art
57 Prof. Jayanta Kumar Ghosh PS WB Science &
58 Shri Mukul Chandra Goswami PS ASSA Social Work
59 Prof. (Dr.) Pawan Raj Goyal PS HAR Medicine
60 Dr. (Prof.) Rajesh Kumar Grover PS DEL Medicine
61 Shri Ravi Bhushan Grover PS MAH Science &
62 Dr. Amod Gupta PS HAR Medicine
63 Prof. (Dr.) Daya Kishore Hazra PS UP Medicine
64 Prof. Ramakrishna Vijayacharya Hosur PS MAH Science &

65 Prof. Ramaswamy R. Iyer PS DEL Science &
66 Prof. (Dr.) Thenumgal Poulose Jacob PS TN Medicine
67 Smt. Manorama Jafa PS DEL Litt. & Edu.
68 Smt. Durga Jain PS MAH Social Work
69 Prof. Eluvathingal Devassy Jemmis PS KAR Science &
70 Smt. Naina Apte Joshi PS MAH Art
71 Prof. (Dr.) Shashank Chandra Ramesh Joshi PS MAH Medicine

72 Shri Bansi Kaul PS DEL Art
73 Shri Jawahar Lal Kaul PS DEL Social Work
74 Prof. Hakim Syed Khaleefathullah PS TN Medicine
75 Ustad Moinuddin Khan PS RAJ Art
76 Prof. Rehana Khatoon PS DEL Litt. & Edu.
77 Dr. (Mrs.) P. Kilemsungla PS DEL Litt. & Edu.
78 Dr. Milind Vasant Kirtane PS MAH Medicine
79 Shri Alur Seelin Kiran Kumar PS GUJ Science &
80 Dr. Lalit Kumar PS DEL Medicine
81 Shri Ashok Kumar Mago PS USA Public Affairs
82 Smt. Geeta Mahalik PS DEL Art
83 Shri Paresh Maity PS DEL Art
84 Prof. (Dr.) Sengaku Mayeda PS JAPA Litt. & Edu.
85 Shri Waikhom Gojen Meetei PS MANI Litt. & Edu.
86 Dr. Mohan Mishra PS BIHA Medicine
87 Shri Ram Mohan PS MAH Art
88 Prof. Vamsi Krishna Mootha PS USA Medicine
89 Dr. Siddhartha Mukherjee PS USA Medicine
90 Dr. Nitish Naik PS DEL Medicine
91 Dr. M. Subhadra Nair PS KER Medicine
92 Prof. Vishnu Narayanan Namboodiri PS KER Litt. & Edu.
93 Shri Ravi Kumar Narra PS AP Trade & Ind.
94 Smt. Rani Karnaa Nayak PS WB Art
95 Ms Dipika Rebecca Pallikal PS TN Sports
96 Dr. Ashok Panagriya PS RAJ Medicine
97 Dr. Narendra Kumar Pandey PS HAR Medicine
98 Dr. Ajay Parida PS TN Science &
99 Shri Sudarsan Pattnaik PS ORI Art
100 Shri Pratap Govind Pawar PS MAH Trade & Ind.
101 Shri H. Boniface Prabhu PS KAR Sports
102 Dr. Sunil Pradhan PS UP Medicine
103 Dr. Malapaka Yejneswara Satyanarayana Prasad PS AP Science &

104 Dr. Ashok Rajgopal PS DEL Medicine
105 Dr. Kamini A. Rao PS KAR Medicine
106 Shri Paresh Rawal PS MAH Art
107 Shri Wendell Augustine Rodricks PS GOA Others
108 Dr. Sarbeswar Sahariah PS AP Medicine
109 Shri Rajesh Kumar Saraiya PS MAH Trade & Ind.
110 Prof. Kalamandalam Sathyabhama PS KER Art
111 Shri Mathurbhai Savani PS GUJ Social Work
112 Dr. Hasmukh Chimanlal Shah PS GUJ Public Affairs
113 Shri Anuj (Ramanuj) Sharma PS CHHA Art
114 Prof. Vinod Kumar Singh PS MP Science &
115 Shri Yuvraj Singh PS HAR Sports
116 Prof. Dinesh Singh PS DEL Litt. & Edu.
117 Dr. Brahma Singh PS DEL Science &
118 Shri Santosh Sivan PS TN Art
119 Smt. Mamta Sodha PS HAR Sports
120 Ms Mallika Srinivasan PS TN Trade & Ind.
121 Dr. Anumolu Sriramarao PS AP Social Work
122 Dr. Govindan Sundararajan PS AP Science &
123 Ms Parveen Talha PS UP Civil Service
124 Ms Sooni Taraporevala PS MAH Art
125 Prof. (Dr.) Jeewan Singh Titiyal PS DEL Medicine
126 Shri Tashi Tondup PS J&K Public Affairs
127 Prof. Om Prakash Upadhyaya PS PUNJ Medicine
128 Prof. (Dr.) Mahesh Verma PS DEL Medicine